// Module: Bods3drw.obj
// Source: C:\Copter\Source\X\Objects\Bods3drw.c
// autogenerated by simcopter_tool from PDB file

// Type: long;

// Type: double;

// Type: int32_t;

// Type: /*unpacked*/ struct _dPoint2d (forward reference);
struct _dPoint2d{ // not packed(0x10 bytes) TI: 0x34b4
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double z; // 0x8 bytes
};

// Type: char *;

// Type: short;

// Type: unsigned char;

// Type: void;

// Type: /*unpacked*/ struct Point3d;
struct Point3d{ // not packed(0xc bytes) TI: 0x348f
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: float;

// Type: /*unpacked*/ struct BmpLineInfo;
struct BmpLineInfo{ // not packed(0x18 bytes) TI: 0x3495
	/*+0x0*/   long width;
	/*+0x4*/   long index;
	/*+0x8*/   double xStride; // 0x8 bytes
	/*+0x10*/  unsigned char * ptr;
};

// Type: unsigned char *;

// Type: /*unpacked*/ struct VRBmpHdr (forward reference);
struct VRBmpHdr{ // not packed(0x10 bytes) TI: 0x34b9
	/*+0x0*/   /*unpacked*/ struct VRBmpInfo info; // 0xc bytes
	/*+0xc*/   int32_t ScanOffset[1];
};

// Type: /*unpacked*/ struct Point3D;
struct Point3D{ // not packed(0x18 bytes) TI: 0x349b
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double y; // 0x8 bytes
	/*+0x10*/  double z; // 0x8 bytes
};

// Type: /*unpacked*/ struct BmpLineInfo (forward reference);
struct BmpLineInfo{ // not packed(0x18 bytes) TI: 0x3495
	/*+0x0*/   long width;
	/*+0x4*/   long index;
	/*+0x8*/   double xStride; // 0x8 bytes
	/*+0x10*/  unsigned char * ptr;
};

// Type: /*unpacked*/ struct Point3d (forward reference);
struct Point3d{ // not packed(0xc bytes) TI: 0x348f
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: char;

// Type: unsigned long;



// Contribution: 1:00162ea0-00164a36 Module: 186, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00563ea0
int32_t Check_Pointer(char * ptr, short numchars, char * text) {
// LINE 119:
	return 0x1;
// LINE 120:
}

// FUNCTION: COPTER_D 0x00563eb5
void MyPixel(int32_t x, int32_t y, unsigned char color) {
	/*bp-0x4*/   char * ptr;

// LINE 148:
	__asm        cmp    x, 0;
	__asm        jl     _T1d;

	__asm        cmp    y, 0;
	__asm        jge    _T22;
_T1d:
	return;
// LINE 149:
_T22:
	__asm        mov    eax, Pwinwidth;
	__asm        dec    eax;
	__asm        cmp    eax, x;
	__asm        jl     _T40;

	__asm        mov    eax, Pwinheight;
	__asm        dec    eax;
	__asm        cmp    eax, y;
	__asm        jge    _T45;
_T40:
	return;
// LINE 151:
_T45:
	ptr = (((y * Pbufwidth) + x) + buffer1);
// LINE 152:
	__asm        push   0x5BEF48;
	__asm        push   1;
	__asm        mov    eax, ptr;
