// Module: Bods.obj
// Source: C:\Copter\Source\X\Objects\Bods.cpp
// autogenerated by simcopter_tool from PDB file

// Type: short;

// Type: /*unpacked*/ struct Rect;
struct Rect{ // not packed(0x8 bytes) TI: 0x3463
	/*+0x0*/   short top; // 0x2 bytes
	/*+0x2*/   short left; // 0x2 bytes
	/*+0x4*/   short bottom; // 0x2 bytes
	/*+0x6*/   short right; // 0x2 bytes
};

// Type: /*unpacked*/ struct TransformedInfo (forward reference);
struct TransformedInfo{ // not packed(0x14 bytes) TI: 0x3750
	/*+0x0*/   /*unpacked*/ struct Point startPoint;
	/*+0x4*/   /*unpacked*/ struct Point endPoint;
	/*+0x8*/   short startDepth; // 0x2 bytes
	/*+0xa*/   short endDepth; // 0x2 bytes
	/*+0xc*/   unsigned char bStartTransformed; // 0x1 bytes
	/*+0xd*/   unsigned char bEndTransformed; // 0x1 bytes
	/*+0x10*/  float info;
};

// Type: /*unpacked*/ struct cCopterBody::Part (forward reference);
struct cCopterBody::Part{ // not packed(0x28 bytes) TI: 0x33f0
	/*+0x0*/   signed char drawProc; // 0x1 bytes
	/*+0x1*/   signed char calcID; // 0x1 bytes
	/*+0x2*/   signed char framePartID; // 0x1 bytes
	/*+0x3*/   signed char color; // 0x1 bytes
	/*+0x4*/   signed char scaleFlags; // 0x1 bytes
	/*+0x5*/   signed char dontAnimateColor; // 0x1 bytes
	/*+0x6*/   signed char _pad2; // 0x1 bytes
	/*+0x7*/   signed char _pad3; // 0x1 bytes
	/*+0x8*/   unsigned long tinyName;
	/*+0xc*/   unsigned long parentName;
	/*+0xc*/   /*unpacked*/ struct cCopterBody::Part *parent;
	/*+0x10*/  /*unpacked*/ struct Point tmpCenterPt;
	/*+0x14*/  /*unpacked*/ struct Point tmpEndPt;
	/*+0x18*/  short tmpCenterDepth; // 0x2 bytes
	/*+0x1a*/  short tmpEndDepth; // 0x2 bytes
	/*+0x1c*/  float length;
	/*+0x20*/  float width;
	/*+0x24*/  float taper;
};

// Type: /*unpacked*/ class cBList<cCopterBody> (forward reference);
class cBList<cCopterBody> : public PtrList<cCopterBody>
{ // not packed(0x14 bytes) TI: 0x33ed
public:
	long GetIndex(unsigned long);
	long GetIndex(/*unpacked*/ class cCopterBody*);
	void cBList<cCopterBody>();
	void ~cBList<cCopterBody>();
	void Delete();
	void DeletePointers();
	void DeletePointersAndSelf();
	long CountByBodyType(unsigned long);
	/*unpacked*/ class cCopterBody* GetByBodyType(unsigned long, long);
	long GetIndexInBodyType(/*unpacked*/ class cCopterBody*);
	/*unpacked*/ class cCopterBody* GetByName(unsigned long, long);
	virtual void Add(/*unpacked*/ class cCopterBody*); // vtable+0x0
	void WriteToDisk();
	void WriteToDiskIfDirty();
	/*+0xc*/   /*unpacked*/ class ResFile *fFile;
	/*+0x10*/  unsigned long fType;
	void CompactFile();
	// calltype: NearC
	static /*unpacked*/ class cBList<cCopterBody>* MakeNew(unsigned char *, unsigned long);
	void LoadAll();
};

// Type: /*unpacked*/ class cCopterBody (forward reference);
// cCopterBody Class implementation not found

// Type: unsigned long;

// Type: /*unpacked*/ struct AnimLookup (forward reference);
struct AnimLookup{ // not packed(0x8 bytes) TI: 0x3427
	/*+0x0*/   unsigned long animName;
	/*+0x4*/   unsigned long privAnimName;
};

// Type: /*unpacked*/ class cCopterAnim (forward reference);
// VTABLE: COPTER_D 0x00593658
class cCopterAnim : public cBBase
{ // not packed(0x2c bytes) TI: 0x3404
public:
	void cCopterAnim();
	virtual void ~cCopterAnim() /* override */;
	virtual void Destroy() /* override */;
	virtual void WriteToDisk() /* override */;
	virtual unsigned short IsDirty() /* override */;
	virtual unsigned long GetBodyType() /* override */;
	virtual void InstallArrayPointers(unsigned short) /* override */;
	static /*unpacked*/ class cBList<cCopterAnim> *fsList;
	virtual /*unpacked*/ class cBList<cBBase>* GetList() /* override */;
	virtual /*unpacked*/ struct PrivAnimPartInfo* GetPartInfo(short, short); // vtable+0x24
	virtual /*unpacked*/ struct PrivAnimPartInfo* GetPartInfoBasePtr(short); // vtable+0x28
	/*+0x28*/  /*unpacked*/ class cArray<PrivAnimPartInfo> *fPrivPartInfo;
	short GetNumParts();
	short GetNumFrames();
	// calltype: NearC
	static /*unpacked*/ class cBBase* MakeNew(void * __ptr32);
	// calltype: NearC
	static /*unpacked*/ class cCopterAnim* MakeNew(unsigned long, /*unpacked*/ class cCopterBody*);
	// calltype: NearC
	static void LoadAllRelatedArrays(/*unpacked*/ class ResFile*);
	// calltype: NearC
	static void DestroyAll();
};

// Type: unsigned short;

// Type: unsigned char *;

// Type: float;

// Type: /*unpacked*/ struct TransformedInfo;
struct TransformedInfo{ // not packed(0x14 bytes) TI: 0x3750
	/*+0x0*/   /*unpacked*/ struct Point startPoint;
	/*+0x4*/   /*unpacked*/ struct Point endPoint;
	/*+0x8*/   short startDepth; // 0x2 bytes
	/*+0xa*/   short endDepth; // 0x2 bytes
	/*+0xc*/   unsigned char bStartTransformed; // 0x1 bytes
	/*+0xd*/   unsigned char bEndTransformed; // 0x1 bytes
	/*+0x10*/  float info;
};

// Type: /*unpacked*/ struct Point;
struct Point{ // not packed(0x4 bytes) TI: 0x341c
	/*+0x0*/   short v; // 0x2 bytes
	/*+0x2*/   short h; // 0x2 bytes
};

// Type: /*unpacked*/ struct Point3d;
struct Point3d{ // not packed(0xc bytes) TI: 0x348f
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: enum SPHERE_SHADE_FLAG;
enum SPHERE_SHADE_FLAG {
	NO_SHADE = 0,
	GRAD_SHADE = 1,
	GRAD_DITHER_SHADE = 2,
};

// Type: /*unpacked*/ struct PrivAnimPartInfo (forward reference);
struct PrivAnimPartInfo{ // not packed(0x8 bytes) TI: 0x3425
	/*+0x0*/   /*unpacked*/ struct TinyXZY start;
	/*+0x4*/   /*unpacked*/ struct TinyXZY end;
};

// Type: int32_t;

// Type: long;

// Type: /*unpacked*/ struct DXZY;
struct DXZY{ // not packed(0x10 bytes) TI: 0x3420
	/*+0x0*/   float x;
	/*+0x4*/   float z;
	/*+0x8*/   float y;
	/*+0xc*/   float info;
};

// Type: unsigned char;

// Type: void * __ptr32;

// Type: void;

// Type: /*unpacked*/ class cBBase;
// VTABLE: COPTER_D 0x00593688
class cBBase{ // not packed(0x28 bytes) TI: 0x339c
public:
	virtual unsigned long GetBodyType(); // vtable+0x0
	unsigned long GetName();
	unsigned long GetResType();
	virtual /*unpacked*/ class cBList<cBBase>* GetList(); // vtable+0x4
	unsigned long operator unsigned long();
	virtual unsigned short CanDestroy(); // vtable+0x8
	// calltype: NearC
	static /*unpacked*/ class cBBase* MakeNew(void * __ptr32);
	// calltype: NearC
	static void LoadAllRelatedArrays(/*unpacked*/ class ResFile*);
	virtual void InstallArrayPointers(unsigned short); // vtable+0xc
	void FinishMake(unsigned short);
	void Delete();
	virtual void ~cBBase(); // vtable+0x10
	virtual void Destroy(); // vtable+0x14
	virtual void Dirty(); // vtable+0x18
	virtual unsigned short IsDirty(); // vtable+0x1c
	virtual void WriteToDisk(); // vtable+0x20
	void cBBase();
	void Init(void * __ptr32);
	void Init(unsigned char *);
	void Init(unsigned long);
	/*+0x4*/   void * __ptr32 fDataHandle;
	/*+0x8*/   unsigned long fDataHandleSize;
	/*+0xc*/   unsigned char fName[16]; // 0x10 bytes
	/*+0x1c*/  unsigned long fTinyName;
	/*+0x20*/  short fResID; // 0x2 bytes
	/*+0x22*/  unsigned short fDataChanged; // 0x2 bytes
	struct cBBase::BBaseHeader{ // not packed(0x40 bytes) TI: 0x339f
		/*+0x0*/   unsigned long bodyType;
		/*+0x4*/   long _win8pad[15]; // 0x3c bytes
	};
public:
	/*+0x24*/  /*unpacked*/ struct cBBase::BBaseHeader *fHeader;
	// calltype: NearC
	static void SwizzleBBaseHeader(void * __ptr32, long);
};

// Type: /*unpacked*/ class PtrList<cCopterBody>;
class PtrList<cCopterBody>{ // not packed(0x8 bytes) TI: 0x3432
	class PtrList<cCopterBody>::Iter{ // not packed(0x8 bytes) TI: 0x343c
	private:
		/*+0x0*/   /*unpacked*/ class PtrList<cCopterBody> *fObject;
		/*+0x4*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *fCur;
	public:
		void Iter(/*unpacked*/ class PtrList<cCopterBody>*);
		/*unpacked*/ class cCopterBody* Current();
		void Next();
		void Reset();
		/*unpacked*/ class cCopterBody* First();
	};
	struct PtrList<cCopterBody>::PtrNode{ // not packed(0x8 bytes) TI: 0x3434
		/*+0x0*/   /*unpacked*/ class cCopterBody *data;
		/*+0x4*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *next;
	};
private:
	/*+0x0*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *fFirst;
	/*+0x4*/   short fCount; // 0x2 bytes
public:
	void PtrList<cCopterBody>();
	void ~PtrList<cCopterBody>();
	unsigned short Contains(/*unpacked*/ class cCopterBody*);
	void RemoveAll();
	void Remove(/*unpacked*/ class cCopterBody*);
	long Count();
	void Add(/*unpacked*/ class cCopterBody*);
	/*unpacked*/ class cCopterBody* GetByIndex(long);
	/*unpacked*/ class cCopterBody* GetByOrder(long);
};



// Contribution: 1:0015fbf0-001614f4 Module: 189, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00560bf0
class cCopterAnim * cCopterBody::GetPrivateAnim(unsigned long animName) {
	/*bp-0x4*/   short count;

// LINE 1943:
	count = 0x0;
	__asm        jmp    _T1b;
_T17:
	count++;
_T1b:
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+0x2C];
	__asm        movsx  ecx, count;
	__asm        cmp    [eax+0x10], ecx;
	__asm        jle    _T27a;
// Block start:
	/*bp-0x8*/   /*unpacked*/ struct AnimLookup *al;
	__asm        mov    eax, this;
