// Module: Bodydefs.obj
// Source: C:\Copter\Source\X\Objects\Bodydefs.cpp
// autogenerated by simcopter_tool from PDB file

// Type: short;

// Type: void * __ptr32;

// Type: long;

// Type: /*unpacked*/ struct PrivAnimPartInfo (forward reference);
struct PrivAnimPartInfo{ // not packed(0x8 bytes) TI: 0x3425
	/*+0x0*/   /*unpacked*/ struct TinyXZY start;
	/*+0x4*/   /*unpacked*/ struct TinyXZY end;
};

// Type: void;

// Type: /*unpacked*/ struct DXZY;
struct DXZY{ // not packed(0x10 bytes) TI: 0x3420
	/*+0x0*/   float x;
	/*+0x4*/   float z;
	/*+0x8*/   float y;
	/*+0xc*/   float info;
};

// Type: /*unpacked*/ struct TinyXZY;
struct TinyXZY{ // not packed(0x4 bytes) TI: 0x3422
	/*+0x0*/   signed char x; // 0x1 bytes
	/*+0x1*/   signed char y; // 0x1 bytes
	/*+0x2*/   signed char z; // 0x1 bytes
	/*+0x3*/   signed char info; // 0x1 bytes
};

// Type: /*unpacked*/ struct TinyXZY (forward reference);
struct TinyXZY{ // not packed(0x4 bytes) TI: 0x3422
	/*+0x0*/   signed char x; // 0x1 bytes
	/*+0x1*/   signed char y; // 0x1 bytes
	/*+0x2*/   signed char z; // 0x1 bytes
	/*+0x3*/   signed char info; // 0x1 bytes
};

// Type: /*unpacked*/ struct DXZY (forward reference);
struct DXZY{ // not packed(0x10 bytes) TI: 0x3420
	/*+0x0*/   float x;
	/*+0x4*/   float z;
	/*+0x8*/   float y;
	/*+0xc*/   float info;
};

// Type: signed char;

// Type: float;

// Type: /*unpacked*/ struct Point (forward reference);
struct Point{ // not packed(0x4 bytes) TI: 0x341c
	/*+0x0*/   short v; // 0x2 bytes
	/*+0x2*/   short h; // 0x2 bytes
};

// Type: char;

// Type: unsigned char;

// Type: /*unpacked*/ class FlatResFile (forward reference);
// VTABLE: COPTER_D 0x00593508
class FlatResFile : public FlatFile
{ // not packed(0x11c bytes) TI: 0x330e
protected:
	/*+0x110*/ /*unpacked*/ class ResMap *fMap;
	/*+0x114*/ long fError;
	/*+0x118*/ short _alignPad; // 0x2 bytes
public:
	void FlatResFile();
	virtual void ~FlatResFile() /* override */;
	void LoadResMap(void * __ptr32*, short *, long *);
	unsigned short FileEquals(/*unpacked*/ class FlatResFile*);
	virtual long Open(unsigned char *) /* override */;
	virtual long Open(char *) /* override */;
	long OpenFromName();
	virtual long Close() /* override */;
	short CountTypes();
	unsigned long GetIndType(short);
	short Count(unsigned long);
	void * __ptr32 GetByID(unsigned long, short, void (*)(void * __ptr32, long));
	void * __ptr32 GetByName(unsigned long, unsigned char *, void (*)(void * __ptr32, long));
	void * __ptr32 GetByIndex(unsigned long, short, void (*)(void * __ptr32, long));
	void GetName(void * __ptr32, unsigned char *);
	void GetID(void * __ptr32, short *);
	unsigned long GetResType(void * __ptr32);
	void Release(void * __ptr32);
	void Detach(void * __ptr32);
	void Load(void * __ptr32);
	long GetError();
	void Add(void * __ptr32, unsigned long, short, unsigned char *);
	void ExclusiveAdd(void * __ptr32, unsigned long, short, unsigned char *);
	void FindUniqueName(unsigned long, unsigned char *);
	short FindUniqueID(unsigned long);
	void Write(void * __ptr32);
	void Remove(void * __ptr32);
	void GetString(unsigned char *, short, short);
	// calltype: NearC
	static short CheckForLeaks();
};

// Type: /*unpacked*/ class cBBase (forward reference);
// VTABLE: COPTER_D 0x00593688
class cBBase{ // not packed(0x28 bytes) TI: 0x339c
public:
	virtual unsigned long GetBodyType(); // vtable+0x0
	unsigned long GetName();
	unsigned long GetResType();
	virtual /*unpacked*/ class cBList<cBBase>* GetList(); // vtable+0x4
	unsigned long operator unsigned long();
	virtual unsigned short CanDestroy(); // vtable+0x8
	// calltype: NearC
	static /*unpacked*/ class cBBase* MakeNew(void * __ptr32);
	// calltype: NearC
	static void LoadAllRelatedArrays(/*unpacked*/ class ResFile*);
	virtual void InstallArrayPointers(unsigned short); // vtable+0xc
	void FinishMake(unsigned short);
	void Delete();
	virtual void ~cBBase(); // vtable+0x10
	virtual void Destroy(); // vtable+0x14
	virtual void Dirty(); // vtable+0x18
	virtual unsigned short IsDirty(); // vtable+0x1c
	virtual void WriteToDisk(); // vtable+0x20
	void cBBase();
	void Init(void * __ptr32);
	void Init(unsigned char *);
	void Init(unsigned long);
	/*+0x4*/   void * __ptr32 fDataHandle;
	/*+0x8*/   unsigned long fDataHandleSize;
	/*+0xc*/   unsigned char fName[16]; // 0x10 bytes
	/*+0x1c*/  unsigned long fTinyName;
	/*+0x20*/  short fResID; // 0x2 bytes
	/*+0x22*/  unsigned short fDataChanged; // 0x2 bytes
	struct cBBase::BBaseHeader{ // not packed(0x40 bytes) TI: 0x339f
		/*+0x0*/   unsigned long bodyType;
		/*+0x4*/   long _win8pad[15]; // 0x3c bytes
	};
public:
	/*+0x24*/  /*unpacked*/ struct cBBase::BBaseHeader *fHeader;
	// calltype: NearC
	static void SwizzleBBaseHeader(void * __ptr32, long);
};

// Type: /*unpacked*/ struct PtrList<cBBase>::PtrNode (forward reference);
struct PtrList<cBBase>::PtrNode{ // not packed(0x8 bytes) TI: 0x33ae
	/*+0x0*/   /*unpacked*/ class cBBase *data;
	/*+0x4*/   /*unpacked*/ struct PtrList<cBBase>::PtrNode *next;
};

// Type: /*unpacked*/ class PtrList<cBBase> (forward reference);
class PtrList<cBBase>{ // not packed(0x8 bytes) TI: 0x33ac
	class PtrList<cBBase>::Iter{ // not packed(0x8 bytes) TI: 0x33b6
	private:
		/*+0x0*/   /*unpacked*/ class PtrList<cBBase> *fObject;
		/*+0x4*/   /*unpacked*/ struct PtrList<cBBase>::PtrNode *fCur;
	public:
		void Iter(/*unpacked*/ class PtrList<cBBase>*);
		/*unpacked*/ class cBBase* Current();
		void Next();
		void Reset();
		/*unpacked*/ class cBBase* First();
	};
	struct PtrList<cBBase>::PtrNode{ // not packed(0x8 bytes) TI: 0x33ae
		/*+0x0*/   /*unpacked*/ class cBBase *data;
		/*+0x4*/   /*unpacked*/ struct PtrList<cBBase>::PtrNode *next;
	};
private:
	/*+0x0*/   /*unpacked*/ struct PtrList<cBBase>::PtrNode *fFirst;
	/*+0x4*/   short fCount; // 0x2 bytes
public:
	void PtrList<cBBase>();
	void ~PtrList<cBBase>();
	unsigned short Contains(/*unpacked*/ class cBBase*);
	void RemoveAll();
	void Remove(/*unpacked*/ class cBBase*);
	long Count();
	void Add(/*unpacked*/ class cBBase*);
	/*unpacked*/ class cBBase* GetByIndex(long);
	/*unpacked*/ class cBBase* GetByOrder(long);
};

// Type: /*unpacked*/ class PtrList<cCopterAnim>::Iter (forward reference);
class PtrList<cCopterAnim>::Iter{ // not packed(0x8 bytes) TI: 0x341b
private:
	/*+0x0*/   /*unpacked*/ class PtrList<cCopterAnim> *fObject;
	/*+0x4*/   /*unpacked*/ struct PtrList<cCopterAnim>::PtrNode *fCur;
public:
	void Iter(/*unpacked*/ class PtrList<cCopterAnim>*);
	/*unpacked*/ class cCopterAnim* Current();
	void Next();
	void Reset();
	/*unpacked*/ class cCopterAnim* First();
};

// Type: /*unpacked*/ class PtrList<cCopterAnim> (forward reference);
class PtrList<cCopterAnim>{ // not packed(0x8 bytes) TI: 0x3411
	class PtrList<cCopterAnim>::Iter{ // not packed(0x8 bytes) TI: 0x341b
	private:
		/*+0x0*/   /*unpacked*/ class PtrList<cCopterAnim> *fObject;
		/*+0x4*/   /*unpacked*/ struct PtrList<cCopterAnim>::PtrNode *fCur;
	public:
		void Iter(/*unpacked*/ class PtrList<cCopterAnim>*);
		/*unpacked*/ class cCopterAnim* Current();
		void Next();
		void Reset();
		/*unpacked*/ class cCopterAnim* First();
	};
	struct PtrList<cCopterAnim>::PtrNode{ // not packed(0x8 bytes) TI: 0x3413
		/*+0x0*/   /*unpacked*/ class cCopterAnim *data;
		/*+0x4*/   /*unpacked*/ struct PtrList<cCopterAnim>::PtrNode *next;
	};
private:
	/*+0x0*/   /*unpacked*/ struct PtrList<cCopterAnim>::PtrNode *fFirst;
	/*+0x4*/   short fCount; // 0x2 bytes
public:
	void PtrList<cCopterAnim>();
	void ~PtrList<cCopterAnim>();
	unsigned short Contains(/*unpacked*/ class cCopterAnim*);
	void RemoveAll();
	void Remove(/*unpacked*/ class cCopterAnim*);
	long Count();
	void Add(/*unpacked*/ class cCopterAnim*);
	/*unpacked*/ class cCopterAnim* GetByIndex(long);
	/*unpacked*/ class cCopterAnim* GetByOrder(long);
};

// Type: /*unpacked*/ class cCopterAnim (forward reference);
// VTABLE: COPTER_D 0x00593658
class cCopterAnim : public cBBase
{ // not packed(0x2c bytes) TI: 0x3404
public:
	void cCopterAnim();
	virtual void ~cCopterAnim() /* override */;
	virtual void Destroy() /* override */;
	virtual void WriteToDisk() /* override */;
	virtual unsigned short IsDirty() /* override */;
	virtual unsigned long GetBodyType() /* override */;
	virtual void InstallArrayPointers(unsigned short) /* override */;
	static /*unpacked*/ class cBList<cCopterAnim> *fsList;
	virtual /*unpacked*/ class cBList<cBBase>* GetList() /* override */;
	virtual /*unpacked*/ struct PrivAnimPartInfo* GetPartInfo(short, short); // vtable+0x24
	virtual /*unpacked*/ struct PrivAnimPartInfo* GetPartInfoBasePtr(short); // vtable+0x28
	/*+0x28*/  /*unpacked*/ class cArray<PrivAnimPartInfo> *fPrivPartInfo;
	short GetNumParts();
	short GetNumFrames();
	// calltype: NearC
	static /*unpacked*/ class cBBase* MakeNew(void * __ptr32);
	// calltype: NearC
	static /*unpacked*/ class cCopterAnim* MakeNew(unsigned long, /*unpacked*/ class cCopterBody*);
	// calltype: NearC
	static void LoadAllRelatedArrays(/*unpacked*/ class ResFile*);
	// calltype: NearC
	static void DestroyAll();
};

// Type: unsigned short;

// Type: unsigned long;

// Type: /*unpacked*/ class cBList<cBBase> (forward reference);
// cBList<cBBase> Class implementation not found

// Type: uint32_t;

// Type: /*unpacked*/ class cCopterBody (forward reference);
// cCopterBody Class implementation not found

// Type: /*unpacked*/ class PtrList<cCopterBody> (forward reference);
class PtrList<cCopterBody>{ // not packed(0x8 bytes) TI: 0x3432
	class PtrList<cCopterBody>::Iter{ // not packed(0x8 bytes) TI: 0x343c
	private:
		/*+0x0*/   /*unpacked*/ class PtrList<cCopterBody> *fObject;
		/*+0x4*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *fCur;
	public:
		void Iter(/*unpacked*/ class PtrList<cCopterBody>*);
		/*unpacked*/ class cCopterBody* Current();
		void Next();
		void Reset();
		/*unpacked*/ class cCopterBody* First();
	};
	struct PtrList<cCopterBody>::PtrNode{ // not packed(0x8 bytes) TI: 0x3434
		/*+0x0*/   /*unpacked*/ class cCopterBody *data;
		/*+0x4*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *next;
	};
private:
	/*+0x0*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *fFirst;
	/*+0x4*/   short fCount; // 0x2 bytes
public:
	void PtrList<cCopterBody>();
	void ~PtrList<cCopterBody>();
	unsigned short Contains(/*unpacked*/ class cCopterBody*);
	void RemoveAll();
	void Remove(/*unpacked*/ class cCopterBody*);
	long Count();
	void Add(/*unpacked*/ class cCopterBody*);
	/*unpacked*/ class cCopterBody* GetByIndex(long);
	/*unpacked*/ class cCopterBody* GetByOrder(long);
};

// Type: /*unpacked*/ class PtrList<cCopterBody>::Iter (forward reference);
class PtrList<cCopterBody>::Iter{ // not packed(0x8 bytes) TI: 0x343c
private:
	/*+0x0*/   /*unpacked*/ class PtrList<cCopterBody> *fObject;
	/*+0x4*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *fCur;
public:
	void Iter(/*unpacked*/ class PtrList<cCopterBody>*);
	/*unpacked*/ class cCopterBody* Current();
	void Next();
	void Reset();
	/*unpacked*/ class cCopterBody* First();
};

// Type: /*unpacked*/ class cBList<cCopterBody> (forward reference);
class cBList<cCopterBody> : public PtrList<cCopterBody>
{ // not packed(0x14 bytes) TI: 0x33ed
public:
	long GetIndex(unsigned long);
	long GetIndex(/*unpacked*/ class cCopterBody*);
	void cBList<cCopterBody>();
	void ~cBList<cCopterBody>();
	void Delete();
	void DeletePointers();
	void DeletePointersAndSelf();
	long CountByBodyType(unsigned long);
	/*unpacked*/ class cCopterBody* GetByBodyType(unsigned long, long);
	long GetIndexInBodyType(/*unpacked*/ class cCopterBody*);
	/*unpacked*/ class cCopterBody* GetByName(unsigned long, long);
	virtual void Add(/*unpacked*/ class cCopterBody*); // vtable+0x0
	void WriteToDisk();
	void WriteToDiskIfDirty();
	/*+0xc*/   /*unpacked*/ class ResFile *fFile;
	/*+0x10*/  unsigned long fType;
	void CompactFile();
	// calltype: NearC
	static /*unpacked*/ class cBList<cCopterBody>* MakeNew(unsigned char *, unsigned long);
	void LoadAll();
};

// Type: /*unpacked*/ class cBBase;
// VTABLE: COPTER_D 0x00593688
class cBBase{ // not packed(0x28 bytes) TI: 0x339c
public:
	virtual unsigned long GetBodyType(); // vtable+0x0
	unsigned long GetName();
	unsigned long GetResType();
	virtual /*unpacked*/ class cBList<cBBase>* GetList(); // vtable+0x4
	unsigned long operator unsigned long();
	virtual unsigned short CanDestroy(); // vtable+0x8
	// calltype: NearC
	static /*unpacked*/ class cBBase* MakeNew(void * __ptr32);
	// calltype: NearC
	static void LoadAllRelatedArrays(/*unpacked*/ class ResFile*);
	virtual void InstallArrayPointers(unsigned short); // vtable+0xc
	void FinishMake(unsigned short);
	void Delete();
	virtual void ~cBBase(); // vtable+0x10
	virtual void Destroy(); // vtable+0x14
	virtual void Dirty(); // vtable+0x18
	virtual unsigned short IsDirty(); // vtable+0x1c
	virtual void WriteToDisk(); // vtable+0x20
	void cBBase();
	void Init(void * __ptr32);
	void Init(unsigned char *);
	void Init(unsigned long);
	/*+0x4*/   void * __ptr32 fDataHandle;
	/*+0x8*/   unsigned long fDataHandleSize;
	/*+0xc*/   unsigned char fName[16]; // 0x10 bytes
	/*+0x1c*/  unsigned long fTinyName;
	/*+0x20*/  short fResID; // 0x2 bytes
	/*+0x22*/  unsigned short fDataChanged; // 0x2 bytes
	struct cBBase::BBaseHeader{ // not packed(0x40 bytes) TI: 0x339f
		/*+0x0*/   unsigned long bodyType;
		/*+0x4*/   long _win8pad[15]; // 0x3c bytes
	};
public:
	/*+0x24*/  /*unpacked*/ struct cBBase::BBaseHeader *fHeader;
	// calltype: NearC
	static void SwizzleBBaseHeader(void * __ptr32, long);
};

// Type: /*unpacked*/ class PtrList<cCopterBody>;
class PtrList<cCopterBody>{ // not packed(0x8 bytes) TI: 0x3432
	class PtrList<cCopterBody>::Iter{ // not packed(0x8 bytes) TI: 0x343c
	private:
		/*+0x0*/   /*unpacked*/ class PtrList<cCopterBody> *fObject;
		/*+0x4*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *fCur;
	public:
		void Iter(/*unpacked*/ class PtrList<cCopterBody>*);
		/*unpacked*/ class cCopterBody* Current();
		void Next();
		void Reset();
		/*unpacked*/ class cCopterBody* First();
	};
	struct PtrList<cCopterBody>::PtrNode{ // not packed(0x8 bytes) TI: 0x3434
		/*+0x0*/   /*unpacked*/ class cCopterBody *data;
		/*+0x4*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *next;
	};
private:
	/*+0x0*/   /*unpacked*/ struct PtrList<cCopterBody>::PtrNode *fFirst;
	/*+0x4*/   short fCount; // 0x2 bytes
public:
	void PtrList<cCopterBody>();
	void ~PtrList<cCopterBody>();
	unsigned short Contains(/*unpacked*/ class cCopterBody*);
	void RemoveAll();
	void Remove(/*unpacked*/ class cCopterBody*);
	long Count();
	void Add(/*unpacked*/ class cCopterBody*);
	/*unpacked*/ class cCopterBody* GetByIndex(long);
	/*unpacked*/ class cCopterBody* GetByOrder(long);
};

// Type: /*unpacked*/ class FlatFile;
// VTABLE: COPTER_D 0x00593620
class FlatFile{ // not packed(0x110 bytes) TI: 0x32f4
	enum /* __unnamed */ {
		kMaxNameLen = 255,
	};
protected:
	/*+0x4*/   /*unpacked*/ class FlatFile *fNext;
	/*+0x8*/   unsigned char fName[256]; // 0x100 bytes
	/*+0x108*/ long fFileID;
	/*+0x10c*/ /*unpacked*/ struct _iobuf *fFile;
	long UniqueID();
private:
	static /*unpacked*/ class FlatFile *sList;
	static long sLastFileID;
	void Link();
	void Unlink();
	unsigned short Exclusive();
public:
	void FlatFile();
	virtual void ~FlatFile(); // vtable+0x0
	// calltype: NearC
	static /*unpacked*/ class FlatFile* FindByName(unsigned char *);
	unsigned short SameFile(/*unpacked*/ class FlatFile*);
	virtual long Open(unsigned char *); // vtable+0x4
	virtual long Open(char *); // vtable+0x8
	virtual long Close(); // vtable+0xc
	void OpenFromOtherFile(/*unpacked*/ class FlatFile*);
	long GetFileName(unsigned char *);
	unsigned short ValidFile();
	long ReadBlock(void * __ptr32, long *);
	long Read4(long *);
	long Read2(short *);
	long Read1(signed char *);
	long SetPos(long);
	long Advance(long);
	// calltype: NearC
	static short CheckForLeaks();
	long GetFileID();
	/*unpacked*/ struct _iobuf* GetFile();
};



