// Module: Flatresf.obj
// Source: C:\Copter\Source\X\File\Flatresf.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*unpacked*/ class ResMap (forward reference);
// ResMap Class implementation not found

// Type: /*unpacked*/ class FlatResFile (forward reference);
// VTABLE: COPTER_D 0x00593508
class FlatResFile : public FlatFile
{ // not packed(0x11c bytes) TI: 0x330e
protected:
	/*+0x110*/ /*unpacked*/ class ResMap *fMap;
	/*+0x114*/ long fError;
	/*+0x118*/ short _alignPad; // 0x2 bytes
public:
	void FlatResFile();
	virtual void ~FlatResFile() /* override */;
	void LoadResMap(void * __ptr32*, short *, long *);
	unsigned short FileEquals(/*unpacked*/ class FlatResFile*);
	virtual long Open(unsigned char *) /* override */;
	virtual long Open(char *) /* override */;
	long OpenFromName();
	virtual long Close() /* override */;
	short CountTypes();
	unsigned long GetIndType(short);
	short Count(unsigned long);
	void * __ptr32 GetByID(unsigned long, short, void (*)(void * __ptr32, long));
	void * __ptr32 GetByName(unsigned long, unsigned char *, void (*)(void * __ptr32, long));
	void * __ptr32 GetByIndex(unsigned long, short, void (*)(void * __ptr32, long));
	void GetName(void * __ptr32, unsigned char *);
	void GetID(void * __ptr32, short *);
	unsigned long GetResType(void * __ptr32);
	void Release(void * __ptr32);
	void Detach(void * __ptr32);
	void Load(void * __ptr32);
	long GetError();
	void Add(void * __ptr32, unsigned long, short, unsigned char *);
	void ExclusiveAdd(void * __ptr32, unsigned long, short, unsigned char *);
	void FindUniqueName(unsigned long, unsigned char *);
	short FindUniqueID(unsigned long);
	void Write(void * __ptr32);
	void Remove(void * __ptr32);
	void GetString(unsigned char *, short, short);
	// calltype: NearC
	static short CheckForLeaks();
};

// Type: void * __ptr32;

// Type: short *;

// Type: long *;

// Type: unsigned char *;

// Type: long;

// Type: void;

// Type: unsigned char;

// Type: char *;

// Type: /*unpacked*/ class ResFile (forward reference);
// VTABLE: COPTER_D 0x00593518
class ResFile : public FlatResFile
{ // not packed(0x11c bytes) TI: 0x3334
public:
	long OpenFromOtherFile(/*unpacked*/ class ResFile*);
};

// Type: short;

// Type: unsigned long;

// Type: void (void * __ptr32, long);

// Type: /*unpacked*/ struct ResMap::Entry (forward reference);
struct ResMap::Entry{ // not packed(0xc bytes) TI: 0x3dee
	/*+0x0*/   short id; // 0x2 bytes
	/*+0x2*/   short nameOffset; // 0x2 bytes
	/*+0x4*/   LfBitfield @ 0x7104c:
	[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
	[90m   LB.[95mTI[m = 0x3deb
	[90m   LB.[32m[  1.  1][m [95mposition[m = 0x0
	[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
	 flags; // 0x8 bytes
	/*+0x4*/   LfBitfield @ 0x71054:
	[90m   LB.[32m[  0.  1][m [95mlength[m = 0x18
	[90m   LB.[95mTI[m = 0x3dec
	[90m   LB.[32m[  1.  1][m [95mposition[m = 0x8
	[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
	 dataLoc; // 0x18 bytes
	/*+0x8*/   void * __ptr32 hand;
};

// Type: /*unpacked*/ class StringSet;
class StringSet{ // not packed(0x10 bytes) TI: 0x3487
private:
	/*+0x0*/   /*unpacked*/ class ResFile *fResFile;
	/*+0x4*/   long fNumStrings;
	/*+0x8*/   void * __ptr32 fStringHandle;
	/*+0xc*/   unsigned char * fStringPtr;
	void LoadStrings(short);
	// calltype: NearC
	static void Swizzle(void * __ptr32, long);
public:
	void StringSet(/*unpacked*/ class ResFile*, short);
	void StringSet(/*unpacked*/ class ResFile*, short, short);
	void ~StringSet();
	unsigned char * GetString(short);
	short Count();
};

// Type: /*unpacked*/ struct ResMap::TypeHead (forward reference);
struct ResMap::TypeHead{ // not packed(0x8 bytes) TI: 0x3df0
	/*+0x0*/   unsigned long type;
	/*+0x4*/   short resCnt; // 0x2 bytes
	/*+0x6*/   short listOff; // 0x2 bytes
};

// Type: unsigned short;

// Type: /*unpacked*/ class FlatResFile;
// VTABLE: COPTER_D 0x00593508
class FlatResFile : public FlatFile
{ // not packed(0x11c bytes) TI: 0x330e
protected:
	/*+0x110*/ /*unpacked*/ class ResMap *fMap;
	/*+0x114*/ long fError;
	/*+0x118*/ short _alignPad; // 0x2 bytes
public:
	void FlatResFile();
	virtual void ~FlatResFile() /* override */;
	void LoadResMap(void * __ptr32*, short *, long *);
	unsigned short FileEquals(/*unpacked*/ class FlatResFile*);
	virtual long Open(unsigned char *) /* override */;
	virtual long Open(char *) /* override */;
	long OpenFromName();
	virtual long Close() /* override */;
	short CountTypes();
	unsigned long GetIndType(short);
	short Count(unsigned long);
	void * __ptr32 GetByID(unsigned long, short, void (*)(void * __ptr32, long));
	void * __ptr32 GetByName(unsigned long, unsigned char *, void (*)(void * __ptr32, long));
	void * __ptr32 GetByIndex(unsigned long, short, void (*)(void * __ptr32, long));
	void GetName(void * __ptr32, unsigned char *);
	void GetID(void * __ptr32, short *);
	unsigned long GetResType(void * __ptr32);
	void Release(void * __ptr32);
	void Detach(void * __ptr32);
	void Load(void * __ptr32);
	long GetError();
	void Add(void * __ptr32, unsigned long, short, unsigned char *);
	void ExclusiveAdd(void * __ptr32, unsigned long, short, unsigned char *);
	void FindUniqueName(unsigned long, unsigned char *);
	short FindUniqueID(unsigned long);
	void Write(void * __ptr32);
	void Remove(void * __ptr32);
	void GetString(unsigned char *, short, short);
	// calltype: NearC
	static short CheckForLeaks();
};

// Type: /*unpacked*/ class FlatFile;
// VTABLE: COPTER_D 0x00593620
class FlatFile{ // not packed(0x110 bytes) TI: 0x32f4
	enum /* __unnamed */ {
		kMaxNameLen = 255,
	};
protected:
	/*+0x4*/   /*unpacked*/ class FlatFile *fNext;
	/*+0x8*/   unsigned char fName[256]; // 0x100 bytes
	/*+0x108*/ long fFileID;
	/*+0x10c*/ /*unpacked*/ struct _iobuf *fFile;
	long UniqueID();
private:
	static /*unpacked*/ class FlatFile *sList;
	static long sLastFileID;
	void Link();
	void Unlink();
	unsigned short Exclusive();
public:
	void FlatFile();
	virtual void ~FlatFile(); // vtable+0x0
	// calltype: NearC
	static /*unpacked*/ class FlatFile* FindByName(unsigned char *);
	unsigned short SameFile(/*unpacked*/ class FlatFile*);
	virtual long Open(unsigned char *); // vtable+0x4
	virtual long Open(char *); // vtable+0x8
	virtual long Close(); // vtable+0xc
	void OpenFromOtherFile(/*unpacked*/ class FlatFile*);
	long GetFileName(unsigned char *);
	unsigned short ValidFile();
	long ReadBlock(void * __ptr32, long *);
	long Read4(long *);
	long Read2(short *);
	long Read1(signed char *);
	long SetPos(long);
	long Advance(long);
	// calltype: NearC
	static short CheckForLeaks();
	long GetFileID();
	/*unpacked*/ struct _iobuf* GetFile();
};



