// Module: S3boat.obj
// Source: C:\Copter\Source\Game\S3boat.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class BoatClass (forward reference);
// VTABLE: COPTER_D 0x00593200
class BoatClass{ // packed(0xe3 bytes) TI: 0x42b3
	enum /* __unnamed */ {
		BOAT_TYPES = 1,
		PERCENTAGE_OF_BOAT1 = 100,
		TOTAL_PERCENTAGE = 100,
	};
	enum /* __unnamed */ {
		NO_X_POSITION = -1,
		STARTING_X = 3,
		ENDING_X = 125,
		NO_Y_POSITION = -1,
		STARTING_Y = 3,
		ENDING_Y = 125,
	};
	enum IntersectionTypes {
		DEAD_END = 0,
		STRAIGHT_AHEAD = 1,
		LEFT_ONLY = 2,
		RIGHT_ONLY = 4,
		LEFT_OR_STRAIGHT = 3,
		LEFT_OR_RIGHT = 6,
		RIGHT_OR_STRAIGHT = 5,
		LEFT_STRAIGHT_OR_RIGHT = 7,
	};
	enum StoppedReasons {
		NO_REASON = 0,
		TRAFFIC = 1,
		STOPPED_TRAFFIC = 2,
		PERSON_IN_WAY = 3,
		END_OF_WATER = 4,
		INTERSECTION_FULL = 5,
	};
	enum WaterTileOffsets {
		WT_CENTOFF = 0,
		WT_EDGEOFF = 0,
	};
	enum /* __unnamed */ {
		COLLISION_SPACE = 655360,
		SPRAY_TIME = 58982,
		WATER_SPEED = 917504,
		WATER_SLOWDOWN_FACTOR = 131072,
		SPEED_VARIANCE = 262144,
		MAX_TIME_TO_WAIT_FOR_TRAFFIC = 1310720,
		MAX_TIME_TO_WAIT_PULLED_OVER = 196608,
		MAX_TIME_TO_WAIT_BEFORE_BEAMING = 655360,
	};
	enum flagEnums {
		INITIALIZED = 0,
		PLACED = 1,
		TURNING = 2,
		IN_INTERSECTION = 3,
		MAKING_UTURN = 4,
		AT_DEAD_END = 5,
		PERSON_ON_BOARD = 6,
		NUMBER_OF_FLAGS = 7,
	};
private:
	static /*packed*/ struct Point2d lastScannedLocation;
	/*+0x4*/   char flags[7]; // 0x7 bytes
	/*+0xb*/   int32_t sprayTimer;
	/*+0xf*/   enum DirectionTypes direction;
	/*+0x13*/  /*packed*/ struct Point3d directionVector; // 0xc bytes
	/*+0x1f*/  int32_t remainingDist;
	/*+0x23*/  int32_t remainingTime;
	/*+0x27*/  enum DirectionTypes utdirection;
	/*+0x2b*/  int32_t speed;
	/*+0x2f*/  int32_t desiredSpeed;
	/*+0x33*/  /*packed*/ struct Point2d currentLocation; // 0x8 bytes
	/*+0x3b*/  /*packed*/ struct Point2d currentCell; // 0x8 bytes
	/*+0x43*/  /*packed*/ struct Point2d nextLocation; // 0x8 bytes
	/*+0x4b*/  int32_t beamDelay;
	/*+0x4f*/  int32_t beamTimer;
	/*+0x53*/  long missionId;
	/*+0x57*/  int32_t timeToLive;
	/*+0x5b*/  /*packed*/ struct Point2d northCell; // 0x8 bytes
	/*+0x63*/  /*packed*/ struct Point2d southCell; // 0x8 bytes
	/*+0x6b*/  /*packed*/ struct Point2d eastCell; // 0x8 bytes
	/*+0x73*/  /*packed*/ struct Point2d westCell; // 0x8 bytes
protected:
	/*+0x7b*/  long boatModel;
	/*+0x7f*/  /*packed*/ struct _DYOBJ_INST dyObj; // 0x64 bytes
public:
	void BoatClass(const /*packed*/ class BoatClass&);
	void BoatClass(long, long, int32_t);
	void BoatClass();
	virtual void ~BoatClass(); // vtable+0x0
	// calltype: NearC
	static /*packed*/ class BoatClass* CreateInstance(long, long, int32_t);
	// calltype: NearC
	static /*packed*/ class BoatClass* CreateInstance(int32_t);
	// calltype: NearC
	static /*packed*/ class BoatClass* GetBoatPointer(long);
	static /*packed*/ class BoatClass lsBoat;
	// calltype: NearC
	static void ItterateAll();
	// calltype: NearC
	static void ResetAll();
	// calltype: NearC
	static /*packed*/ struct _DYOBJ_INST* StartCapsizedBoat(long, int32_t);
	// calltype: NearC
	static /*packed*/ struct _DYOBJ_INST* GetCapsizedBoat();
	// calltype: NearC
	static int32_t MIFFLoad(void * __ptr32);
	// calltype: NearC
	static int32_t MIFFSave(void * __ptr32);
protected:
	int32_t IsBoatInitialized();
	int32_t IsBoatPlaced();
	int32_t IsBoatAtDeadEnd();
	int32_t IsPersonOnBoard();
	int32_t IsBoatTurning();
	int32_t IsBoatInIntersection();
	int32_t IsBoatMakingUturn();
	int32_t IsBoatMoving();
	long GetBoatModel();
	const const /*packed*/ struct _DYOBJ_INST* GetBoatDyObj();
	enum DirectionTypes GetDirection();
	int32_t AmIMovingNorth();
	int32_t AmIMovingSouth();
	int32_t AmIMovingEast();
	int32_t AmIMovingWest();
	const /*packed*/ struct Point3d& GetDirectionVector();
	int32_t GetSpeed();
	int32_t GetDesiredSpeed();
	const /*packed*/ struct Point2d& GetCurrentLocation();
	const /*packed*/ struct Point2d& GetNextLocation();
	void SetCurrentLocation(/*packed*/ struct Point2d&);
	int32_t CanBoatBePlacedOnTile(unsigned short);
	void SetSpeed(int32_t);
	int32_t Initialize(int32_t);
	void Reset();
	void Itterate();
	virtual void ItterateFSM(); // vtable+0x4
	virtual void AdjustSpeed(); // vtable+0x8
	virtual enum BoatClass::StoppedReasons IsWaterPathClear(); // vtable+0xc
	enum BoatClass::StoppedReasons CheckWaterDynamicObjectsAt(const /*packed*/ struct Point2d&, const /*packed*/ struct Point3d&);
	int32_t IsBoatOutOfCameraRange();
	void SetBoatDirection(unsigned short);
	int32_t CheckForStop(short, short);
	int32_t FinishedUturn();
	void SlowDown();
	void Stop();
	void MoveForward();
	int32_t HaveIReachedNextLoc();
	int32_t AmIInANewCell();
	int32_t IsAnythingThere(const /*packed*/ struct Point2d&, /*packed*/ struct mv);
	void UnlinkFromCell(const /*packed*/ struct Point2d&);
	void LinkToCell(const /*packed*/ struct Point2d&);
	int32_t IsLocationAnIntersection(/*packed*/ struct Point2d&);
	virtual enum BoatClass::IntersectionTypes PickTurnDirection(const /*packed*/ struct Point2d&); // vtable+0x10
	int32_t DoWaterTilesConnect(unsigned short, unsigned short, enum DirectionTypes);
	void MakeATurn(enum BoatClass::IntersectionTypes);
	void GetNewPredictedLocation();
	void AdjustCurrentPosition();
	void AdjustNextPosition();
	enum BoatClass::StoppedReasons WhyAmIStopped();
	void GoStraight();
	void MakeUturn();
	void TurnLeft();
	void TurnRight();
	void UnPlaceBoat();
	// calltype: NearC
	static void InitArrays();
	// calltype: NearC
	static void SetBoatTypesAndLocations();
	// calltype: NearC
	static void PlaceInitialBoats();
	virtual void BeamBoatToWithinCameraRange(); // vtable+0x14
	virtual int32_t BeamBoatToLocation(long, long); // vtable+0x18
private:
	int32_t InitializeInstance(long, long, int32_t);
public:
	/*packed*/ class BoatClass operator=(const /*packed*/ class BoatClass&);
};

// Type: void ();

// Type: /*packed*/ struct Point2d;
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ class BoatClass;
// VTABLE: COPTER_D 0x00593200
class BoatClass{ // packed(0xe3 bytes) TI: 0x42b3
	enum /* __unnamed */ {
		BOAT_TYPES = 1,
		PERCENTAGE_OF_BOAT1 = 100,
		TOTAL_PERCENTAGE = 100,
	};
	enum /* __unnamed */ {
		NO_X_POSITION = -1,
		STARTING_X = 3,
		ENDING_X = 125,
		NO_Y_POSITION = -1,
		STARTING_Y = 3,
		ENDING_Y = 125,
	};
	enum IntersectionTypes {
		DEAD_END = 0,
		STRAIGHT_AHEAD = 1,
		LEFT_ONLY = 2,
		RIGHT_ONLY = 4,
		LEFT_OR_STRAIGHT = 3,
		LEFT_OR_RIGHT = 6,
		RIGHT_OR_STRAIGHT = 5,
		LEFT_STRAIGHT_OR_RIGHT = 7,
	};
	enum StoppedReasons {
		NO_REASON = 0,
		TRAFFIC = 1,
		STOPPED_TRAFFIC = 2,
		PERSON_IN_WAY = 3,
		END_OF_WATER = 4,
		INTERSECTION_FULL = 5,
	};
	enum WaterTileOffsets {
		WT_CENTOFF = 0,
		WT_EDGEOFF = 0,
	};
	enum /* __unnamed */ {
		COLLISION_SPACE = 655360,
		SPRAY_TIME = 58982,
		WATER_SPEED = 917504,
		WATER_SLOWDOWN_FACTOR = 131072,
		SPEED_VARIANCE = 262144,
		MAX_TIME_TO_WAIT_FOR_TRAFFIC = 1310720,
		MAX_TIME_TO_WAIT_PULLED_OVER = 196608,
		MAX_TIME_TO_WAIT_BEFORE_BEAMING = 655360,
	};
	enum flagEnums {
		INITIALIZED = 0,
		PLACED = 1,
		TURNING = 2,
		IN_INTERSECTION = 3,
		MAKING_UTURN = 4,
		AT_DEAD_END = 5,
		PERSON_ON_BOARD = 6,
		NUMBER_OF_FLAGS = 7,
	};
private:
	static /*packed*/ struct Point2d lastScannedLocation;
	/*+0x4*/   char flags[7]; // 0x7 bytes
	/*+0xb*/   int32_t sprayTimer;
	/*+0xf*/   enum DirectionTypes direction;
	/*+0x13*/  /*packed*/ struct Point3d directionVector; // 0xc bytes
	/*+0x1f*/  int32_t remainingDist;
	/*+0x23*/  int32_t remainingTime;
	/*+0x27*/  enum DirectionTypes utdirection;
	/*+0x2b*/  int32_t speed;
	/*+0x2f*/  int32_t desiredSpeed;
	/*+0x33*/  /*packed*/ struct Point2d currentLocation; // 0x8 bytes
	/*+0x3b*/  /*packed*/ struct Point2d currentCell; // 0x8 bytes
	/*+0x43*/  /*packed*/ struct Point2d nextLocation; // 0x8 bytes
	/*+0x4b*/  int32_t beamDelay;
	/*+0x4f*/  int32_t beamTimer;
	/*+0x53*/  long missionId;
	/*+0x57*/  int32_t timeToLive;
	/*+0x5b*/  /*packed*/ struct Point2d northCell; // 0x8 bytes
	/*+0x63*/  /*packed*/ struct Point2d southCell; // 0x8 bytes
	/*+0x6b*/  /*packed*/ struct Point2d eastCell; // 0x8 bytes
	/*+0x73*/  /*packed*/ struct Point2d westCell; // 0x8 bytes
protected:
	/*+0x7b*/  long boatModel;
	/*+0x7f*/  /*packed*/ struct _DYOBJ_INST dyObj; // 0x64 bytes
public:
	void BoatClass(const /*packed*/ class BoatClass&);
	void BoatClass(long, long, int32_t);
	void BoatClass();
	virtual void ~BoatClass(); // vtable+0x0
	// calltype: NearC
	static /*packed*/ class BoatClass* CreateInstance(long, long, int32_t);
	// calltype: NearC
	static /*packed*/ class BoatClass* CreateInstance(int32_t);
	// calltype: NearC
	static /*packed*/ class BoatClass* GetBoatPointer(long);
	static /*packed*/ class BoatClass lsBoat;
	// calltype: NearC
	static void ItterateAll();
	// calltype: NearC
	static void ResetAll();
	// calltype: NearC
	static /*packed*/ struct _DYOBJ_INST* StartCapsizedBoat(long, int32_t);
	// calltype: NearC
	static /*packed*/ struct _DYOBJ_INST* GetCapsizedBoat();
	// calltype: NearC
	static int32_t MIFFLoad(void * __ptr32);
	// calltype: NearC
	static int32_t MIFFSave(void * __ptr32);
protected:
	int32_t IsBoatInitialized();
	int32_t IsBoatPlaced();
	int32_t IsBoatAtDeadEnd();
	int32_t IsPersonOnBoard();
	int32_t IsBoatTurning();
	int32_t IsBoatInIntersection();
	int32_t IsBoatMakingUturn();
	int32_t IsBoatMoving();
	long GetBoatModel();
	const const /*packed*/ struct _DYOBJ_INST* GetBoatDyObj();
	enum DirectionTypes GetDirection();
	int32_t AmIMovingNorth();
	int32_t AmIMovingSouth();
	int32_t AmIMovingEast();
	int32_t AmIMovingWest();
	const /*packed*/ struct Point3d& GetDirectionVector();
	int32_t GetSpeed();
	int32_t GetDesiredSpeed();
	const /*packed*/ struct Point2d& GetCurrentLocation();
	const /*packed*/ struct Point2d& GetNextLocation();
	void SetCurrentLocation(/*packed*/ struct Point2d&);
	int32_t CanBoatBePlacedOnTile(unsigned short);
	void SetSpeed(int32_t);
	int32_t Initialize(int32_t);
	void Reset();
	void Itterate();
	virtual void ItterateFSM(); // vtable+0x4
	virtual void AdjustSpeed(); // vtable+0x8
	virtual enum BoatClass::StoppedReasons IsWaterPathClear(); // vtable+0xc
	enum BoatClass::StoppedReasons CheckWaterDynamicObjectsAt(const /*packed*/ struct Point2d&, const /*packed*/ struct Point3d&);
	int32_t IsBoatOutOfCameraRange();
	void SetBoatDirection(unsigned short);
	int32_t CheckForStop(short, short);
	int32_t FinishedUturn();
	void SlowDown();
	void Stop();
	void MoveForward();
	int32_t HaveIReachedNextLoc();
	int32_t AmIInANewCell();
	int32_t IsAnythingThere(const /*packed*/ struct Point2d&, /*packed*/ struct mv);
	void UnlinkFromCell(const /*packed*/ struct Point2d&);
	void LinkToCell(const /*packed*/ struct Point2d&);
	int32_t IsLocationAnIntersection(/*packed*/ struct Point2d&);
	virtual enum BoatClass::IntersectionTypes PickTurnDirection(const /*packed*/ struct Point2d&); // vtable+0x10
	int32_t DoWaterTilesConnect(unsigned short, unsigned short, enum DirectionTypes);
	void MakeATurn(enum BoatClass::IntersectionTypes);
	void GetNewPredictedLocation();
	void AdjustCurrentPosition();
	void AdjustNextPosition();
	enum BoatClass::StoppedReasons WhyAmIStopped();
	void GoStraight();
	void MakeUturn();
	void TurnLeft();
	void TurnRight();
	void UnPlaceBoat();
	// calltype: NearC
	static void InitArrays();
	// calltype: NearC
	static void SetBoatTypesAndLocations();
	// calltype: NearC
	static void PlaceInitialBoats();
	virtual void BeamBoatToWithinCameraRange(); // vtable+0x14
	virtual int32_t BeamBoatToLocation(long, long); // vtable+0x18
private:
	int32_t InitializeInstance(long, long, int32_t);
public:
	/*packed*/ class BoatClass operator=(const /*packed*/ class BoatClass&);
};

// Type: void;

// Type: long;

// Type: int32_t;

// Type: /*packed*/ struct VRview;
struct VRview{ // packed(0x58 bytes) TI: 0x2ecc
	/*+0x0*/   /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0xc*/   /*packed*/ struct Point3d scale; // 0xc bytes
	/*+0x18*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: /*packed*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // packed(0x18 bytes) TI: 0x1b03
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*packed*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*packed*/ struct _DYOBJ_INST *vwptr;
};

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: enum BoatClass::StoppedReasons;
enum StoppedReasons {
	NO_REASON = 0,
	TRAFFIC = 1,
	STOPPED_TRAFFIC = 2,
	PERSON_IN_WAY = 3,
	END_OF_WATER = 4,
	INTERSECTION_FULL = 5,
};

// Type: /*packed*/ struct Point2d (forward reference);
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: unsigned short;

// Type: /*packed*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // packed(0x64 bytes) TI: 0x1deb
	/*+0x0*/   /*packed*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*packed*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: enum DirectionTypes;
enum DirectionTypes {
	NO_DIRECTION = 0,
	NORTH = 1,
	SOUTH = 2,
	EAST = 4,
	WEST = 8,
	RISING_NORTH = 16,
	RISING_SOUTH = 32,
	RISING_EAST = 64,
	RISING_WEST = 128,
	NORTH_EAST = 5,
	SOUTH_EAST = 6,
	SOUTH_WEST = 10,
	NORTH_WEST = 9,
};

// Type: enum BoatClass::IntersectionTypes;
enum IntersectionTypes {
	DEAD_END = 0,
	STRAIGHT_AHEAD = 1,
	LEFT_ONLY = 2,
	RIGHT_ONLY = 4,
	LEFT_OR_STRAIGHT = 3,
	LEFT_OR_RIGHT = 6,
	RIGHT_OR_STRAIGHT = 5,
	LEFT_STRAIGHT_OR_RIGHT = 7,
};

// Type: /*packed*/ struct VRObjInfo;
struct VRObjInfo{ // packed(0x24 bytes) TI: 0x2ea8
	/*+0x0*/   int32_t Faces;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Radius;
	/*+0x10*/  /*packed*/ struct Point3d *ObjCenter;
	/*+0x14*/  /*packed*/ struct Point3d *VertsPtr;
	/*+0x18*/  /*packed*/ struct Xform3d *VertsXfm;
	/*+0x1c*/  /*packed*/ struct Point3d *OrgVerts;
	/*+0x20*/  int32_t *Matrix[4][4];
};

// Type: char *;

// Type: /*packed*/ struct _MISSION_PARMS;
struct _MISSION_PARMS{ // packed(0x18 bytes) TI: 0x307d
	/*+0x0*/   long op;
	/*+0x4*/   long id;
	/*+0x8*/   /*packed*/ struct Point2d maploc; // 0x8 bytes
	/*+0x10*/  long i2num;
	/*+0x14*/  long flags;
};

// Type: void * __ptr32;

// Type: uint32_t;



// Contribution: 1:00126470-0012a074 Module: 164, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00527470
static void $E7() {

	__asm        call   $E3;
	__asm        call   $E6;
	__asm        jmp    __RETURN;
__RETURN:
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x0052748a
static void $E3() {

	__asm        mov    BoatClass::lsBoat<vftable>, 0x593200;
	__asm        jmp    _T15;
_T15:
	return;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x005274a9
static void $E6() {

	__asm        push   0x5274C6;
	__asm        call   atexit;
	__asm        add    esp, 4;
	__asm        jmp    __RETURN;
__RETURN:
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x005274c6
static void $E4() {

	__asm        xor    eax, eax;
	__asm        mov    al, ds:[0x62B6E4];
	__asm        test   al, 1;
	__asm        jne    _T2d;

	__asm        xor    eax, eax;
