// Module: S3camera.obj
// Source: C:\Copter\source\game\S3camera.c
// autogenerated by simcopter_tool from PDB file

// Type: long;

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: unsigned short;

// Type: int32_t;

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // packed(0x64 bytes) TI: 0x1deb
	/*+0x0*/   /*packed*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*packed*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: void;

// Type: int32_t *;

// Type: /*packed*/ struct _CHASE_INFO (forward reference);
struct _CHASE_INFO{ // packed(0xc bytes) TI: 0x31b0
	/*+0x0*/   int32_t dist;
	/*+0x4*/   int32_t height;
	/*+0x8*/   int32_t focus;
};

// Type: /*packed*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // packed(0x18 bytes) TI: 0x1b03
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*packed*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*packed*/ struct _DYOBJ_INST *vwptr;
};

// Type: /*packed*/ struct _STOBJ_INST (forward reference);
struct _STOBJ_INST{ // packed(0x10 bytes) TI: 0x193f
	/*+0x0*/   /*packed*/ struct _STOBJ_INST *next;
	/*+0x4*/   void * __ptr32 mesh;
	/*+0x8*/   long user1;
	/*+0xc*/   long user2;
};



// Contribution: 1:000f7af0-000f8bb0 Module: 175, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004f8af0
void S3CameraMove(/*packed*/ struct Point3d *P) {
	/*bp-0x40*/  int32_t mat[4][4]; // 0x40 bytes
	/*bp-0x4c*/  /*packed*/ struct Point3d viewerPos; // 0xc bytes
	/*bp-0x58*/  /*packed*/ struct Point3d CameraVector; // 0xc bytes
	/*bp-0x5c*/  int32_t Velocity;
	/*bp-0x60*/  int32_t altdiff;
	/*bp-0x64*/  int32_t alt;
	/*bp-0x68*/  /*packed*/ struct _DYOBJ_INST *u_dyobj;
	/*bp-0x74*/  /*packed*/ struct Point3d CameraDelta; // 0xc bytes

// LINE 101:
	Velocity = 0x0;
// LINE 124:
	__asm        cmp    G_camera_mode, 0;
	__asm        je     _T23d;
// LINE 126:
	__asm        cmp    G_camera_mode, 3;
	__asm        jne    _Tfe;
// LINE 129:
	__asm        call   GetAvatarDYOBJ;
	__asm        mov    u_dyobj, eax;
// LINE 130:
	__asm        mov    eax, u_dyobj;
	__asm        add    eax, 0x24;
	__asm        push   eax;
