// Module: S3city.obj
// Source: C:\Copter\source\game\S3city.c
// autogenerated by simcopter_tool from PDB file

// Type: long;

// Type: int32_t;

// Type: /*packed*/ struct _dPoint2d (forward reference);
struct _dPoint2d{ // packed(0x10 bytes) TI: 0x2766
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double z; // 0x8 bytes
};

// Type: /*packed*/ struct Point2d (forward reference);
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct Point2d;
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: short;

// Type: /*packed*/ struct VRview;
struct VRview{ // packed(0x58 bytes) TI: 0x2ecc
	/*+0x0*/   /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0xc*/   /*packed*/ struct Point3d scale; // 0xc bytes
	/*+0x18*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: long *;

// Type: /*packed*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // packed(0x18 bytes) TI: 0x1b03
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*packed*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*packed*/ struct _DYOBJ_INST *vwptr;
};

// Type: /*packed*/ struct tagLogCityEnterExit;
struct tagLogCityEnterExit{ // packed(0x30 bytes) TI: 0x3191
	/*+0x0*/   unsigned long nType;
	/*+0x4*/   unsigned long nTime;
	/*+0x8*/   unsigned long nMissionID;
	/*+0xc*/   unsigned long nEnterOrExit;
	/*+0x10*/  char szCity[32]; // 0x20 bytes
};

// Type: char;

// Type: void;

// Type: /*packed*/ struct VRBmpHdr (forward reference);
struct VRBmpHdr{ // packed(0x10 bytes) TI: 0x2312
	/*+0x0*/   /*packed*/ struct VRBmpInfo info; // 0xc bytes
	/*+0xc*/   int32_t ScanOffset[1];
};

// Type: /*packed*/ struct _STOBJ_INST (forward reference);
struct _STOBJ_INST{ // packed(0x10 bytes) TI: 0x193f
	/*+0x0*/   /*packed*/ struct _STOBJ_INST *next;
	/*+0x4*/   void * __ptr32 mesh;
	/*+0x8*/   long user1;
	/*+0xc*/   long user2;
};

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: double;

// Type: unsigned short;

// Type: /*packed*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // packed(0x64 bytes) TI: 0x1deb
	/*+0x0*/   /*packed*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*packed*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};



// Contribution: 1:00109000-00112d42 Module: 170, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x0050a000
short S3CityInit() {
	/*bp-0x104*/ char szFilePath[260]; // 0x104 bytes
	/*bp-0x108*/ int32_t i;
	/*bp-0x138*/ /*packed*/ struct tagLogCityEnterExit tempLogCityEnterExit; // 0x30 bytes

// LINE 211:
	__asm        cmp    S_S2CityAlloc_Count, 0;
	__asm        jne    _T38;
// LINE 212:
	__asm        call   S2CityAlloc;
	__asm        movsx  eax, ax;
	__asm        test   eax, eax;
	__asm        je     _T32;
// LINE 213:
	return 0x1;
// LINE 214:
_T32:
	S_S2CityAlloc_Count++;
// LINE 219:
_T38:
	__asm        call   GetCurrentCityPath;
	__asm        push   eax;
	__asm        call   S2CityLoad;
	__asm        add    esp, 4;
	__asm        movsx  eax, ax;
	__asm        test   eax, eax;
	__asm        jne    _Tad;
// LINE 220:
	_assert(0xdc, 0x5b59f8, 0x5b5a18);
	__asm        jmp    _T72;

	__asm        jmp    _T72;
