// Module: S3fire.obj
// Source: C:\Copter\source\game\S3fire.c
// autogenerated by simcopter_tool from PDB file

// Type: int32_t;

// Type: long;

// Type: /*packed*/ struct Point2d (forward reference);
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct _dPoint2d (forward reference);
struct _dPoint2d{ // packed(0x10 bytes) TI: 0x2766
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double z; // 0x8 bytes
};

// Type: /*packed*/ struct _FIRE_DATA;
struct _FIRE_DATA{ // packed(0xa0 bytes) TI: 0x3030
	/*+0x0*/   long flags;
	/*+0x4*/   int32_t timetolive;
	/*+0x8*/   int32_t douse_points;
	/*+0xc*/   int32_t hdelta;
	/*+0x10*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x1c*/  long elevation;
	/*+0x20*/  /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x24*/  /*packed*/ struct _DYOBJ_INST dyfire; // 0x64 bytes
	/*+0x88*/  int32_t dycheck_timer;
	/*+0x8c*/  /*packed*/ struct Point2d celloc; // 0x8 bytes
	/*+0x94*/  int32_t building;
	/*+0x98*/  /*packed*/ struct _CELL_FIRE_DATA *cfd;
	/*+0x9c*/  long mission_id;
};

// Type: /*packed*/ struct _CELL_FIRE_DATA;
struct _CELL_FIRE_DATA{ // packed(0x8 bytes) TI: 0x303d
	/*+0x0*/   /*packed*/ struct _CELL_INFO *cptr;
	/*+0x4*/   long fire_count;
};

// Type: /*packed*/ struct _FIRE_DATA (forward reference);
struct _FIRE_DATA{ // packed(0xa0 bytes) TI: 0x3030
	/*+0x0*/   long flags;
	/*+0x4*/   int32_t timetolive;
	/*+0x8*/   int32_t douse_points;
	/*+0xc*/   int32_t hdelta;
	/*+0x10*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x1c*/  long elevation;
	/*+0x20*/  /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x24*/  /*packed*/ struct _DYOBJ_INST dyfire; // 0x64 bytes
	/*+0x88*/  int32_t dycheck_timer;
	/*+0x8c*/  /*packed*/ struct Point2d celloc; // 0x8 bytes
	/*+0x94*/  int32_t building;
	/*+0x98*/  /*packed*/ struct _CELL_FIRE_DATA *cfd;
	/*+0x9c*/  long mission_id;
};

// Type: void;

// Type: char *;

// Type: /*packed*/ struct VRObjInfo;
struct VRObjInfo{ // packed(0x24 bytes) TI: 0x2ea8
	/*+0x0*/   int32_t Faces;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Radius;
	/*+0x10*/  /*packed*/ struct Point3d *ObjCenter;
	/*+0x14*/  /*packed*/ struct Point3d *VertsPtr;
	/*+0x18*/  /*packed*/ struct Xform3d *VertsXfm;
	/*+0x1c*/  /*packed*/ struct Point3d *OrgVerts;
	/*+0x20*/  int32_t *Matrix[4][4];
};

// Type: /*packed*/ struct _CELL_FIRE_DATA (forward reference);
struct _CELL_FIRE_DATA{ // packed(0x8 bytes) TI: 0x303d
	/*+0x0*/   /*packed*/ struct _CELL_INFO *cptr;
	/*+0x4*/   long fire_count;
};

// Type: /*packed*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // packed(0x18 bytes) TI: 0x1b03
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*packed*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*packed*/ struct _DYOBJ_INST *vwptr;
};

// Type: /*packed*/ struct _MISSION_PARMS;
struct _MISSION_PARMS{ // packed(0x18 bytes) TI: 0x307d
	/*+0x0*/   long op;
	/*+0x4*/   long id;
	/*+0x8*/   /*packed*/ struct Point2d maploc; // 0x8 bytes
	/*+0x10*/  long i2num;
	/*+0x14*/  long flags;
};

// Type: /*packed*/ struct _STOBJ_INST (forward reference);
struct _STOBJ_INST{ // packed(0x10 bytes) TI: 0x193f
	/*+0x0*/   /*packed*/ struct _STOBJ_INST *next;
	/*+0x4*/   void * __ptr32 mesh;
	/*+0x8*/   long user1;
	/*+0xc*/   long user2;
};

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // packed(0x64 bytes) TI: 0x1deb
	/*+0x0*/   /*packed*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*packed*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: /*packed*/ struct _LZ_INFO (forward reference);
struct _LZ_INFO{ // packed(0x14 bytes) TI: 0x3152
	/*+0x0*/   int32_t flags;
	/*+0x4*/   int32_t ulx;
	/*+0x8*/   int32_t ulz;
	/*+0xc*/   int32_t dimx;
	/*+0x10*/  int32_t dimz;
};

// Type: /*packed*/ struct Point2d;
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: int32_t *;

// Type: short;

// Type: void * __ptr32;



// Contribution: 1:001235f0-00126462 Module: 165, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x005245f0
void S3FireReset() {
	/*bp-0x4*/   /*packed*/ struct _FIRE_DATA *fd;
	/*bp-0x8*/   long i;

// LINE 105:
	S_fire_count = 0x0;
// LINE 111:
_FOR_26:
	i = 0x0;
	fd = 0x6666f0;
	__asm        jmp    _FOR_COND_26;
_FOR_NEXT_26:
	i++;
	fd += 0xa0;
_FOR_COND_26:
	__asm        cmp    i, 0x8C;
	__asm        jge    _FOR_57;
// LINE 114:
	fd->flags = 0x0;
// LINE 115:
	__asm        jmp    _FOR_NEXT_26;
// LINE 119:
_FOR_57:
	for (i = 0x0; (i < 0x8c); i++) {
		// LINE 121:
			__asm        mov    eax, i;
			__asm        mov    S_cfdata[0].cptr[eax*8], 0;
		// LINE 122:
			__asm        mov    eax, i;
			__asm        mov    S_cfdata[0].fire_count[eax*8], 0;
	}
// LINE 126:
__RETURN:
}

// FUNCTION: COPTER_D 0x0052467d
void S3FireInit() {
