// Module: S3missn.obj
// Source: C:\Copter\source\game\S3missn.c
// autogenerated by simcopter_tool from PDB file

// Type: long;

// Type: int32_t;

// Type: /*packed*/ struct _dPoint2d (forward reference);
struct _dPoint2d{ // packed(0x10 bytes) TI: 0x2766
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double z; // 0x8 bytes
};

// Type: /*packed*/ struct _MISSION_STATICS;
struct _MISSION_STATICS{ // packed(0x1910 bytes) TI: 0x31da
	/*+0x0*/   long crime_ctr;
	/*+0x4*/   long fire_ctr;
	/*+0x8*/   long medevac_ctr;
	/*+0xc*/   long plane_ctr;
	/*+0x10*/  long rescue_ctr;
	/*+0x14*/  long riot_ctr;
	/*+0x18*/  long speeder_ctr;
	/*+0x1c*/  long traffic_ctr;
	/*+0x20*/  long train_ctr;
	/*+0x24*/  long transport_ctr;
	/*+0x28*/  long num_active_missions;
	/*+0x2c*/  long num_delayed_missions;
	/*+0x30*/  long key_ctr;
	/*+0x34*/  /*packed*/ struct MISSION_DATA *curr_mission;
	/*+0x38*/  /*packed*/ struct MISSION_DATA missions[30]; // 0x18d8 bytes
};

// Type: /*packed*/ struct tagLogString;
struct tagLogString{ // packed(0x14 bytes) TI: 0x31dc
	/*+0x0*/   unsigned long nType;
	/*+0x4*/   unsigned long nTime;
	/*+0x8*/   unsigned long nMissionID;
	/*+0xc*/   char * szLogString;
	/*+0x10*/  char szData[4];
};

// Type: void;

// Type: /*packed*/ struct tagCitySettings (forward reference);
struct tagCitySettings{ // packed(0x24 bytes) TI: 0x26eb
	/*+0x0*/   long lDifficulty;
	/*+0x4*/   long lMissionFrequencyFire;
	/*+0x8*/   long lMissionFrequencyCrime;
	/*+0xc*/   long lMissionFrequencyRescue;
	/*+0x10*/  long lMissionFrequencyRiot;
	/*+0x14*/  long lMissionFrequencyTraffic;
	/*+0x18*/  long lMissionFrequencyMedEvac;
	/*+0x1c*/  long lMissionFrequencyTransport;
	/*+0x20*/  long lDaytime;
};

// Type: float;

// Type: /*packed*/ struct tagCitySettings;
struct tagCitySettings{ // packed(0x24 bytes) TI: 0x26eb
	/*+0x0*/   long lDifficulty;
	/*+0x4*/   long lMissionFrequencyFire;
	/*+0x8*/   long lMissionFrequencyCrime;
	/*+0xc*/   long lMissionFrequencyRescue;
	/*+0x10*/  long lMissionFrequencyRiot;
	/*+0x14*/  long lMissionFrequencyTraffic;
	/*+0x18*/  long lMissionFrequencyMedEvac;
	/*+0x1c*/  long lMissionFrequencyTransport;
	/*+0x20*/  long lDaytime;
};

// Type: /*packed*/ struct MISSION_DATA (forward reference);
struct MISSION_DATA{ // packed(0xd4 bytes) TI: 0x31c4
	/*+0x0*/   char mtext[32]; // 0x20 bytes
	/*+0x20*/  long type_ctr;
	/*+0x24*/  long key;
	/*+0x28*/  /*packed*/ struct Point2d maploc; // 0x8 bytes
	/*+0x30*/  /*packed*/ struct Point2d destmaploc; // 0x8 bytes
	/*+0x38*/  /*packed*/ struct Point2d pickuploc; // 0x8 bytes
	/*+0x40*/  int32_t timer;
	/*+0x44*/  long money_bonus;
	/*+0x48*/  long points_bonus;
	/*+0x4c*/  long flags;
	/*+0x50*/  long type;
	/*+0x54*/  long state;
	/*+0x58*/  /*packed*/ struct __unnamed mdata; // 0x7c bytes
};

// Type: /*packed*/ struct _CELL_FIRE_DATA (forward reference);
struct _CELL_FIRE_DATA{ // packed(0x8 bytes) TI: 0x303d
	/*+0x0*/   /*packed*/ struct _CELL_INFO *cptr;
	/*+0x4*/   long fire_count;
};

// Type: /*packed*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // packed(0x64 bytes) TI: 0x1deb
	/*+0x0*/   /*packed*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*packed*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: /*packed*/ struct Point2d (forward reference);
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct _MISSION_PARMS (forward reference);
struct _MISSION_PARMS{ // packed(0x18 bytes) TI: 0x307d
	/*+0x0*/   long op;
	/*+0x4*/   long id;
	/*+0x8*/   /*packed*/ struct Point2d maploc; // 0x8 bytes
	/*+0x10*/  long i2num;
	/*+0x14*/  long flags;
};

// Type: /*packed*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // packed(0x18 bytes) TI: 0x1b03
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*packed*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*packed*/ struct _DYOBJ_INST *vwptr;
};

// Type: char *;

// Type: long *;

// Type: void * __ptr32;



// Contribution: 1:000f9090-000fd784 Module: 173, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004fa090
void S3MissionReset() {
	/*bp-0x4*/   long i;

// LINE 138:
	S_log.szLogString = 0x6bf060;
// LINE 141:
_FOR_1f:
	for (i = 0x0; (i < 0x1e); i++) {
		// LINE 143:
			__asm        mov    eax, i;
			__asm        mov    ecx, eax;
			__asm        lea    eax, [eax+eax*2];
			__asm        lea    eax, [ecx+eax*4];
			__asm        lea    eax, [ecx+eax*4];
			__asm        mov    S_mstatics.missions[0].flags[eax*4], 0;
	}
// LINE 146:
_T4a:
	S_mstatics.num_active_missions = 0x0;
// LINE 147:
	S_mstatics.num_delayed_missions = 0x0;
// LINE 148:
	S_mstatics.curr_mission = 0x0;
// LINE 149:
	S_mstatics.fire_ctr = 0x1;
