// Module: s3msnlog.obj
// Source: C:\Copter\Source\Game\s3msnlog.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class LogManager;
class LogManager{ // packed(0xc bytes) TI: 0x244f
public:
	void LogManager();
	void ~LogManager();
	int32_t ReadLogFromFile(char *);
	int32_t WriteLogToFile(char *);
	int32_t ReadFromMIFF(/*packed*/ class MIFF*);
	int32_t WriteToMIFF(/*packed*/ class MIFF*);
	int32_t ReadCurrentRecordFromMIFF(/*packed*/ class MIFF*);
	int32_t ValidateLogEntry(/*packed*/ struct tagLogBase*);
	long GetSizeOfLogRecord(/*packed*/ struct tagLogBase*);
	int32_t AddLogEntry(/*packed*/ struct tagLogBase*, int32_t, int32_t);
	int32_t SortLogEntriesByDate();
	int32_t SortLogEntriesByType();
	int32_t PurgeAllEntries();
	int32_t PurgeNEntries(long);
	// calltype: NearC
	static void MakeStringFromLogData(/*packed*/ struct tagLogBase*, /*packed*/ class basic_string<char>&, int32_t);
	// calltype: NearC
	static long GetStringIDFromLogEvent(const /*packed*/ struct tagLogMissionEvent*);
	/*+0x0*/   /*packed*/ class list<tagLogBase *> *myLogBasePtrList;
	/*+0x4*/   /*packed*/ class MessageDisplayManager *myMessageDisplayManager;
	/*+0x8*/   long lMaxEntries;
};

// Type: /*packed*/ class LogManager;
class LogManager{ // packed(0xc bytes) TI: 0x2b84
public:
	void LogManager();
	void ~LogManager();
	int32_t ReadLogFromFile(char *);
	int32_t WriteLogToFile(char *);
	int32_t ReadFromMIFF(/*packed*/ class MIFF*);
	int32_t WriteToMIFF(/*packed*/ class MIFF*);
	int32_t ReadCurrentRecordFromMIFF(/*packed*/ class MIFF*);
	int32_t ValidateLogEntry(/*packed*/ struct tagLogBase*);
	long GetSizeOfLogRecord(/*packed*/ struct tagLogBase*);
	int32_t AddLogEntry(/*packed*/ struct tagLogBase*, int32_t, int32_t);
	int32_t SortLogEntriesByDate();
	int32_t SortLogEntriesByType();
	int32_t PurgeAllEntries();
	int32_t PurgeNEntries(long);
	// calltype: NearC
	static void MakeStringFromLogData(/*packed*/ struct tagLogBase*, /*packed*/ class basic_string<char>&, int32_t);
	// calltype: NearC
	static long GetStringIDFromLogEvent(const /*packed*/ struct tagLogMissionEvent*);
	/*+0x0*/   /*packed*/ class list<tagLogBase *> *myLogBasePtrList;
	/*+0x4*/   /*unpacked*/ class MessageDisplayManager *myMessageDisplayManager;
	/*+0x8*/   long lMaxEntries;
};

// Type: /*packed*/ struct list<tagLogBase *>::list_node_buffer (forward reference);
struct list<tagLogBase *>::list_node_buffer{ // packed(0x8 bytes) TI: 0x16d2
	/*+0x0*/   void * __ptr32 next_buffer;
	/*+0x4*/   /*packed*/ struct list<tagLogBase *>::list_node *buffer;
};

// Type: /*packed*/ struct list<tagLogBase *>::list_node (forward reference);
struct list<tagLogBase *>::list_node{ // packed(0xc bytes) TI: 0x16d4
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*packed*/ struct tagLogBase *data;
};

// Type: uint32_t;

// Type: void ();

// Type: void;

// Type: /*packed*/ struct tagLogBase (forward reference);
struct tagLogBase{ // packed(0xc bytes) TI: 0x1819
	/*+0x0*/   unsigned long nType;
	/*+0x4*/   unsigned long nTime;
	/*+0x8*/   unsigned long nMissionID;
};

// Type: int32_t;

// Type: /*packed*/ class LogManager (forward reference);
class LogManager{ // packed(0xc bytes) TI: 0x2b84
public:
	void LogManager();
	void ~LogManager();
	int32_t ReadLogFromFile(char *);
	int32_t WriteLogToFile(char *);
	int32_t ReadFromMIFF(/*packed*/ class MIFF*);
	int32_t WriteToMIFF(/*packed*/ class MIFF*);
	int32_t ReadCurrentRecordFromMIFF(/*packed*/ class MIFF*);
	int32_t ValidateLogEntry(/*packed*/ struct tagLogBase*);
	long GetSizeOfLogRecord(/*packed*/ struct tagLogBase*);
	int32_t AddLogEntry(/*packed*/ struct tagLogBase*, int32_t, int32_t);
	int32_t SortLogEntriesByDate();
	int32_t SortLogEntriesByType();
	int32_t PurgeAllEntries();
	int32_t PurgeNEntries(long);
	// calltype: NearC
	static void MakeStringFromLogData(/*packed*/ struct tagLogBase*, /*packed*/ class basic_string<char>&, int32_t);
	// calltype: NearC
	static long GetStringIDFromLogEvent(const /*packed*/ struct tagLogMissionEvent*);
	/*+0x0*/   /*packed*/ class list<tagLogBase *> *myLogBasePtrList;
	/*+0x4*/   /*unpacked*/ class MessageDisplayManager *myMessageDisplayManager;
	/*+0x8*/   long lMaxEntries;
};

// Type: char *;

// Type: /*packed*/ class MIFF;
// VTABLE: COPTER_D 0x00591950
class MIFF : public PFile
{ // packed(0x148 bytes) TI: 0x428e
public:
	void MIFF(char *);
	void MIFF();
	virtual void ~MIFF() /* override */;
	virtual long OpenForReading(); // vtable+0x4
	virtual long OpenForWriting(long, long, long); // vtable+0x8
	virtual long OpenForAppending(); // vtable+0xc
	virtual long Close(); // vtable+0x10
	virtual long GetPresentRecordType(); // vtable+0x14
	virtual long GetPresentRecordSize(); // vtable+0x18
	virtual long GetPresentRecordDataSize(); // vtable+0x1c
	virtual long GetPresentRecordIndex(); // vtable+0x20
	virtual long VerifyFile(); // vtable+0x24
	virtual long ReadMIFFHeader(); // vtable+0x28
	virtual long ReadRecordHeader(); // vtable+0x2c
	virtual long ReadFileCreator(); // vtable+0x30
	virtual long ReadFileType(); // vtable+0x34
	virtual long ReadFileVersion(); // vtable+0x38
	virtual long ReadPresentRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x3c
	virtual long ReadPresentRecordData(char *, long); // vtable+0x40
	virtual long GoToFirstRecord(); // vtable+0x44
	virtual long GoToNextRecord(); // vtable+0x48
	virtual long GoToPreviousRecord(); // vtable+0x4c
	virtual long GoToFirstRecordOfGivenType(long); // vtable+0x50
	virtual long GoToNextRecordOfGivenType(long); // vtable+0x54
	virtual long GoToNthRecord(long); // vtable+0x58
	virtual long CountRecords(); // vtable+0x5c
	virtual long WriteMIFFRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x60
	virtual long WriteDataRecord(long, char *, long); // vtable+0x64
	virtual long WriteFileHeader(long, long, long); // vtable+0x68
	virtual long WriteEnd(); // vtable+0x6c
	/*+0x110*/ long lPresentRecordStart;
	/*+0x114*/ long lPresentRecordType;
	/*+0x118*/ long lPresentRecordLength;
	/*+0x11c*/ long lPresentRecordIndex;
	/*+0x120*/ long lReadWriteMode;
	/*+0x124*/ long bFileEndWritten;
	/*+0x128*/ long bFileAppearsCorrupt;
	/*+0x12c*/ /*packed*/ struct MIFFHeader myMIFFHeader; // 0x1c bytes
};

// Type: /*packed*/ class MIFF (forward reference);
// VTABLE: COPTER_D 0x00591950
class MIFF : public PFile
{ // packed(0x148 bytes) TI: 0x428e
public:
	void MIFF(char *);
	void MIFF();
	virtual void ~MIFF() /* override */;
	virtual long OpenForReading(); // vtable+0x4
	virtual long OpenForWriting(long, long, long); // vtable+0x8
	virtual long OpenForAppending(); // vtable+0xc
	virtual long Close(); // vtable+0x10
	virtual long GetPresentRecordType(); // vtable+0x14
	virtual long GetPresentRecordSize(); // vtable+0x18
	virtual long GetPresentRecordDataSize(); // vtable+0x1c
	virtual long GetPresentRecordIndex(); // vtable+0x20
	virtual long VerifyFile(); // vtable+0x24
	virtual long ReadMIFFHeader(); // vtable+0x28
	virtual long ReadRecordHeader(); // vtable+0x2c
	virtual long ReadFileCreator(); // vtable+0x30
	virtual long ReadFileType(); // vtable+0x34
	virtual long ReadFileVersion(); // vtable+0x38
	virtual long ReadPresentRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x3c
	virtual long ReadPresentRecordData(char *, long); // vtable+0x40
	virtual long GoToFirstRecord(); // vtable+0x44
	virtual long GoToNextRecord(); // vtable+0x48
	virtual long GoToPreviousRecord(); // vtable+0x4c
	virtual long GoToFirstRecordOfGivenType(long); // vtable+0x50
	virtual long GoToNextRecordOfGivenType(long); // vtable+0x54
	virtual long GoToNthRecord(long); // vtable+0x58
	virtual long CountRecords(); // vtable+0x5c
	virtual long WriteMIFFRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x60
	virtual long WriteDataRecord(long, char *, long); // vtable+0x64
	virtual long WriteFileHeader(long, long, long); // vtable+0x68
	virtual long WriteEnd(); // vtable+0x6c
	/*+0x110*/ long lPresentRecordStart;
	/*+0x114*/ long lPresentRecordType;
	/*+0x118*/ long lPresentRecordLength;
	/*+0x11c*/ long lPresentRecordIndex;
	/*+0x120*/ long lReadWriteMode;
	/*+0x124*/ long bFileEndWritten;
	/*+0x128*/ long bFileAppearsCorrupt;
	/*+0x12c*/ /*packed*/ struct MIFFHeader myMIFFHeader; // 0x1c bytes
};

// Type: /*packed*/ struct tagLogBase;
struct tagLogBase{ // packed(0xc bytes) TI: 0x1819
	/*+0x0*/   unsigned long nType;
	/*+0x4*/   unsigned long nTime;
	/*+0x8*/   unsigned long nMissionID;
};

// Type: long;

// Type: /*packed*/ class list<tagLogBase *>::iterator;
class list<tagLogBase *>::iterator : public bidirectional_iterator<tagLogBase *,int>
{ // packed(0x4 bytes) TI: 0x16d0
protected:
	/*+0x0*/   /*packed*/ struct list<tagLogBase *>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<tagLogBase *>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<tagLogBase *>::iterator&);
	/*packed*/ struct tagLogBase*& operator*();
	/*packed*/ class list<tagLogBase *>::iterator operator++(int32_t);
	/*packed*/ class list<tagLogBase *>::iterator& operator++();
	/*packed*/ class list<tagLogBase *>::iterator operator--(int32_t);
	/*packed*/ class list<tagLogBase *>::iterator& operator--();
};

// Type: /*packed*/ struct tagLogString (forward reference);
struct tagLogString{ // packed(0x14 bytes) TI: 0x31dc
	/*+0x0*/   unsigned long nType;
	/*+0x4*/   unsigned long nTime;
	/*+0x8*/   unsigned long nMissionID;
	/*+0xc*/   char * szLogString;
	/*+0x10*/  char szData[4];
};

// Type: char;

// Type: /*packed*/ struct tagLogMissionEvent (forward reference);
struct tagLogMissionEvent{ // packed(0x14 bytes) TI: 0x2451
	/*+0x0*/   unsigned long nType;
	/*+0x4*/   unsigned long nTime;
	/*+0x8*/   unsigned long nMissionID;
	/*+0xc*/   unsigned long nInfo0;
	/*+0x10*/  unsigned long nInfo1;
};

// Type: /*packed*/ struct tagLogCityEnterExit (forward reference);
struct tagLogCityEnterExit{ // packed(0x30 bytes) TI: 0x3191
	/*+0x0*/   unsigned long nType;
	/*+0x4*/   unsigned long nTime;
	/*+0x8*/   unsigned long nMissionID;
	/*+0xc*/   unsigned long nEnterOrExit;
	/*+0x10*/  char szCity[32]; // 0x20 bytes
};

// Type: /*packed*/ class basic_string<char>;
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: /*packed*/ class list<tagLogBase *> (forward reference);
class list<tagLogBase *>{ // packed(0x8 bytes) TI: 0x16ae
	using void_pointer = void * __ptr32;
	struct list<tagLogBase *>::list_node{ // packed(0xc bytes) TI: 0x16d4
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*packed*/ struct tagLogBase *data;
	};
protected:
	static /*packed*/ class allocator<list<tagLogBase *>::list_node> list_node_allocator;
	static /*packed*/ class allocator<tagLogBase *> value_allocator;
	using value_type = /*packed*/ struct tagLogBase*;
	using value_allocator_type = /*packed*/ class allocator<tagLogBase *>;
	using pointer = /*packed*/ struct tagLogBase**;
	using reference = /*packed*/ struct tagLogBase*&;
	using const_reference = const /*packed*/ struct tagLogBase*&;
	using list_node_allocator_type = /*packed*/ class allocator<list<tagLogBase *>::list_node>;
	using link_type = /*packed*/ struct list<tagLogBase *>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<tagLogBase *>::list_node_buffer{ // packed(0x8 bytes) TI: 0x16d2
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<tagLogBase *>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<tagLogBase *>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<tagLogBase *>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<tagLogBase *>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<tagLogBase *>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<tagLogBase *>::list_node *free_list;
	static /*packed*/ struct list<tagLogBase *>::list_node *next_avail;
	static /*packed*/ struct list<tagLogBase *>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<tagLogBase *>::list_node* get_node();
	void put_node(/*packed*/ struct list<tagLogBase *>::list_node*);
	/*+0x0*/   /*packed*/ struct list<tagLogBase *>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<tagLogBase *>::iterator : public bidirectional_iterator<tagLogBase *,int>
	{ // packed(0x4 bytes) TI: 0x16d0
	protected:
		/*+0x0*/   /*packed*/ struct list<tagLogBase *>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<tagLogBase *>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<tagLogBase *>::iterator&);
		/*packed*/ struct tagLogBase*& operator*();
		/*packed*/ class list<tagLogBase *>::iterator operator++(int32_t);
		/*packed*/ class list<tagLogBase *>::iterator& operator++();
		/*packed*/ class list<tagLogBase *>::iterator operator--(int32_t);
		/*packed*/ class list<tagLogBase *>::iterator& operator--();
	};
	class list<tagLogBase *>::const_iterator : public bidirectional_iterator<tagLogBase *,int>
	{ // packed(0x4 bytes) TI: 0x16c3
	protected:
		/*+0x0*/   /*packed*/ struct list<tagLogBase *>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<tagLogBase *>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<tagLogBase *>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<tagLogBase *>::const_iterator&);
		const /*packed*/ struct tagLogBase*& operator*();
		/*packed*/ class list<tagLogBase *>::const_iterator operator++(int32_t);
		/*packed*/ class list<tagLogBase *>::const_iterator& operator++();
		/*packed*/ class list<tagLogBase *>::const_iterator operator--(int32_t);
		/*packed*/ class list<tagLogBase *>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<tagLogBase *>::const_iterator,tagLogBase *,tagLogBase * const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<tagLogBase *>::iterator,tagLogBase *,tagLogBase * &,int>;
public:
	void list<tagLogBase *>(const /*packed*/ class list<tagLogBase *>&);
	void list<tagLogBase *>(const /*packed*/ struct tagLogBase**, const /*packed*/ struct tagLogBase**);
	void list<tagLogBase *>(uint32_t, const /*packed*/ struct tagLogBase*&);
	void list<tagLogBase *>();
	/*packed*/ class list<tagLogBase *>::const_iterator begin();
	/*packed*/ class list<tagLogBase *>::iterator begin();
	/*packed*/ class list<tagLogBase *>::const_iterator end();
	/*packed*/ class list<tagLogBase *>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<tagLogBase *>::const_iterator,tagLogBase *,tagLogBase * const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<tagLogBase *>::iterator,tagLogBase *,tagLogBase * &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<tagLogBase *>::const_iterator,tagLogBase *,tagLogBase * const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<tagLogBase *>::iterator,tagLogBase *,tagLogBase * &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*packed*/ struct tagLogBase*& front();
	/*packed*/ struct tagLogBase*& front();
	const /*packed*/ struct tagLogBase*& back();
	/*packed*/ struct tagLogBase*& back();
	void swap(/*packed*/ class list<tagLogBase *>&);
	void insert(/*packed*/ class list<tagLogBase *>::iterator, uint32_t, const /*packed*/ struct tagLogBase*&);
	void insert(/*packed*/ class list<tagLogBase *>::iterator, /*packed*/ class list<tagLogBase *>::const_iterator, /*packed*/ class list<tagLogBase *>::const_iterator);
	void insert(/*packed*/ class list<tagLogBase *>::iterator, const /*packed*/ struct tagLogBase**, const /*packed*/ struct tagLogBase**);
	/*packed*/ class list<tagLogBase *>::iterator insert(/*packed*/ class list<tagLogBase *>::iterator, const /*packed*/ struct tagLogBase*&);
	void push_front(const /*packed*/ struct tagLogBase*&);
	void push_back(const /*packed*/ struct tagLogBase*&);
	void erase(/*packed*/ class list<tagLogBase *>::iterator, /*packed*/ class list<tagLogBase *>::iterator);
	void erase(/*packed*/ class list<tagLogBase *>::iterator);
	void pop_front();
	void pop_back();
	void ~list<tagLogBase *>();
	/*packed*/ class list<tagLogBase *>& operator=(const /*packed*/ class list<tagLogBase *>&);
protected:
	void transfer(/*packed*/ class list<tagLogBase *>::iterator, /*packed*/ class list<tagLogBase *>::iterator, /*packed*/ class list<tagLogBase *>::iterator);
public:
	void splice(/*packed*/ class list<tagLogBase *>::iterator, /*packed*/ class list<tagLogBase *>&, /*packed*/ class list<tagLogBase *>::iterator, /*packed*/ class list<tagLogBase *>::iterator);
	void splice(/*packed*/ class list<tagLogBase *>::iterator, /*packed*/ class list<tagLogBase *>&, /*packed*/ class list<tagLogBase *>::iterator);
	void splice(/*packed*/ class list<tagLogBase *>::iterator, /*packed*/ class list<tagLogBase *>&);
	void remove(const /*packed*/ struct tagLogBase*&);
	void unique();
	void merge(/*packed*/ class list<tagLogBase *>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ class basic_string<char> (forward reference);
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: /*packed*/ class MTimeLocalized;
// VTABLE: COPTER_D 0x00592680
class MTimeLocalized : public MTime
{ // packed(0x10 bytes) TI: 0x2bc9
public:
	void MTimeLocalized(const /*packed*/ class MDate&, uint32_t, uint32_t, uint32_t);
	void MTimeLocalized(uint32_t, uint32_t, uint32_t);
	void MTimeLocalized(unsigned long);
	void MTimeLocalized();
	virtual char * PrintStringLocalized(char *, int32_t); // vtable+0x0
	/*+0xc*/   int32_t nLanguage;
};

// Type: /*packed*/ class PFile;
// VTABLE: COPTER_D 0x00590468
class PFile{ // packed(0x110 bytes) TI: 0x453c
	enum /* __unnamed */ {
		FileNull = -1,
	};
	enum SeekTypes {
		N_SEEK_FROM_FILE_START = 0,
		N_SEEK_FROM_FILE_CURRENT = 1,
		N_SEEK_FROM_FILE_END = 2,
	};
	enum AccessTypes {
		ReadOnly = 0,
		ReadWrite = 2,
		WriteOnly = 1,
		Create = 768,
		CreateExcl = 1280,
		Append = 8,
		Binary = 32768,
		Compat = 0,
		DenyNone = 64,
		DenyRead = 48,
		DenyWrite = 32,
		DenyRdWr = 16,
		NoInherit = 128,
	};
	enum PermissionTypes {
		PermRead = 256,
		PermWrite = 128,
		PermRdWr = 384,
	};
	enum seek_dir {
		beg = 0,
		cur = 1,
		end = 2,
	};
public:
	void PFile(char *);
	void PFile(const /*packed*/ class PFile&);
	void PFile(int32_t);
	void PFile();
	virtual void ~PFile(); // vtable+0x0
	int32_t Open(char *, unsigned short, unsigned short, int32_t);
	int32_t Close();
	int32_t GetHandle();
	long Position();
	void Length(long);
	long Length();
	long Seek(long, int32_t);
	long SeekToBegin();
	long SeekToEnd();
	int32_t IsOpen();
	int32_t Read(void * __ptr32, int32_t);
	int32_t Write(void * __ptr32, int32_t);
	void Flush();
	// calltype: NearC
	static void Remove(char *);
	// calltype: NearC
	static void Rename(char *, char *);
	// calltype: NearC
	static unsigned long Checksum(char *);
	long SetPath(char *);
	long FileCreate(char *, int32_t);
	long FileExists(char *);
	/*+0x4*/   char szFilePath[260]; // 0x104 bytes
	/*+0x108*/ int32_t Handle;
private:
	/*+0x10c*/ int32_t ShouldClose;
};

// Type: /*unpacked*/ class MTime (forward reference);
// MTime Class implementation not found

// Type: /*packed*/ struct bidirectional_iterator<tagLogBase *,int>;
struct bidirectional_iterator<tagLogBase *,int>{ // packed(0x1 bytes) TI: 0x126f
};



// Contribution: 1:000eabc0-000ed27d Module: 178, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x004ebbc0
static void $E57() {

	__asm        call   $E54;
	__asm        call   $E56;
	__asm        jmp    near ptr 0x004EBBD5;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x004ebbda
static void $E54() {

	__asm        mov    ecx, 0x606E78;
	__asm        call   LogManager::LogManager;
	__asm        jmp    near ptr 0x004EBBEF;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x004ebbf4
static void $E56() {

	__asm        push   0x4EBC11;
	__asm        call   atexit;
	__asm        add    esp, 4;
	__asm        jmp    near ptr 0x004EBC0C;
}

// STATIC INITIALIZER:
