// Module: S3msl.obj
// Source: C:\Copter\source\game\S3msl.c
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct _MISSILE_DATA;
struct _MISSILE_DATA{ // packed(0x48 bytes) TI: 0x2a6c
	/*+0x0*/   long flags;
	/*+0x4*/   int32_t timetolive;
	/*+0x8*/   int32_t smoketime;
	/*+0xc*/   int32_t speed;
	/*+0x10*/  /*packed*/ struct Point3d vector; // 0xc bytes
	/*+0x1c*/  /*packed*/ struct Point3d targloc; // 0xc bytes
	/*+0x28*/  /*packed*/ struct _DYOBJ_INST *dymissile;
	/*+0x2c*/  /*packed*/ struct Point2d celloc; // 0x8 bytes
	/*+0x34*/  long animseq;
	/*+0x38*/  int32_t gas_on;
	/*+0x3c*/  /*packed*/ struct _DYOBJ_INST *dystarter;
	/*+0x40*/  long mission_id;
	/*+0x44*/  long scale;
};

// Type: long;

// Type: short;

// Type: int32_t;

// Type: /*packed*/ struct _MISSILE_DATA (forward reference);
struct _MISSILE_DATA{ // packed(0x48 bytes) TI: 0x2a6c
	/*+0x0*/   long flags;
	/*+0x4*/   int32_t timetolive;
	/*+0x8*/   int32_t smoketime;
	/*+0xc*/   int32_t speed;
	/*+0x10*/  /*packed*/ struct Point3d vector; // 0xc bytes
	/*+0x1c*/  /*packed*/ struct Point3d targloc; // 0xc bytes
	/*+0x28*/  /*packed*/ struct _DYOBJ_INST *dymissile;
	/*+0x2c*/  /*packed*/ struct Point2d celloc; // 0x8 bytes
	/*+0x34*/  long animseq;
	/*+0x38*/  int32_t gas_on;
	/*+0x3c*/  /*packed*/ struct _DYOBJ_INST *dystarter;
	/*+0x40*/  long mission_id;
	/*+0x44*/  long scale;
};

// Type: void;

// Type: char *;

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct VRObjInfo;
struct VRObjInfo{ // packed(0x24 bytes) TI: 0x2ea8
	/*+0x0*/   int32_t Faces;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Radius;
	/*+0x10*/  /*packed*/ struct Point3d *ObjCenter;
	/*+0x14*/  /*packed*/ struct Point3d *VertsPtr;
	/*+0x18*/  /*packed*/ struct Xform3d *VertsXfm;
	/*+0x1c*/  /*packed*/ struct Point3d *OrgVerts;
	/*+0x20*/  int32_t *Matrix[4][4];
};

// Type: /*packed*/ struct Point2d (forward reference);
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // packed(0x64 bytes) TI: 0x1deb
	/*+0x0*/   /*packed*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*packed*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: /*packed*/ struct VRview;
struct VRview{ // packed(0x58 bytes) TI: 0x2ecc
	/*+0x0*/   /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0xc*/   /*packed*/ struct Point3d scale; // 0xc bytes
	/*+0x18*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: /*packed*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // packed(0x18 bytes) TI: 0x1b03
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*packed*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*packed*/ struct _DYOBJ_INST *vwptr;
};

// Type: /*packed*/ struct _MISSION_PARMS;
struct _MISSION_PARMS{ // packed(0x18 bytes) TI: 0x307d
	/*+0x0*/   long op;
	/*+0x4*/   long id;
	/*+0x8*/   /*packed*/ struct Point2d maploc; // 0x8 bytes
	/*+0x10*/  long i2num;
	/*+0x14*/  long flags;
};

// Type: /*packed*/ struct VRFaceInfo;
struct VRFaceInfo{ // packed(0x20 bytes) TI: 0x30c0
	/*+0x0*/   int32_t Face;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Plotter;
	/*+0x10*/  /*packed*/ struct VRBmpHdr *Bitmap;
	/*+0x14*/  int32_t * VertList;
	/*+0x18*/  /*packed*/ struct MapVert *MapVList;
	/*+0x1c*/  /*packed*/ struct MapVert *BarryPtr;
};

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct Point2d;
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct _CELL_FIRE_DATA (forward reference);
struct _CELL_FIRE_DATA{ // packed(0x8 bytes) TI: 0x303d
	/*+0x0*/   /*packed*/ struct _CELL_INFO *cptr;
	/*+0x4*/   long fire_count;
};

// Type: /*packed*/ struct _STOBJ_INST (forward reference);
struct _STOBJ_INST{ // packed(0x10 bytes) TI: 0x193f
	/*+0x0*/   /*packed*/ struct _STOBJ_INST *next;
	/*+0x4*/   void * __ptr32 mesh;
	/*+0x8*/   long user1;
	/*+0xc*/   long user2;
};

// Type: /*packed*/ struct FP3D;
struct FP3D{ // packed(0x18 bytes) TI: 0x3170
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double y; // 0x8 bytes
	/*+0x10*/  double z; // 0x8 bytes
};

// Type: double;

// Type: /*packed*/ struct VRBlit (forward reference);
struct VRBlit{ // packed(0x10 bytes) TI: 0x3182
	/*+0x0*/   int32_t nverts;
	/*+0x4*/   /*packed*/ struct Proj2d *verts;
	/*+0x8*/   int32_t notused;
	/*+0xc*/   int32_t user1;
};

// Type: long *;

// Type: void * __ptr32;



// Contribution: 1:0011d770-0012290d Module: 167, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x0051e770
void S3MissileReset() {
	/*bp-0x4*/   long i;
	/*bp-0x8*/   /*packed*/ struct _MISSILE_DATA *md;

// LINE 116:
	S_num_active_missiles = 0x0;
// LINE 117:
	S_num_active_bullets = 0x0;
// LINE 118:
	S_num_active_teargas = 0x0;
// LINE 119:
	S_num_active_debris = 0x0;
// LINE 120:
	S_num_active_traj = 0x0;
// LINE 121:
	S_num_active_lasers = 0x0;
// LINE 128:
_FOR_52:
	i = 0x0;
	md = 0x66c2f0;
	__asm        jmp    _FOR_COND_52;
_FOR_NEXT_52:
	i++;
	md += 0x48;
_FOR_COND_52:
	__asm        cmp    i, 0xA;
	__asm        jge    _FOR_84;
// LINE 131:
	md->flags = 0x2;
// LINE 132:
	__asm        jmp    _FOR_NEXT_52;
// LINE 138:
_FOR_84:
	i = 0x0;
	md = 0x66c5c0;
	__asm        jmp    _FOR_COND_84;
_FOR_NEXT_84:
	i++;
	md += 0x48;
_FOR_COND_84:
	__asm        cmp    i, 0xA;
