// Module: S3objs.obj
// Source: C:\Copter\source\game\S3objs.c
// autogenerated by simcopter_tool from PDB file

// Type: int32_t;

// Type: char;

// Type: /*packed*/ struct _LZ_INFO (forward reference);
struct _LZ_INFO{ // packed(0x14 bytes) TI: 0x3152
	/*+0x0*/   int32_t flags;
	/*+0x4*/   int32_t ulx;
	/*+0x8*/   int32_t ulz;
	/*+0xc*/   int32_t dimx;
	/*+0x10*/  int32_t dimz;
};

// Type: char *;

// Type: long;

// Type: /*packed*/ struct VRFaceInfo;
struct VRFaceInfo{ // packed(0x20 bytes) TI: 0x30c0
	/*+0x0*/   int32_t Face;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Plotter;
	/*+0x10*/  /*packed*/ struct VRBmpHdr *Bitmap;
	/*+0x14*/  int32_t * VertList;
	/*+0x18*/  /*packed*/ struct MapVert *MapVList;
	/*+0x1c*/  /*packed*/ struct MapVert *BarryPtr;
};

// Type: /*packed*/ struct VRBmpHdr (forward reference);
struct VRBmpHdr{ // packed(0x10 bytes) TI: 0x2312
	/*+0x0*/   /*packed*/ struct VRBmpInfo info; // 0xc bytes
	/*+0xc*/   int32_t ScanOffset[1];
};

// Type: /*packed*/ struct VRObjInfo;
struct VRObjInfo{ // packed(0x24 bytes) TI: 0x2ea8
	/*+0x0*/   int32_t Faces;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Radius;
	/*+0x10*/  /*packed*/ struct Point3d *ObjCenter;
	/*+0x14*/  /*packed*/ struct Point3d *VertsPtr;
	/*+0x18*/  /*packed*/ struct Xform3d *VertsXfm;
	/*+0x1c*/  /*packed*/ struct Point3d *OrgVerts;
	/*+0x20*/  int32_t *Matrix[4][4];
};

// Type: void;

// Type: /*packed*/ struct VRBlit (forward reference);
struct VRBlit{ // packed(0x10 bytes) TI: 0x3182
	/*+0x0*/   int32_t nverts;
	/*+0x4*/   /*packed*/ struct Proj2d *verts;
	/*+0x8*/   int32_t notused;
	/*+0xc*/   int32_t user1;
};

// Type: /*packed*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // packed(0x64 bytes) TI: 0x1deb
	/*+0x0*/   /*packed*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*packed*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};



// Contribution: 1:00117f90-0011d769 Module: 168, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00518f90
void S3ObjInit() {
	/*bp-0x24*/  /*packed*/ struct VRObjInfo oinfo; // 0x24 bytes
	/*bp-0x28*/  /*packed*/ struct VRBmpHdr *bhdr;
	/*bp-0x2c*/  int32_t face;
	/*bp-0x30*/  long objcount;
	/*bp-0x50*/  /*packed*/ struct VRFaceInfo finfo; // 0x20 bytes
	/*bp-0x54*/  long i;
	/*bp-0x58*/  long j;
	/*bp-0x5c*/  int32_t obj;
	/*bp-0xac*/  char msg[80]; // 0x50 bytes

// LINE 390:
	bhdr = VRInt2BmpHdr(G_restex, 0x33);
// LINE 391:
	G_blueshad = bhdr;
// LINE 392:
	G_blueshad += ((bhdr->info.height << 0x2) + 0xc);
// LINE 394:
	bhdr = VRInt2BmpHdr(G_restex, 0x34);
// LINE 395:
	G_fireshad = bhdr;
// LINE 396:
	G_fireshad += ((bhdr->info.height << 0x2) + 0xc);
// LINE 398:
	bhdr = VRInt2BmpHdr(G_restex, 0x32);
// LINE 399:
	G_smokshad = bhdr;
// LINE 400:
	G_smokshad += ((bhdr->info.height << 0x2) + 0xc);
// LINE 402:
