// Module: S3pssngr.obj
// Source: C:\Copter\Source\Game\S3pssngr.c
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct tagHeliPassengerData (forward reference);
struct tagHeliPassengerData{ // packed(0x15c bytes) TI: 0x2a7a
	/*+0x0*/   long lPassengerDataChanged;
	/*+0x4*/   long lSeatsTotal;
	/*+0x8*/   long lSeatsUsed;
	/*+0xc*/   long lDoubleSeatsTotal;
	/*+0x10*/  long lDoubleSeatsUsed;
	/*+0x14*/  long lRowWidth;
	/*+0x18*/  long lPassengerCount;
	/*+0x1c*/  /*packed*/ struct tagPassengerInfo passengers[16]; // 0x140 bytes
};

// Type: int32_t;

// Type: void;

// Type: long;

// Type: /*packed*/ struct tagPassengerInfo (forward reference);
struct tagPassengerInfo{ // packed(0x14 bytes) TI: 0x2a6e
	/*+0x0*/   long lPassengerFace;
	/*+0x4*/   long lPassengerExpression;
	/*+0x8*/   long lPassengerHealth;
	/*+0xc*/   long lPassengerID;
	/*+0x10*/  long lPassengerSeatUsed;
};

// Type: int32_t *;



// Contribution: 1:000f8bc0-000f9082 Module: 174, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004f9bc0
int32_t HeliPassengerHasChanged(/*packed*/ struct tagHeliPassengerData *heliPassengerData) {
// LINE 30:
	return heliPassengerData->lPassengerDataChanged;
// LINE 31:
}

// FUNCTION: COPTER_D 0x004f9bd5
void HeliPassengerSetChanged(/*packed*/ struct tagHeliPassengerData *heliPassengerData) {
// LINE 38:
	heliPassengerData->lPassengerDataChanged = 0x1;
// LINE 39:
}

// FUNCTION: COPTER_D 0x004f9be9
void HeliPassengerClearChanged(/*packed*/ struct tagHeliPassengerData *heliPassengerData) {
// LINE 46:
	heliPassengerData->lPassengerDataChanged = 0x0;
// LINE 47:
}

// FUNCTION: COPTER_D 0x004f9bfd
void HeliPassengerInit(/*packed*/ struct tagHeliPassengerData *heliPassengerData, int32_t nHeliType) {
	/*bp-0x4*/   int32_t i;
	/*bp-0x8*/   long lRowWidth;
	/*bp-0xc*/   long lSeatsTotal;

// LINE 59:
	heliPassengerData->lPassengerDataChanged = 0x0;
// LINE 60:
	heliPassengerData->lSeatsUsed = 0x0;
// LINE 61:
	heliPassengerData->lDoubleSeatsUsed = 0x0;
// LINE 62:
	heliPassengerData->lPassengerCount = 0x0;
// LINE 63:
	__asm        mov    eax, nHeliType;
	__asm        mov    ecx, eax;
	__asm        lea    eax, [eax+eax*4];
	__asm        lea    eax, [ecx+eax*2];
	__asm        mov    eax, S_helitype_data[0].max_seats[eax*8];
	__asm        mov    lSeatsTotal, eax;
	__asm        mov    eax, lSeatsTotal;
	__asm        mov    ecx, heliPassengerData;
	__asm        mov    [ecx+4], eax;
// LINE 64:
	lRowWidth = 0x5;
	heliPassengerData->lRowWidth = lRowWidth;
// LINE 73:
	__asm        mov    eax, lSeatsTotal;
	__asm        cdq;
	__asm        idiv   lRowWidth;
	__asm        mov    ecx, eax;
	__asm        mov    eax, lRowWidth;
	__asm        cdq;
	__asm        sub    eax, edx;
	__asm        sar    eax, 1;
	__asm        imul   ecx, eax;
	__asm        mov    eax, lSeatsTotal;
	__asm        cdq;
	__asm        idiv   lRowWidth;
	__asm        mov    eax, edx;
	__asm        cdq;
	__asm        sub    eax, edx;
	__asm        sar    eax, 1;
	__asm        add    ecx, eax;
	__asm        mov    eax, heliPassengerData;
	__asm        mov    [eax+0xC], ecx;
// LINE 76:
_FOR_96:
	for (i = 0x0; (i < 0x10); i++) {
		// LINE 77:
			__asm        mov    eax, i;
			__asm        shl    eax, 2;
			__asm        lea    eax, [eax+eax*4];
			__asm        mov    ecx, heliPassengerData;
			__asm        mov    dword ptr [eax+ecx+0x1C], 0xFFFFFFFF;
		// LINE 78:
			__asm        mov    eax, i;
			__asm        shl    eax, 2;
			__asm        lea    eax, [eax+eax*4];
			__asm        mov    ecx, heliPassengerData;
			__asm        mov    dword ptr [eax+ecx+0x20], 0;
		// LINE 79:
			__asm        mov    eax, i;
			__asm        shl    eax, 2;
			__asm        lea    eax, [eax+eax*4];
			__asm        mov    ecx, heliPassengerData;
			__asm        mov    dword ptr [eax+ecx+0x24], 0;
		// LINE 80:
			__asm        mov    eax, i;
			__asm        shl    eax, 2;
			__asm        lea    eax, [eax+eax*4];
			__asm        mov    ecx, heliPassengerData;
			__asm        mov    dword ptr [eax+ecx+0x28], 0xFFFFFFFF;
	}
// LINE 82:
__RETURN:
}

// FUNCTION: COPTER_D 0x004f9cfa
int32_t HeliPassengerCanAdd(/*packed*/ struct tagHeliPassengerData *heliPassengerData, /*packed*/ struct tagPassengerInfo *passenger) {
// LINE 95:
	return (heliPassengerData->lSeatsTotal - heliPassengerData->lSeatsUsed);
// LINE 96:
}

// FUNCTION: COPTER_D 0x004f9d16
int32_t HeliPassengerAdd(/*packed*/ struct tagHeliPassengerData *heliPassengerData, /*packed*/ struct tagPassengerInfo *passenger) {
	/*bp-0x4*/   int32_t i;

// LINE 111:
	__asm        mov    eax, passenger;
	__asm        push   eax;
	__asm        mov    eax, heliPassengerData;
	__asm        push   eax;
	__asm        call   HeliPassengerCanAdd;
	__asm        add    esp, 8;
	__asm        test   eax, eax;
	__asm        jne    _FOR_34;
// LINE 112:
	return 0x0;
// LINE 114:
_FOR_34:
	for (i = 0x0; (i < 0x10); i++) {
		// LINE 116:
			__asm        mov    eax, i;
			__asm        shl    eax, 2;
			__asm        lea    eax, [eax+eax*4];
			__asm        mov    ecx, heliPassengerData;
			__asm        cmp    dword ptr [eax+ecx+0x1C], 0xFFFFFFFF;
			__asm        jne    _Tdd;
		// LINE 117:
			__asm        mov    eax, passenger;
			__asm        mov    eax, [eax];
			__asm        mov    ecx, i;
			__asm        shl    ecx, 2;
			__asm        lea    ecx, [ecx+ecx*4];
			__asm        mov    edx, heliPassengerData;
			__asm        mov    [ecx+edx+0x1C], eax;
		// LINE 118:
			__asm        mov    eax, passenger;
			__asm        mov    eax, [eax+4];
			__asm        mov    ecx, i;
			__asm        shl    ecx, 2;
			__asm        lea    ecx, [ecx+ecx*4];
			__asm        mov    edx, heliPassengerData;
			__asm        mov    [ecx+edx+0x20], eax;
		// LINE 119:
			__asm        mov    eax, passenger;
			__asm        mov    eax, [eax+8];
			__asm        mov    ecx, i;
			__asm        shl    ecx, 2;
			__asm        lea    ecx, [ecx+ecx*4];
			__asm        mov    edx, heliPassengerData;
			__asm        mov    [ecx+edx+0x24], eax;
		// LINE 120:
			__asm        mov    eax, passenger;
			__asm        mov    eax, [eax+0xC];
			__asm        mov    ecx, i;
			__asm        shl    ecx, 2;
			__asm        lea    ecx, [ecx+ecx*4];
			__asm        mov    edx, heliPassengerData;
			__asm        mov    [ecx+edx+0x28], eax;
		// LINE 121:
			heliPassengerData->lSeatsUsed++;
		// LINE 122:
			heliPassengerData->lPassengerCount++;
		// LINE 125:
			HeliPassengerFitToSeats(heliPassengerData);
		// LINE 126:
			HeliPassengerSetChanged(heliPassengerData);
		// LINE 130:
			return 0x1;
		// LINE 132:
		_Tdd:
	}
// LINE 135:
_Te2:
	return 0x0;
// LINE 136:
}

// FUNCTION: COPTER_D 0x004f9e04
int32_t HeliPassengerGetIndexInHeli(/*packed*/ struct tagHeliPassengerData *heliPassengerData, long id) {
	/*bp-0x4*/   int32_t i;

// LINE 147:
_FOR_15:
	for (i = 0x0; (i < 0x10); i++) {
		// LINE 148:
			__asm        mov    eax, i;
			__asm        shl    eax, 2;
			__asm        lea    eax, [eax+eax*4];
			__asm        mov    ecx, heliPassengerData;
			__asm        mov    edx, id;
			__asm        cmp    [eax+ecx+0x28], edx;
			__asm        jne    _T43;
		// LINE 149:
			return i;
		// LINE 151:
		_T43:
	}
// LINE 152:
_T48:
	return 0xffffffff;
// LINE 153:
}

// FUNCTION: COPTER_D 0x004f9e5b
int32_t HeliPassengerSetExpression(/*packed*/ struct tagHeliPassengerData *heliPassengerData, long id, int32_t expression) {
	/*bp-0x4*/   int32_t i;

// LINE 160:
	i = HeliPassengerGetIndexInHeli(id, heliPassengerData);
// LINE 162:
	__asm        cmp    i, 0xFFFFFFFF;
	__asm        je     _T43;
// LINE 163:
	__asm        mov    eax, expression;
	__asm        mov    ecx, i;
	__asm        shl    ecx, 2;
	__asm        lea    ecx, [ecx+ecx*4];
	__asm        mov    edx, heliPassengerData;
	__asm        mov    [ecx+edx+0x20], eax;
// LINE 164:
	return 0x1;
// LINE 166:
_T43:
	return 0x0;
// LINE 167:
}

// FUNCTION: COPTER_D 0x004f9eaa
int32_t HeliPassengerRemove(/*packed*/ struct tagHeliPassengerData *heliPassengerData, long id) {
	/*bp-0x4*/   int32_t i;

// LINE 174:
	i = HeliPassengerGetIndexInHeli(id, heliPassengerData);
// LINE 176:
	__asm        cmp    i, 0xFFFFFFFF;
	__asm        je     _Tb8;
// LINE 177:
	heliPassengerData->lSeatsUsed--;
// LINE 178:
	__asm        mov    eax, i;
	__asm        shl    eax, 2;
	__asm        lea    eax, [eax+eax*4];
	__asm        mov    ecx, heliPassengerData;
	__asm        mov    dword ptr [eax+ecx+0x1C], 0xFFFFFFFF;
// LINE 179:
	__asm        mov    eax, i;
	__asm        shl    eax, 2;
	__asm        lea    eax, [eax+eax*4];
	__asm        mov    ecx, heliPassengerData;
	__asm        mov    dword ptr [eax+ecx+0x20], 0;
// LINE 180:
	__asm        mov    eax, i;
	__asm        shl    eax, 2;
	__asm        lea    eax, [eax+eax*4];
	__asm        mov    ecx, heliPassengerData;
	__asm        mov    dword ptr [eax+ecx+0x24], 0;
// LINE 181:
	__asm        mov    eax, i;
	__asm        shl    eax, 2;
	__asm        lea    eax, [eax+eax*4];
	__asm        mov    ecx, heliPassengerData;
	__asm        mov    dword ptr [eax+ecx+0x28], 0;
// LINE 182:
	__asm        mov    eax, i;
	__asm        shl    eax, 2;
	__asm        lea    eax, [eax+eax*4];
	__asm        mov    ecx, heliPassengerData;
	__asm        mov    dword ptr [eax+ecx+0x2C], 0;
// LINE 183:
	heliPassengerData->lPassengerCount--;
// LINE 186:
	HeliPassengerFitToSeats(heliPassengerData);
// LINE 187:
	HeliPassengerSetChanged(heliPassengerData);
// LINE 188:
	return 0x1;
// LINE 192:
_Tb8:
	return 0x0;
// LINE 193:
}

// FUNCTION: COPTER_D 0x004f9f6e
long HeliPassengerCountFreeSeats(/*packed*/ struct tagHeliPassengerData *heliPassengerData) {
// LINE 204:
	return (heliPassengerData->lSeatsTotal - heliPassengerData->lSeatsUsed);
// LINE 205:
}

// FUNCTION: COPTER_D 0x004f9f8a
void HeliPassengerFitToSeats(/*packed*/ struct tagHeliPassengerData *heliPassengerData) {
	/*bp-0x40*/  int32_t bSeats[16]; // 0x40 bytes
	/*bp-0x44*/  int32_t nSeat;
	/*bp-0x48*/  int32_t i;

// LINE 220:
_FOR_15:
	for (i = 0x0; (i < 0x10); i++) {
		// LINE 221:
			__asm        mov    eax, i;
			__asm        mov    dword ptr [ebp+eax*4-0x40], 0;
			__asm        jmp    _FOR_NEXT_15;
	}
// LINE 223:
_FOR_3e:
	for (i = 0x0; (i < 0x10); i++) {
		// LINE 224:
			__asm        mov    eax, i;
			__asm        shl    eax, 2;
			__asm        lea    eax, [eax+eax*4];
			__asm        mov    ecx, heliPassengerData;
			__asm        cmp    dword ptr [eax+ecx+0x1C], 0xFFFFFFFF;
			__asm        je     _T9f;
		// LINE 225:
			nSeat = FindFreeSeatForPassenger(bSeats[0], heliPassengerData->lRowWidth, heliPassengerData->lSeatsTotal, 0x1);
		// LINE 226:
			__asm        mov    eax, nSeat;
			__asm        mov    dword ptr [ebp+eax*4-0x40], 1;
		// LINE 227:
			__asm        mov    eax, nSeat;
			__asm        mov    ecx, i;
			__asm        shl    ecx, 2;
			__asm        lea    ecx, [ecx+ecx*4];
			__asm        mov    edx, heliPassengerData;
			__asm        mov    [ecx+edx+0x2C], eax;
		// LINE 229:
		_T9f:
	}
// LINE 230:
__RETURN:
}

// FUNCTION: COPTER_D 0x004fa033
int32_t FindFreeSeatForPassenger(int32_t nPassengerSeatUsage, int32_t nSeatsTotal, int32_t nRowWidth, int32_t * bSeats) {
	/*bp-0x4*/   int32_t j;

// LINE 245:
_FOR_15:
	for (j = 0x0; (j < nSeatsTotal); j++) {
		// LINE 246:
			__asm        mov    eax, j;
			__asm        mov    ecx, bSeats;
			__asm        cmp    dword ptr [ecx+eax*4], 0;
			__asm        jne    _T3c;
		// LINE 247:
			return j;
		// LINE 248:
		_T3c:
	}
// LINE 249:
_T41:
	return 0xffffffff;
// LINE 250:
}

