// Module: S3rdgrph.obj
// Source: C:\Copter\Source\Game\S3rdgrph.cpp
// autogenerated by simcopter_tool from PDB file

// Type: enum DirectionTypes;
enum DirectionTypes {
	NO_DIRECTION = 0,
	NORTH = 1,
	EAST = 2,
	SOUTH = 4,
	WEST = 8,
	RISING = 16,
	RISING_NORTH = 17,
	RISING_SOUTH = 20,
	RISING_EAST = 18,
	RISING_WEST = 24,
	NORTH_EAST = 3,
	SOUTH_EAST = 6,
	SOUTH_WEST = 12,
	NORTH_WEST = 9,
};

// Type: enum DirIndex2;
enum DirIndex2 {
	i2N = 0,
	i2E = 1,
	i2S = 2,
	i2W = 3,
	i2X = -1,
	i2I = -2,
};

// Type: void;

// Type: unsigned char;

// Type: int32_t;

// Type: /*packed*/ struct RGVertex (forward reference);
struct RGVertex{ // packed(0x33 bytes) TI: 0x1776
	/*+0x0*/   unsigned char x; // 0x1 bytes
	/*+0x1*/   unsigned char y; // 0x1 bytes
	/*+0x2*/   LfBitfield @ 0x11f58:
	[90m   LB.[32m[  0.  1][m [95mlength[m = 0x4
	[90m   LB.[95mTI[m = 0x1771
	[90m   LB.[32m[  1.  1][m [95mposition[m = 0x0
	[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
	 turnFlags;
	/*+0x2*/   LfBitfield @ 0x11f60:
	[90m   LB.[32m[  0.  1][m [95mlength[m = 0x4
	[90m   LB.[95mTI[m = 0x1772
	[90m   LB.[32m[  1.  1][m [95mposition[m = 0x4
	[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
	 deadEndFlags;
	/*+0x3*/   unsigned char fElevated; // 0x1 bytes
	/*+0x4*/   /*packed*/ struct Edge edge[4]; // 0x28 bytes
	/*+0x2c*/  unsigned char yindexPrev; // 0x1 bytes
	/*+0x2d*/  unsigned char xPrev; // 0x1 bytes
	/*+0x2e*/  unsigned char edgeIndexPrev; // 0x1 bytes
	/*+0x2f*/  int32_t STVisited;
};

// Type: /*packed*/ class RoadGraph (forward reference);
class RoadGraph{ // packed(0x280 bytes) TI: 0x485e
public:
	/*+0x0*/   /*packed*/ struct RGVertex *RGArray[128]; // 0x200 bytes
	/*+0x200*/ unsigned char RGLength[128]; // 0x80 bytes
	void RoadGraph();
	void Init();
	void ~RoadGraph();
	void Destroy();
	int32_t GetRoadLength(const /*packed*/ struct Goal*);
	void GetNextGoal(/*packed*/ struct Goal*);
	void PickPlaceOnRoad(/*packed*/ struct Goal*, int32_t, int32_t);
	/*packed*/ struct Goal FindIntersections(/*packed*/ struct _GridCoordinates, /*packed*/ struct _GridCoordinates, /*packed*/ struct Goal&, /*packed*/ struct Goal&);
	unsigned char FindYIndexToVertex(int32_t, int32_t);
	void DumpBuildMap();
	void FindPlaceOnRoad(/*packed*/ struct Goal&, /*packed*/ struct _GridCoordinates);
	void SamePlaceOtherDirection(/*packed*/ struct Goal*);
private:
	void FindEdges(int32_t, int32_t, /*packed*/ struct RGVertex*);
	void FindNumRoadElements(/*packed*/ struct RGVertex*, /*packed*/ struct Edge*, enum DirIndex2, unsigned char, unsigned char, int32_t);
	void FindRoads(int32_t, int32_t, /*packed*/ struct RGVertex*);
	void MakeRoad(/*packed*/ struct RGVertex*, unsigned char, unsigned char, enum DirIndex2);
	void FindDeadEnds();
	int32_t IsThisADeadEnd(enum DirIndex2, unsigned char, unsigned char);
	enum DirIndex2 WhatDirAmIConnectedTo(enum DirIndex2, enum DirIndex2*, unsigned char, unsigned char);
	int32_t FindIntersection(/*packed*/ struct Goal&, unsigned char, unsigned char, /*packed*/ struct _GridCoordinates, /*packed*/ struct _GridCoordinates, enum DirectionTypes);
	void ConnectHiwayRamp(int32_t, int32_t, unsigned short);
	int32_t SetElevation(unsigned short);
};

// Type: /*packed*/ struct Goal (forward reference);
struct Goal{ // packed(0x2a bytes) TI: 0x12ce
	/*+0x0*/   /*packed*/ struct RGVertex *pRGV;
	/*+0x4*/   int32_t elementIndex;
	/*+0x8*/   int32_t gridIndex;
	/*+0xc*/   /*packed*/ struct _GridCoordinates gridLoc; // 0x2 bytes
	/*+0xe*/   enum DirIndex2 edgeIndex;
	/*+0x12*/  enum DirIndex2 direction;
	/*+0x16*/  int32_t distance;
	/*+0x1a*/  int32_t turnFlags;
	/*+0x1e*/  int32_t deadEndFlags;
	/*+0x22*/  int32_t fElevated;
	/*+0x26*/  enum SlopeIndex slope;
};

// Type: /*packed*/ struct Edge (forward reference);
struct Edge{ // packed(0xa bytes) TI: 0x176b
	/*+0x0*/   unsigned char yindex; // 0x1 bytes
	/*+0x1*/   unsigned char x; // 0x1 bytes
	/*+0x2*/   unsigned short Time; // 0x2 bytes
	/*+0x4*/   unsigned short numElementsToPath; // 0x2 bytes
	/*+0x6*/   /*packed*/ struct Road *roadArray;
};

// Type: enum SlopeIndex;
enum SlopeIndex {
	DOWN = 0,
	FLAT = 1,
	UP = 2,
};

// Type: /*packed*/ struct Road (forward reference);
struct Road{ // packed(0x2 bytes) TI: 0x1752
	/*+0x0*/   LfBitfield @ 0x11b34:
	[90m   LB.[32m[  0.  1][m [95mlength[m = 0x2
	[90m   LB.[95mTI[m = 0x174e
	[90m   LB.[32m[  1.  1][m [95mposition[m = 0x0
	[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
	 direction; // 0x2 bytes
	/*+0x0*/   LfBitfield @ 0x11b3c:
	[90m   LB.[32m[  0.  1][m [95mlength[m = 0x2
	[90m   LB.[95mTI[m = 0x174f
	[90m   LB.[32m[  1.  1][m [95mposition[m = 0x2
	[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
	 slope; // 0x2 bytes
	/*+0x0*/   LfBitfield @ 0x11b44:
	[90m   LB.[32m[  0.  1][m [95mlength[m = 0x1
	[90m   LB.[95mTI[m = 0x1750
	[90m   LB.[32m[  1.  1][m [95mposition[m = 0x4
	[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
	 fElevated; // 0x1 bytes
	/*+0x1*/   unsigned char repeatCount; // 0x1 bytes
};

// Type: /*packed*/ struct _GridCoordinates;
struct _GridCoordinates{ // packed(0x2 bytes) TI: 0x143c
	/*+0x0*/   unsigned char x; // 0x1 bytes
	/*+0x1*/   unsigned char y; // 0x1 bytes
};

// Type: unsigned short;

// Type: /*packed*/ struct Goal;
struct Goal{ // packed(0x2a bytes) TI: 0x12ce
	/*+0x0*/   /*packed*/ struct RGVertex *pRGV;
	/*+0x4*/   int32_t elementIndex;
	/*+0x8*/   int32_t gridIndex;
	/*+0xc*/   /*packed*/ struct _GridCoordinates gridLoc; // 0x2 bytes
	/*+0xe*/   enum DirIndex2 edgeIndex;
	/*+0x12*/  enum DirIndex2 direction;
	/*+0x16*/  int32_t distance;
	/*+0x1a*/  int32_t turnFlags;
	/*+0x1e*/  int32_t deadEndFlags;
	/*+0x22*/  int32_t fElevated;
	/*+0x26*/  enum SlopeIndex slope;
};

// Type: short;



// Contribution: 1:0013ad40-0014035d Module: 155, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x0053bd40
void S3RoadGraphInit() {
// LINE 69:
	__asm        mov    ecx, 0x5C3828;
	__asm        call   RoadGraph::Init;
// LINE 70:
	__asm        jmp    _T15;
_T15:
}

// FUNCTION: COPTER_D 0x0053bd5a
void S3RoadGraphDestroy() {
// LINE 76:
	__asm        jmp    _T0b;
_T0b:
}

// FUNCTION: COPTER_D 0x0053bd6a
void RoadGraph::Init() {
	/*bp-0x4*/   int32_t x;
	/*bp-0x8*/   int32_t y;
	/*bp-0xc*/   unsigned char yindex;

// LINE 91:
	__asm        mov    x, 0;
	__asm        jmp    _T1b;
_T18:
	x++;
_T1b:
	__asm        cmp    x, 0x80;
	__asm        jge    _T3b;

	__asm        mov    eax, x;
	__asm        mov    ecx, this;
	__asm        mov    byte ptr [eax+ecx+0x200], 0;
	__asm        jmp    _T18;
// LINE 96:
_T3b:
	__asm        mov    x, 0;
	__asm        jmp    _T4a;
_T47:
	x++;
_T4a:
	__asm        cmp    x, 0x80;
