// Module: S3render.obj
// Source: C:\Copter\source\game\S3render.c
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct VRResource (forward reference);
struct VRResource{ // packed(0x10 bytes) TI: 0x18ae
	/*+0x0*/   char * mem;
	/*+0x4*/   int32_t mempoolid;
	/*+0x8*/   int32_t type;
	/*+0xc*/   int32_t entry;
};

// Type: long;

// Type: /*unpacked*/ struct VRResource (forward reference);
struct VRResource{ // not packed(0x10 bytes) TI: 0x34b5
	/*+0x0*/   char * mem;
	/*+0x4*/   int32_t mempoolid;
	/*+0x8*/   int32_t type;
	/*+0xc*/   int32_t entry;
};

// Type: /*packed*/ struct VRMemPool (forward reference);
struct VRMemPool{ // packed(0x20 bytes) TI: 0x2453
	/*+0x0*/   int32_t ObjCount;
	/*+0x4*/   int32_t entry;
	/*+0x8*/   char * Reset_Xf;
	/*+0xc*/   char * Reset_2d;
	/*+0x10*/  char * Current_Xf;
	/*+0x14*/  char * Current_2d;
	/*+0x18*/  char * End_Xf;
	/*+0x1c*/  char * End_2d;
};

// Type: /*unpacked*/ struct VRMemPool (forward reference);
struct VRMemPool{ // not packed(0x20 bytes) TI: 0x3e14
	/*+0x0*/   int32_t ObjCount;
	/*+0x4*/   int32_t entry;
	/*+0x8*/   char * Reset_Xf;
	/*+0xc*/   char * Reset_2d;
	/*+0x10*/  char * Current_Xf;
	/*+0x14*/  char * Current_2d;
	/*+0x18*/  char * End_Xf;
	/*+0x1c*/  char * End_2d;
};

// Type: int32_t;

// Type: char *;

// Type: /*packed*/ struct _dPoint2d (forward reference);
struct _dPoint2d{ // packed(0x10 bytes) TI: 0x2766
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double z; // 0x8 bytes
};

// Type: char;

// Type: /*packed*/ struct tagUserPersonalInfo (forward reference);
struct tagUserPersonalInfo{ // packed(0x58 bytes) TI: 0x1a2a
	/*+0x0*/   char szUserName[64]; // 0x40 bytes
	/*+0x40*/  long lMoney;
	/*+0x44*/  long lHelicopters;
	/*+0x48*/  long lEquipment;
	/*+0x4c*/  long lTrophies;
	/*+0x50*/  long lPoints;
	/*+0x54*/  long lTeargasCount;
};

// Type: /*packed*/ struct Point2d (forward reference);
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: void * __ptr32;

// Type: void;

// Type: int32_t *;



// Contribution: 1:000e9c40-000eabb1 Module: 179, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004eac40
int32_t VRAppInit() {
	/*bp-0x104*/ char szFilePath[260]; // 0x104 bytes
	/*bp-0x108*/ int32_t totalVehicles;
	/*bp-0x10c*/ int32_t instanceID;
	/*bp-0x110*/ long maxval;
	/*bp-0x114*/ long memxf;
	/*bp-0x118*/ int32_t i;
	/*bp-0x11c*/ long mem2d;
	/*bp-0x120*/ int32_t j;
	/*bp-0x124*/ int32_t obj;

// LINE 175:
	G_InitializationProgress = 0x1;
// LINE 179:
	S3HeliTweakInit();
// LINE 180:
	S3FireTweakInit();
// LINE 181:
	S3CameraTweakInit();
// LINE 182:
	S3PersonTweakInit();
// LINE 183:
	S3MissionTweakInit();
// LINE 184:
	CareerCityTweakInit();
// LINE 185:
	TWKReadAllFiles(0x5b4798);
// LINE 186:
	UpdateFigureVals();
// LINE 188:
	__asm        or     G_InitializationProgress, 2;
// LINE 189:
	VREngineInit();
// LINE 190:
	__asm        cmp    G_run_old, 0;
	__asm        jne    _T64;
// LINE 191:
	__asm        call   0x004D7300;
// LINE 195:
_T64:
	i = 0x3a3a3a3a;
// LINE 196:
	__asm        mov    eax, i;
	__asm        push   eax;
	__asm        call   0x004D682B;
	__asm        add    esp, 4;
// LINE 199:
	G_ClearColor = (i & 0xff);
// LINE 243:
	__asm        push   0x598EE0;
	__asm        call   0x004D6A69;
	__asm        add    esp, 4;
// LINE 244:
	G_video_mode = 0x10;
// LINE 247:
	__asm        push   0x10000;
	__asm        call   0x004D6610;
	__asm        add    esp, 4;
// LINE 248:
	VRFrustSetNormals();
// LINE 271:
	__asm        or     G_InitializationProgress, 4;
// LINE 276:
	GetPathForFile(0x6, 0x0, 0x5b47a4, szFilePath[0]);
// LINE 277:
	G_restex = VRLoadResource(szFilePath[0], 0x3, 0x5b47b0);
// LINE 279:
	GetPathForFile(0x7, 0x0, 0x5b47b4, szFilePath[0]);
// LINE 280:
	G_resgeo1 = VRLoadResource(szFilePath[0], 0x1, 0x5b47c0);
// LINE 282:
	GetPathForFile(0x7, 0x0, 0x5b47c8, szFilePath[0]);
// LINE 283:
	G_resgeo2 = VRLoadResource(szFilePath[0], 0x1, 0x5b47d4);
// LINE 285:
	GetPathForFile(0x7, 0x0, 0x5b47dc, szFilePath[0]);
// LINE 286:
	G_resgeo3 = VRLoadResource(szFilePath[0], 0x1, 0x5b47e8);
// LINE 305:
	__asm        cmp    G_restex, 0;
	__asm        je     _T1bd;

	__asm        cmp    G_resgeo1, 0;
	__asm        je     _T1bd;

	__asm        cmp    G_resgeo2, 0;
	__asm        je     _T1bd;

	__asm        cmp    G_resgeo3, 0;
	__asm        jne    _T1ca;
// LINE 306:
_T1bd:
	ERexit(0x5b47f0);
// LINE 311:
_T1ca:
	GetPathForFile(0x6, 0x0, 0x5b480c, szFilePath[0]);
// LINE 312:
	__asm        push   0x14;
	__asm        push   0x1F1F;
	__asm        mov    eax, G_restex;
	__asm        push   eax;
	__asm        lea    eax, szFilePath[0];
	__asm        push   eax;
	__asm        call   VRLoadAlignedBmp;
	__asm        add    esp, 0x10;
	__asm        cmp    eax, 1;
	__asm        je     _T214;
// LINE 313:
	ERexit(0x5b4818);
// LINE 319:
_T214:
	VRSetBmpToTiled(G_restex, 0x1f1f, 0x2, 0x0);
// LINE 320:
	VRSetBmpToTiled(G_restex, 0x1f1f, 0x27, 0x0);
// LINE 321:
	VRSetBmpToTiled(G_restex, 0x1f1f, 0x28, 0x0);
// LINE 322:
	VRSetBmpToTiled(G_restex, 0x1f1f, 0xd, 0x0);
// LINE 324:
	__asm        or     G_InitializationProgress, 8;
// LINE 326:
	__asm        push   1;
	__asm        mov    eax, G_restex;
	__asm        push   eax;
	__asm        call   VRCreateTexColors;
	__asm        add    esp, 8;
	__asm        test   eax, eax;
	__asm        je     _T29c;
// LINE 327:
	ERexit(0x5b4834);
// LINE 337:
_T29c:
	mem2d = 0x0;
	memxf = mem2d;
// LINE 339:
	i = VRGetResObjectCnt(G_resgeo1);
// LINE 340:
_FOR_2d5:
	for (j = 0x0; (j < i); j++) {
		// LINE 342:
			obj = VRGetResObject(G_resgeo1, j);
		// LINE 343:
			__asm        mov    eax, obj;
			__asm        push   eax;
			__asm        call   0x004D84F8;
			__asm        add    esp, 4;
			__asm        mov    maxval, eax;
		// LINE 344:
			__asm        mov    eax, maxval;
			__asm        cmp    memxf, eax;
			__asm        jge    _T33b;

			memxf = maxval;
		// LINE 345:
		_T33b:
			__asm        mov    eax, obj;
			__asm        push   eax;
			__asm        call   0x004D8506;
			__asm        add    esp, 4;
			__asm        mov    maxval, eax;
		// LINE 346:
			__asm        mov    eax, maxval;
			__asm        cmp    mem2d, eax;
			__asm        jge    _T36e;

			mem2d = maxval;
		// LINE 347:
		_T36e:
	}
// LINE 349:
_T373:
	i = VRGetResObjectCnt(G_resgeo2);
// LINE 350:
_FOR_396:
	for (j = 0x0; (j < i); j++) {
		// LINE 352:
			obj = VRGetResObject(G_resgeo2, j);
		// LINE 353:
			__asm        mov    eax, obj;
			__asm        push   eax;
			__asm        call   0x004D84F8;
			__asm        add    esp, 4;
			__asm        mov    maxval, eax;
		// LINE 354:
			__asm        mov    eax, maxval;
			__asm        cmp    memxf, eax;
			__asm        jge    _T3fc;

			memxf = maxval;
		// LINE 355:
		_T3fc:
			__asm        mov    eax, obj;
			__asm        push   eax;
			__asm        call   0x004D8506;
			__asm        add    esp, 4;
			__asm        mov    maxval, eax;
		// LINE 356:
			__asm        mov    eax, maxval;
			__asm        cmp    mem2d, eax;
			__asm        jge    _T42f;

			mem2d = maxval;
		// LINE 357:
		_T42f:
	}
// LINE 360:
_T434:
	i = VRGetResObjectCnt(G_resgeo3);
// LINE 361:
_FOR_457:
	for (j = 0x0; (j < i); j++) {
		// LINE 363:
			obj = VRGetResObject(G_resgeo3, j);
		// LINE 364:
			__asm        mov    eax, obj;
			__asm        push   eax;
			__asm        call   0x004D84F8;
			__asm        add    esp, 4;
			__asm        mov    maxval, eax;
		// LINE 365:
			__asm        mov    eax, maxval;
			__asm        cmp    memxf, eax;
			__asm        jge    _T4bd;

			memxf = maxval;
		// LINE 366:
		_T4bd:
			__asm        mov    eax, obj;
			__asm        push   eax;
			__asm        call   0x004D8506;
			__asm        add    esp, 4;
			__asm        mov    maxval, eax;
		// LINE 367:
			__asm        mov    eax, maxval;
			__asm        cmp    mem2d, eax;
			__asm        jge    _T4f0;

			mem2d = maxval;
		// LINE 368:
		_T4f0:
	}
// LINE 372:
_T4f5:
	__asm        shl    mem2d, 3;
// LINE 374:
	G_main_mp = VRCreateMemPool(memxf, mem2d);
// LINE 375:
	__asm        cmp    G_main_mp, 0;
	__asm        jne    _T531;
// LINE 376:
	ERexit(0x5b485c);
// LINE 379:
_T531:
	VRAssignMemPoolToRes(G_resgeo1, G_main_mp);
// LINE 380:
	VRAssignMemPoolToRes(G_resgeo2, G_main_mp);
// LINE 381:
	VRAssignMemPoolToRes(G_resgeo3, G_main_mp);
// LINE 383:
	__asm        or     G_InitializationProgress, 0x10;
// LINE 384:
	S3TerrainInit();
// LINE 386:
	__asm        or     G_InitializationProgress, 0x20;
// LINE 387:
	S3ObjInit();
// LINE 393:
	VRAssignTextureResToGroup(G_resgeo1, G_restex);
// LINE 394:
	VRAssignTextureResToGroup(G_resgeo2, G_restex);
// LINE 395:
	VRAssignTextureResToGroup(G_resgeo3, G_restex);
// LINE 398:
	VRResFreeBarrys(G_resgeo1);
// LINE 399:
	VRResFreeBarrys(G_resgeo2);
// LINE 400:
	VRResFreeBarrys(G_resgeo3);
// LINE 403:
	__asm        or     G_InitializationProgress, 0x40;
// LINE 404:
	S3MapInit();
// LINE 408:
	S3ObjLinkLowRes();
// LINE 413:
	G_dyobjmempool = S2AllocPool(0x10000);
// LINE 416:
	__asm        or     G_InitializationProgress, 0x80;
// LINE 417:
	G_helidata[3].type = 0x3;
// LINE 418:
	G_helidata[1].type = 0x1;
// LINE 419:
	G_helidata[2].type = 0x2;
// LINE 420:
	G_helidata[5].type = 0x5;
// LINE 421:
	G_helidata[0].type = 0x0;
// LINE 422:
	G_helidata[4].type = 0x4;
// LINE 423:
	G_helidata[6].type = 0x6;
// LINE 424:
	G_helidata[7].type = 0x7;
// LINE 425:
	G_helidata[8].type = 0x8;
// LINE 426:
	S3HeliInitInstance(0x6bf1d0);
// LINE 427:
	S3HeliInitInstance((0x6bf1d0 + 0x32c));
// LINE 428:
	S3HeliInitInstance((0x6bf1d0 + 0x658));
// LINE 429:
	S3HeliInitInstance((0x6bf1d0 + 0x984));
// LINE 430:
	S3HeliInitInstance((0x6bf1d0 + 0xcb0));
// LINE 431:
	S3HeliInitInstance((0x6bf1d0 + 0xfdc));
// LINE 432:
	S3HeliInitInstance((0x6bf1d0 + 0x1308));
// LINE 433:
	S3HeliInitInstance((0x6bf1d0 + 0x1634));
// LINE 434:
	S3HeliInitInstance((0x6bf1d0 + 0x1960));
// LINE 436:
	__asm        or     G_InitializationProgress, 0x100;
// LINE 439:
_FOR_730:
	for (instanceID = 0x0; (instanceID < 0x32); instanceID++) {
		// LINE 441:
			__asm        mov    eax, instanceID;
			__asm        push   eax;
			__asm        call   CreateAutomobileInstance;
			__asm        add    esp, 4;
			__asm        test   eax, eax;
			__asm        jne    _T75f;
		// LINE 442:
			__asm        jmp    _T764;
		// LINE 443:
		_T75f:
	}
// LINE 445:
_T764:
	totalVehicles = (instanceID + 0x5);
// LINE 446:
_FOR_778:
	for (; (totalVehicles > instanceID); instanceID++) {
		// LINE 448:
			__asm        mov    eax, instanceID;
			__asm        push   eax;
			__asm        call   CreatePoliceCarInstance;
			__asm        add    esp, 4;
			__asm        test   eax, eax;
			__asm        jne    _T7ac;
		// LINE 449:
			__asm        jmp    _T7b1;
		// LINE 450:
		_T7ac:
	}
// LINE 452:
_T7b1:
	totalVehicles = (instanceID + 0x5);
// LINE 453:
_FOR_7c5:
	for (; (totalVehicles > instanceID); instanceID++) {
		// LINE 455:
			__asm        mov    eax, instanceID;
			__asm        push   eax;
			__asm        call   CreateFireTruckInstance;
			__asm        add    esp, 4;
			__asm        test   eax, eax;
			__asm        jne    _T7f9;
		// LINE 456:
			__asm        jmp    _T7fe;
		// LINE 457:
		_T7f9:
	}
// LINE 459:
_T7fe:
	totalVehicles = (instanceID + 0x5);
// LINE 460:
_FOR_812:
	for (; (totalVehicles > instanceID); instanceID++) {
		// LINE 462:
			__asm        mov    eax, instanceID;
			__asm        push   eax;
			__asm        call   CreateAmbulanceInstance;
			__asm        add    esp, 4;
			__asm        test   eax, eax;
			__asm        jne    _T846;
		// LINE 463:
			__asm        jmp    _T84b;
		// LINE 464:
		_T846:
	}
// LINE 467:
_T84b:
	__asm        or     G_InitializationProgress, 0x200;
// LINE 468:
	totalVehicles = (instanceID + 0x5);
// LINE 469:
_FOR_869:
	for (; (totalVehicles > instanceID); instanceID++) {
		// LINE 471:
			__asm        mov    eax, instanceID;
			__asm        push   eax;
			__asm        call   CreateCriminalCarInstance;
			__asm        add    esp, 4;
			__asm        test   eax, eax;
			__asm        jne    _T89d;
		// LINE 472:
			__asm        jmp    _FOR_8b1;
		// LINE 473:
		_T89d:
	}
// LINE 476:
_FOR_8b1:
	for (i = 0x0; (i < 0x1); i++) {
		// LINE 483:
			CreateTrainInstance(i);
	}
// LINE 488:
_FOR_8e7:
	for (i = 0x0; (i < 0x2); i++) {
		// LINE 495:
			CreatePlaneInstance(i);
	}
// LINE 499:
_FOR_91d:
	for (i = 0x0; (i < 0x3); i++) {
		// LINE 506:
			CreateBoatInstance(i);
	}
// LINE 510:
_T944:
	__asm        or     G_InitializationProgress, 0x400;
// LINE 511:
	S3FireInit();
// LINE 514:
	S3ExplosionInit();
// LINE 517:
	S3MissileInit();
// LINE 520:
	__asm        or     G_InitializationProgress, 0x800;
// LINE 521:
	S3PersonInit();
// LINE 527:
	G_VRAppInitCalled = 0x1;
// LINE 529:
	return VRAppCityInit(0x0);
// LINE 530:
}

// FUNCTION: COPTER_D 0x004eb5ca
int32_t VRAppCityInit(int32_t reload) {
	/*bp-0x4*/   /*packed*/ struct Point2d *pad;
	/*bp-0x8*/   long i;
	/*bp-0xc*/   /*packed*/ struct tagUserPersonalInfo *up;

// LINE 553:
	__asm        cmp    reload, 1;
	__asm        jne    _T1d;
// LINE 554:
	G_InitializationProgress = 0x0;
// LINE 555:
_T1d:
	__asm        or     G_InitializationProgress, 0x1000;
// LINE 558:
	G_camera_mode = 0x3;
// LINE 562:
	__asm        cmp    reload, 1;
	__asm        jne    _T7b;
// LINE 564:
	S3HeliReset();
// LINE 565:
	S3FireReset();
// LINE 566:
	S3ExplosionReset();
// LINE 567:
	S3MissileReset();
// LINE 568:
	S3PersonReset();
// LINE 569:
	S3StationReset();
// LINE 570:
	ResetAllAutomobiles();
// LINE 571:
	ResetAllTrains();
// LINE 572:
	ResetAllPlanes();
// LINE 573:
	ResetAllBoats();
// LINE 574:
	S2AllocFreePool(G_citymempool);
// LINE 576:
_T7b:
	S3MissionReset();
// LINE 579:
	S3CityInit();
// LINE 581:
	__asm        or     G_InitializationProgress, 0x2000;
// LINE 583:
	S3RoadGraphInit();
// LINE 586:
	S3StationInit();
// LINE 589:
	S3RoadDataInit();
// LINE 597:
	__asm        cmp    G_daynight, 1;
	__asm        jne    _Tba;
// LINE 599:
	AutoSetAllHeadlights(0x1);
// LINE 601:
	__asm        jmp    _Tc4;
// LINE 603:
_Tba:
	AutoSetAllHeadlights(0x0);
// LINE 606:
_Tc4:
	S3ObjSetFlatShading();
// LINE 609:
	G_uheli = 0x6bf1d0;
// LINE 613:
	G_testheli = 0x0;
// LINE 618:
	__asm        cmp    G_testmode, 1;
	__asm        jne    _T12b;
// LINE 620:
	G_camera_mode = 0x0;
// LINE 622:
	__asm        mov    eax, G_uheli;
	__asm        mov    eax, [eax+0xA4];
	__asm        add    eax, 0x18;
	__asm        mov    ecx, 0x6BF1C0;
	__asm        mov    edx, [eax];
	__asm        mov    [ecx], edx;
	__asm        mov    edx, [eax+4];
	__asm        mov    [ecx+4], edx;
	__asm        mov    eax, [eax+8];
	__asm        mov    [ecx+8], eax;
// LINE 623:
	G_testloc.x -= 0x6400000;
// LINE 624:
	G_testloc.z += 0x76c0000;
// LINE 627:
_T12b:
	__asm        or     G_InitializationProgress, 0x4000;
// LINE 629:
	S3ViewerInit();
// LINE 632:
	S3PersonUserStart(G_helibase.pad1.x, G_helibase.pad1.y, 0x140000, 0x140000);
// LINE 633:
	__asm        cmp    G_camera_mode, 3;
	__asm        jne    _T194;
// LINE 635:
	G_uheli->flags = 0x0;
// LINE 638:
	S3PersonUserAppear(G_helibase.pad1.x, G_helibase.pad1.y, 0x140000, 0x140000);
// LINE 640:
	__asm        jmp    _T1a0;
// LINE 643:
_T194:
	G_uheli->flags = 0x1;
// LINE 647:
_T1a0:
	up = GetCurrentUserPersonalInfo();
// LINE 648:
_FOR_1b4:
	for (i = 0x0; (i < 0x9); i++) {
		// LINE 651:
			__asm        mov    eax, i;
			__asm        mov    ecx, eax;
			__asm        lea    eax, [eax+eax*4];
			__asm        lea    eax, [eax+eax*8];
			__asm        lea    eax, [eax+eax*8];
			__asm        add    eax, ecx;
			__asm        lea    eax, G_helidata[0].type[eax*2];
			__asm        cmp    eax, G_uheli;
			__asm        je     _T1ff;
		// LINE 653:
			__asm        mov    eax, i;
			__asm        mov    ecx, eax;
			__asm        lea    eax, [eax+eax*4];
			__asm        lea    eax, [eax+eax*8];
			__asm        lea    eax, [eax+eax*8];
			__asm        add    eax, ecx;
			__asm        mov    G_helidata[0].flags[eax*2], 0;
		// LINE 658:
		_T1ff:
			__asm        cmp    i, 2;
			__asm        jne    _T24e;
		// LINE 660:
			__asm        cmp    G_apachebase_found, 1;
			__asm        jne    _T24e;
		// LINE 664:
			__asm        mov    eax, G_helibase.apache_pad.y;
			__asm        push   eax;
			__asm        mov    eax, G_helibase.apache_pad.x;
			__asm        push   eax;
			__asm        mov    eax, i;
			__asm        mov    ecx, eax;
			__asm        lea    eax, [eax+eax*4];
			__asm        lea    eax, [eax+eax*8];
			__asm        lea    eax, [eax+eax*8];
			__asm        add    eax, ecx;
			__asm        lea    eax, G_helidata[0].type[eax*2];
			__asm        push   eax;
			__asm        call   S3HeliGenInit;
			__asm        add    esp, 0xC;
		// LINE 665:
			__asm        mov    eax, up;
			__asm        or     dword ptr [eax+0x44], 4;
		// LINE 666:
			__asm        jmp    _FOR_NEXT_1b4;
		// LINE 670:
		_T24e:
			__asm        mov    eax, up;
			__asm        mov    edx, 1;
			__asm        mov    cl, reinterpret_cast<uint8_t>(i);
			__asm        shl    edx, cl;
			__asm        test   [eax+0x44], edx;
			__asm        je     _T299;
		// LINE 672:
			pad = S3HeliGetFreePad();
		// LINE 673:
			__asm        mov    eax, pad;
			__asm        mov    eax, [eax+4];
			__asm        push   eax;
			__asm        mov    eax, pad;
			__asm        mov    eax, [eax];
			__asm        push   eax;
			__asm        mov    eax, i;
			__asm        mov    ecx, eax;
			__asm        lea    eax, [eax+eax*4];
			__asm        lea    eax, [eax+eax*8];
			__asm        lea    eax, [eax+eax*8];
			__asm        add    eax, ecx;
			__asm        lea    eax, G_helidata[0].type[eax*2];
			__asm        push   eax;
			__asm        call   S3HeliGenInit;
			__asm        add    esp, 0xC;
		// LINE 675:
		_T299:
	}
// LINE 692:
_T29e:
	return 0x1;
// LINE 693:
}

// FUNCTION: COPTER_D 0x004eb877
int32_t VRAppGameInit(void * __ptr32 miffReader) {
// LINE 706:
	__asm        cmp    miffReader, 0;
	__asm        je     _T75;
// LINE 711:
	S3HeliMIFFLoad(miffReader);
// LINE 712:
	S3MissileMIFFLoad(miffReader);
// LINE 713:
	S3FireMIFFLoad(miffReader);
// LINE 714:
	S3MissionMIFFLoad(miffReader);
// LINE 715:
	S3BoatMIFFLoad(miffReader);
// LINE 716:
	S3PlaneMIFFLoad(miffReader);
// LINE 717:
	S3TrainMIFFLoad(miffReader);
// LINE 718:
	S3AutoMIFFLoad(miffReader);
// LINE 720:
	__asm        jmp    _T75;
// LINE 724:
_T75:
	S3SetDayNight(G_daynight);
// LINE 725:
	return 0x1;
// LINE 726:
}

// FUNCTION: COPTER_D 0x004eb909
int32_t VRAppGameSave(void * __ptr32 miffWriter) {
// LINE 742:
	S3HeliMIFFSave(miffWriter);
// LINE 743:
	S3MissileMIFFSave(miffWriter);
// LINE 744:
	S3FireMIFFSave(miffWriter);
// LINE 745:
	S3MissionMIFFSave(miffWriter);
// LINE 746:
	S3BoatMIFFSave(miffWriter);
// LINE 747:
	S3PlaneMIFFSave(miffWriter);
// LINE 748:
	S3TrainMIFFSave(miffWriter);
// LINE 749:
	S3AutoMIFFSave(miffWriter);
// LINE 751:
	return 0x1;
// LINE 752:
}

// FUNCTION: COPTER_D 0x004eb97e
void VRAppDeInit() {
// LINE 770:
	S3PersonDelete();
// LINE 771:
	S2AllocFreePool(G_citymempool);
// LINE 772:
	S2AllocFreePool(G_dyobjmempool);
// LINE 773:
}

// FUNCTION: COPTER_D 0x004eb9aa
void VRAppNextFrame() {
// LINE 791:
	G_AvLoopTime = ((((G_AvLoopTime << 0x3) - G_AvLoopTime) + LoopTime) >> 0x3);
// LINE 792:
	G_framectr++;
// LINE 805:
	G_maptics++;
// LINE 806:
	__asm        test   reinterpret_cast<uint8_t>(G_maptics), 1;
	__asm        je     _Tb4;
// LINE 807:
	__asm        cmp    G_camera_mode, 3;
	__asm        je     _T98;
// LINE 808:
	__asm        cmp    G_mapmode, 1;
	__asm        jne    _T79;
// LINE 809:
	S3CityDrawOverHeadGrid();
// LINE 810:
	S3MapDrawPosLines(G_uheli->currpos.x, G_uheli->currpos.y);
// LINE 812:
	__asm        jmp    _T93;
// LINE 813:
_T79:
	S3MapRender(G_uheli->currpos.x, G_uheli->currpos.y);
// LINE 815:
_T93:
	__asm        jmp    _Tb4;
// LINE 816:
_T98:
	__asm        call   GetAvatarCellY;
	__asm        xor    ecx, ecx;
	__asm        mov    cl, al;
	__asm        push   ecx;
	__asm        call   GetAvatarCellX;
	__asm        xor    ecx, ecx;
	__asm        mov    cl, al;
	__asm        push   ecx;
	__asm        call   S3MapRender;
	__asm        add    esp, 8;
// LINE 837:
_Tb4:
	__asm        cmp    G_camera_mode, 3;
	__asm        je     _Td9;
// LINE 838:
	S3HeliNextFrame(G_uheli);
// LINE 839:
	S3PersonUserNextFrame();
// LINE 841:
	__asm        jmp    _Tde;
// LINE 842:
_Td9:
	S3PersonUserNextFrame();
// LINE 845:
_Tde:
	S3MissionGenerator();
// LINE 851:
	S3FireDriver();
// LINE 855:
	S3AutoSoundDistReset();
// LINE 856:
	ItterateAllAutomobiles();
// LINE 857:
	S3AutoSoundDriver();
// LINE 862:
	ItterateAllTrains();
// LINE 865:
	ItterateAllPlanes();
// LINE 868:
	ItterateAllBoats();
// LINE 872:
	S3HeliTestCopter(G_testheli);
// LINE 875:
	S3HeliNextFrameDriver();
// LINE 877:
	S3MissileDriver();
// LINE 879:
	S3PersonNextFrame();
// LINE 882:
	S3ExplosionDriver();
// LINE 884:
	S3CityGrid();
// LINE 905:
	return;
// LINE 906:
}

// FUNCTION: COPTER_D 0x004ebae1
void VRAppNewTextures() {
// LINE 924:
}

// FUNCTION: COPTER_D 0x004ebaec
void SetUserVars(int32_t * user) {
// LINE 941:
	rFriction = user[0];
// LINE 942:
	rForce = user[4];
// LINE 943:
	rVmax = user[8];
// LINE 945:
	tFrictionAir = user[12];
// LINE 946:
	tFrictionGnd = user[16];
// LINE 947:
	tVmax = user[20];
// LINE 949:
	keyRotateXp = (user[56] >> 0x10);
// LINE 950:
	keyRotateXm = (user[60] >> 0x10);
// LINE 951:
	keyRotateZp = (user[72] >> 0x10);
// LINE 952:
	keyRotateZm = (user[76] >> 0x10);
// LINE 954:
	thetaspeed = user[40];
// LINE 955:
	phispeed = user[44];
// LINE 956:
	radius = user[48];
// LINE 957:
	circley = user[52];
// LINE 958:
	yposcilate = user[56];
// LINE 959:
	ynoscilate = user[60];
// LINE 962:
}



// Contribution: 2:00003470-0000367f Module: 179, 8 byte alignment, initialized_data, read, 
// GLOBAL: COPTER_D 0x00592470
static const int32_t TurnTable3[4][8] = {{0, 1, 2, 3, 4, 5, 6, 7}, {2, 3, 4, 5, 6, 7, 0, 1}, {6, 7, 0, 1, 2, 3, 4, 5}, {4, 5, 6, 7, 0, 1, 2, 3}};

// GLOBAL: COPTER_D 0x005924f0
static const int32_t TurnTable2[4][4] = {{0, 1, 2, 3}, {1, 2, 3, 0}, {3, 0, 1, 2}, {2, 3, 0, 1}};

// GLOBAL: COPTER_D 0x00592530
static const int32_t IndexToType[4] = {1, 2, 4, 8};

// GLOBAL: COPTER_D 0x00592540
static const int32_t TypeToIndex2[16] = {-1, 0, 1, -1, 2, -1, -1, -1, 3, -1, -1, -1, -1, -1, -1, -1};

// GLOBAL: COPTER_D 0x00592580
static const int32_t TILUT[4][4] = {{0, 1, 3, 2}, {2, 0, 1, 3}, {3, 2, 0, 1}, {1, 3, 2, 0}};

// GLOBAL: COPTER_D 0x005925c0
static const /*packed*/ struct _dPoint2d OT[4] = { 0 /* todo */ };

// GLOBAL: COPTER_D 0x00592600
static const /*packed*/ struct _dPoint2d RRT[4] = { 0 /* todo */ };

// GLOBAL: COPTER_D 0x00592640
static const /*packed*/ struct _dPoint2d LRT[4] = { 0 /* todo */ };



// Contribution: 3:0001d744-0001d876 Module: 179, 4 byte alignment, initialized_data, read, write, 
// GLOBAL: COPTER_D 0x005b4744
int32_t keyRotateXp = 0;

// GLOBAL: COPTER_D 0x005b4748
int32_t keyRotateXm = 0;

// GLOBAL: COPTER_D 0x005b474c
int32_t keyRotateYp = 0;

// GLOBAL: COPTER_D 0x005b4750
int32_t keyRotateYm = 0;

// GLOBAL: COPTER_D 0x005b4754
int32_t keyRotateZp = 0;

// GLOBAL: COPTER_D 0x005b4758
int32_t keyRotateZm = 0;

// GLOBAL: COPTER_D 0x005b475c
int32_t LoopTimer = 0;

// GLOBAL: COPTER_D 0x005b4760
int32_t LoopTime = 0;

// GLOBAL: COPTER_D 0x005b4764
int32_t AlwaysTimer = 0;

// GLOBAL: COPTER_D 0x005b4768
int32_t G_AvLoopTime = 0;

// GLOBAL: COPTER_D 0x005b476c
/*packed*/ struct VRResource *G_restex = { 0 /* todo */ };
// has alternate definitions: (original TI: 0x10f4)
//   /*unpacked*/ struct VRResource *G_restex (TI: 0x34b0)

// GLOBAL: COPTER_D 0x005b4770
/*packed*/ struct VRResource *G_respal = { 0 /* todo */ };

// GLOBAL: COPTER_D 0x005b4774
/*packed*/ struct VRResource *G_resgeo1 = { 0 /* todo */ };

// GLOBAL: COPTER_D 0x005b4778
/*packed*/ struct VRResource *G_resgeo2 = { 0 /* todo */ };

// GLOBAL: COPTER_D 0x005b477c
/*packed*/ struct VRResource *G_resgeo3 = { 0 /* todo */ };

// GLOBAL: COPTER_D 0x005b4780
/*packed*/ struct VRMemPool *G_main_mp = { 0 /* todo */ };
// has alternate definitions: (original TI: 0x2420)
//   /*unpacked*/ struct VRMemPool *G_main_mp (TI: 0x3e11)

// GLOBAL: COPTER_D 0x005b4784
char * buffer = { 0 /* todo */ };

// GLOBAL: COPTER_D 0x005b4788
long G_framectr = 0;

// GLOBAL: COPTER_D 0x005b478c
long G_maptics = 0;

// GLOBAL: COPTER_D 0x005b4790
long G_InitializationProgress = 0;

// GLOBAL: COPTER_D 0x005b4794
long G_VRAppInitCalled = 0;



// Unknown globals:
// The PDB was slightly corrupted and we aren't sure which file these globals belong to.

// WARNING: this global might actually belong to: C:\Copter\source\sparkal\gameapp1.cpp
// GLOBAL: COPTER_D 0x0063a858
int32_t MainPoolIndex; // Contrib missing


// WARNING: this global might actually belong to: C:\Copter\source\sparkal\gameapp1.cpp
// GLOBAL: COPTER_D 0x0063a854
int32_t ScratchPoolIndex; // Contrib missing

// GLOBAL: COPTER_D 0x006bf1d0
/*packed*/ struct _HELI_DATA G_helidata[10]; // Contrib missing

