// Module: S3terr.obj
// Source: C:\Copter\source\game\S3terr.c
// autogenerated by simcopter_tool from PDB file

// Type: unsigned short *;

// Type: unsigned short;

// Type: short;

// Type: int32_t;

// Type: long;

// Type: void;

// Type: unsigned char;

// Type: int32_t *;

// Type: /*packed*/ struct Point2d;
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: short *;

// Type: /*packed*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // packed(0x18 bytes) TI: 0x1b03
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*packed*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*packed*/ struct _DYOBJ_INST *vwptr;
};

// Type: /*packed*/ struct _STOBJ_INST (forward reference);
struct _STOBJ_INST{ // packed(0x10 bytes) TI: 0x193f
	/*+0x0*/   /*packed*/ struct _STOBJ_INST *next;
	/*+0x4*/   void * __ptr32 mesh;
	/*+0x8*/   long user1;
	/*+0xc*/   long user2;
};



// Contribution: 1:00112d50-00117f8b Module: 169, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00513d50
short GetAltitude(int32_t x, int32_t y) {
	/*bp-0x4*/   short wat;
	/*bp-0x8*/   short alt;

// LINE 96:
	__asm        cmp    x, 0;
	__asm        jl     _T1d;

	__asm        cmp    y, 0;
	__asm        jge    _T25;
// LINE 97:
_T1d:
	return 0x0;
// LINE 98:
_T25:
	__asm        cmp    x, 0x80;
	__asm        jge    _T3f;

	__asm        cmp    y, 0x80;
	__asm        jl     _T47;
// LINE 99:
_T3f:
	return 0x0;
// LINE 100:
_T47:
	__asm        mov    eax, x;
	__asm        mov    eax, AltMap[eax*4];
	__asm        mov    ecx, y;
	__asm        xor    edx, edx;
	__asm        mov    dx, [eax+ecx*2];
	__asm        and    edx, 0x1F;
	__asm        mov    alt, dx;
// LINE 101:
	__asm        mov    eax, x;
	__asm        mov    eax, AltMap[eax*4];
	__asm        mov    ecx, y;
	__asm        xor    edx, edx;
	__asm        mov    dx, [eax+ecx*2];
