// Module: S3train.obj
// Source: C:\Copter\Source\Game\S3train.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct CONNECTION_INFO_TYPE (forward reference);
struct CONNECTION_INFO_TYPE{ // packed(0x8 bytes) TI: 0x30c5
	/*+0x0*/   enum RailTypes tile;
	/*+0x4*/   enum DirectionTypes connections;
};

// Type: /*packed*/ struct Point2d;
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ class TrainClass;
// VTABLE: COPTER_D 0x00593238
class TrainClass{ // packed(0x1d9 bytes) TI: 0x42ad
	enum /* __unnamed */ {
		TRAIN_TYPES = 1,
		PERCENTAGE_OF_TRAIN1 = 100,
		TOTAL_PERCENTAGE = 100,
	};
	enum /* __unnamed */ {
		NO_X_POSITION = -1,
		STARTING_X = 3,
		ENDING_X = 125,
		NO_Y_POSITION = -1,
		STARTING_Y = 3,
		ENDING_Y = 125,
	};
	enum IntersectionTypes {
		DEAD_END = 0,
		STRAIGHT_AHEAD = 1,
		LEFT_ONLY = 2,
		RIGHT_ONLY = 4,
		LEFT_OR_STRAIGHT = 3,
		LEFT_OR_RIGHT = 6,
		RIGHT_OR_STRAIGHT = 5,
		LEFT_STRAIGHT_OR_RIGHT = 7,
	};
	enum StoppedReasons {
		NO_REASON = 0,
		TRAFFIC = 1,
		STOPPED_TRAFFIC = 2,
		PERSON_IN_WAY = 3,
		END_OF_RAIL = 4,
		INTERSECTION_FULL = 5,
	};
	enum RailTileOffsets {
		RL_CENTOFF = 0,
		RL_EDGEOFF = 131072,
	};
	enum /* __unnamed */ {
		COLLISION_SPACE = 655360,
		RAIL_SPEED = 5898240,
		RAIL_SLOWDOWN_FACTOR = 131072,
		SPEED_VARIANCE = 262144,
		MAX_TIME_TO_WAIT_FOR_TRAFFIC = 1310720,
		MAX_TIME_TO_WAIT_PULLED_OVER = 196608,
		MAX_TIME_TO_WAIT_BEFORE_BEAMING = 235,
	};
	enum flagEnums {
		INITIALIZED = 0,
		PLACED = 1,
		TURNING = 2,
		IN_INTERSECTION = 3,
		MAKING_UTURN = 4,
		AT_DEAD_END = 5,
		CRASH_WHEN_READY = 6,
		CRASHING = 7,
		ON_RESCUE = 8,
		NUMBER_OF_FLAGS = 9,
	};
private:
	static /*packed*/ struct Point2d lastScannedLocation;
	static /*packed*/ class TrainClass lsTrain;
	/*+0x4*/   char flags[9]; // 0x9 bytes
	/*+0xd*/   int32_t stalledTimer;
	/*+0x11*/  enum DirectionTypes direction;
	/*+0x15*/  /*packed*/ struct Point3d directionVector; // 0xc bytes
	/*+0x21*/  int32_t remainingDist;
	/*+0x25*/  int32_t remainingTime;
	/*+0x29*/  enum DirectionTypes utdirection;
	/*+0x2d*/  int32_t speed;
	/*+0x31*/  int32_t desiredSpeed;
	/*+0x35*/  /*packed*/ struct Point2d currentLocation1; // 0x8 bytes
	/*+0x3d*/  /*packed*/ struct Point2d currentLocation2; // 0x8 bytes
	/*+0x45*/  /*packed*/ struct Point2d currentLocation3; // 0x8 bytes
	/*+0x4d*/  /*packed*/ struct Point2d currentCell; // 0x8 bytes
	/*+0x55*/  /*packed*/ struct Point2d nextLocation; // 0x8 bytes
	/*+0x5d*/  int32_t beamDelay;
	/*+0x61*/  int32_t beamTimer;
	/*+0x65*/  long utRotation;
	/*+0x69*/  long missionId;
	/*+0x6d*/  int32_t smokeTime;
	/*+0x71*/  int32_t timeToLive;
	/*+0x75*/  /*packed*/ struct Point2d northCell; // 0x8 bytes
	/*+0x7d*/  /*packed*/ struct Point2d southCell; // 0x8 bytes
	/*+0x85*/  /*packed*/ struct Point2d eastCell; // 0x8 bytes
	/*+0x8d*/  /*packed*/ struct Point2d westCell; // 0x8 bytes
protected:
	/*+0x95*/  long trainModel1;
	/*+0x99*/  long trainModel2;
	/*+0x9d*/  long trainModel3;
	/*+0xa1*/  /*packed*/ struct _DYOBJ_INST dyObj1; // 0x64 bytes
	/*+0x105*/ /*packed*/ struct _DYOBJ_INST dyObj2; // 0x64 bytes
	/*+0x169*/ /*packed*/ struct _DYOBJ_INST dyObj3; // 0x64 bytes
	/*+0x1cd*/ /*packed*/ struct _DYOBJ_INST *leadcar;
	/*+0x1d1*/ /*packed*/ struct _DYOBJ_INST *midcar;
	/*+0x1d5*/ /*packed*/ struct _DYOBJ_INST *endcar;
public:
	void TrainClass(const /*packed*/ class TrainClass&);
	void TrainClass(long, long);
	void TrainClass();
	virtual void ~TrainClass(); // vtable+0x0
	// calltype: NearC
	static /*packed*/ class TrainClass* CreateInstance(long, long, int32_t);
	// calltype: NearC
	static /*packed*/ class TrainClass* CreateInstance(int32_t);
	// calltype: NearC
	static /*packed*/ class TrainClass* GetTrainPointer(long);
	// calltype: NearC
	static int32_t MIFFLoad(void * __ptr32);
	// calltype: NearC
	static int32_t MIFFSave(void * __ptr32);
	// calltype: NearC
	static void ItterateAll();
	// calltype: NearC
	static void ResetAll();
	// calltype: NearC
	static int32_t FindTrainToCrash(long);
	// calltype: NearC
	static int32_t FindTrainForRescue(long, int32_t);
protected:
	int32_t IsTrainInitialized();
	int32_t IsTrainPlaced();
	int32_t IsTrainAtDeadEnd();
	int32_t IsTrainTurning();
	int32_t IsTrainInIntersection();
	int32_t IsTrainMakingUturn();
	int32_t IsTrainMoving();
	int32_t IsTrainReadyToCrash();
	int32_t IsTrainCrashing();
	int32_t IsTrainOnRescue();
	long GetTrainModel();
	const const /*packed*/ struct _DYOBJ_INST* GetTrainDyObj();
	enum DirectionTypes GetDirection();
	int32_t AmIMovingNorth();
	int32_t AmIMovingSouth();
	int32_t AmIMovingEast();
	int32_t AmIMovingWest();
	const /*packed*/ struct Point3d& GetDirectionVector();
	int32_t GetSpeed();
	int32_t GetDesiredSpeed();
	const /*packed*/ struct Point2d& GetCurrentLocation1();
	const /*packed*/ struct Point2d& GetCurrentLocation2();
	const /*packed*/ struct Point2d& GetCurrentLocation3();
	const /*packed*/ struct Point2d& GetNextLocation();
	void SetCurrentLocation1(/*packed*/ struct Point2d&);
	void SetCurrentLocation2(/*packed*/ struct Point2d&);
	void SetCurrentLocation3(/*packed*/ struct Point2d&);
	void SetTrainReadyToCrash(long);
	int32_t CanTrainBePlacedOnTile(unsigned short);
	void SetSpeed(int32_t);
	int32_t Initialize(int32_t);
	void Itterate();
	virtual void ItterateFSM(); // vtable+0x4
	virtual void AdjustSpeed(); // vtable+0x8
	virtual enum TrainClass::StoppedReasons IsPathClear(); // vtable+0xc
	enum TrainClass::StoppedReasons CheckDynamicObjectsAt(const /*packed*/ struct Point2d&, const /*packed*/ struct Point3d&);
	int32_t IsTrainOutOfCameraRange();
	void SetTrainDirection(unsigned short);
	int32_t CheckForStop(short, short);
	int32_t FinishedUturn();
	void SlowDown();
	void Stop();
	void MoveForward();
	int32_t HaveIReachedNextLoc();
	int32_t AmIInANewCell();
	int32_t IsAnythingThere(const /*packed*/ struct Point2d&, /*packed*/ struct mv);
	void UnlinkFromCell(const /*packed*/ struct Point2d&, /*packed*/ struct _DYOBJ_INST*);
	void LinkToCell(const /*packed*/ struct Point2d&, /*packed*/ struct _DYOBJ_INST*);
	int32_t IsLocationAnIntersection(/*packed*/ struct Point2d&);
	virtual enum TrainClass::IntersectionTypes PickTurnDirection(const /*packed*/ struct Point2d&); // vtable+0x10
	int32_t DoRailTilesConnect(unsigned short, unsigned short, enum DirectionTypes);
	void MakeATurn(enum TrainClass::IntersectionTypes);
	void GetNewPredictedLocation();
	void AdjustCurrentPosition();
	void AdjustNextPosition();
	enum TrainClass::StoppedReasons WhyAmIStopped();
	void GoStraight();
	void MakeUturn();
	void TurnLeft();
	void TurnRight();
	void UnPlaceTrain();
	void SetTrailingCars();
	void AdjustTrailingCars();
	void SetCrashWhenReady();
	void TrainCrashMovement();
	void TrainSoundDriver();
	void Reset();
	int32_t SetTrainForRescue(long, int32_t);
	// calltype: NearC
	static void InitArrays();
	// calltype: NearC
	static void SetTrainTypesAndLocations();
	// calltype: NearC
	static void PlaceInitialTrains();
	virtual void BeamToWithinCameraRange(); // vtable+0x14
	virtual int32_t BeamToLocation(long, long); // vtable+0x18
private:
	int32_t InitializeInstance(long, long, int32_t);
public:
	/*packed*/ class TrainClass operator=(const /*packed*/ class TrainClass&);
};

// Type: /*packed*/ class TrainClass (forward reference);
// VTABLE: COPTER_D 0x00593238
class TrainClass{ // packed(0x1d9 bytes) TI: 0x42ad
	enum /* __unnamed */ {
		TRAIN_TYPES = 1,
		PERCENTAGE_OF_TRAIN1 = 100,
		TOTAL_PERCENTAGE = 100,
	};
	enum /* __unnamed */ {
		NO_X_POSITION = -1,
		STARTING_X = 3,
		ENDING_X = 125,
		NO_Y_POSITION = -1,
		STARTING_Y = 3,
		ENDING_Y = 125,
	};
	enum IntersectionTypes {
		DEAD_END = 0,
		STRAIGHT_AHEAD = 1,
		LEFT_ONLY = 2,
		RIGHT_ONLY = 4,
		LEFT_OR_STRAIGHT = 3,
		LEFT_OR_RIGHT = 6,
		RIGHT_OR_STRAIGHT = 5,
		LEFT_STRAIGHT_OR_RIGHT = 7,
	};
	enum StoppedReasons {
		NO_REASON = 0,
		TRAFFIC = 1,
		STOPPED_TRAFFIC = 2,
		PERSON_IN_WAY = 3,
		END_OF_RAIL = 4,
		INTERSECTION_FULL = 5,
	};
	enum RailTileOffsets {
		RL_CENTOFF = 0,
		RL_EDGEOFF = 131072,
	};
	enum /* __unnamed */ {
		COLLISION_SPACE = 655360,
		RAIL_SPEED = 5898240,
		RAIL_SLOWDOWN_FACTOR = 131072,
		SPEED_VARIANCE = 262144,
		MAX_TIME_TO_WAIT_FOR_TRAFFIC = 1310720,
		MAX_TIME_TO_WAIT_PULLED_OVER = 196608,
		MAX_TIME_TO_WAIT_BEFORE_BEAMING = 235,
	};
	enum flagEnums {
		INITIALIZED = 0,
		PLACED = 1,
		TURNING = 2,
		IN_INTERSECTION = 3,
		MAKING_UTURN = 4,
		AT_DEAD_END = 5,
		CRASH_WHEN_READY = 6,
		CRASHING = 7,
		ON_RESCUE = 8,
		NUMBER_OF_FLAGS = 9,
	};
private:
	static /*packed*/ struct Point2d lastScannedLocation;
	static /*packed*/ class TrainClass lsTrain;
	/*+0x4*/   char flags[9]; // 0x9 bytes
	/*+0xd*/   int32_t stalledTimer;
	/*+0x11*/  enum DirectionTypes direction;
	/*+0x15*/  /*packed*/ struct Point3d directionVector; // 0xc bytes
	/*+0x21*/  int32_t remainingDist;
	/*+0x25*/  int32_t remainingTime;
	/*+0x29*/  enum DirectionTypes utdirection;
	/*+0x2d*/  int32_t speed;
	/*+0x31*/  int32_t desiredSpeed;
	/*+0x35*/  /*packed*/ struct Point2d currentLocation1; // 0x8 bytes
	/*+0x3d*/  /*packed*/ struct Point2d currentLocation2; // 0x8 bytes
	/*+0x45*/  /*packed*/ struct Point2d currentLocation3; // 0x8 bytes
	/*+0x4d*/  /*packed*/ struct Point2d currentCell; // 0x8 bytes
	/*+0x55*/  /*packed*/ struct Point2d nextLocation; // 0x8 bytes
	/*+0x5d*/  int32_t beamDelay;
	/*+0x61*/  int32_t beamTimer;
	/*+0x65*/  long utRotation;
	/*+0x69*/  long missionId;
	/*+0x6d*/  int32_t smokeTime;
	/*+0x71*/  int32_t timeToLive;
	/*+0x75*/  /*packed*/ struct Point2d northCell; // 0x8 bytes
	/*+0x7d*/  /*packed*/ struct Point2d southCell; // 0x8 bytes
	/*+0x85*/  /*packed*/ struct Point2d eastCell; // 0x8 bytes
	/*+0x8d*/  /*packed*/ struct Point2d westCell; // 0x8 bytes
protected:
	/*+0x95*/  long trainModel1;
	/*+0x99*/  long trainModel2;
	/*+0x9d*/  long trainModel3;
	/*+0xa1*/  /*packed*/ struct _DYOBJ_INST dyObj1; // 0x64 bytes
	/*+0x105*/ /*packed*/ struct _DYOBJ_INST dyObj2; // 0x64 bytes
	/*+0x169*/ /*packed*/ struct _DYOBJ_INST dyObj3; // 0x64 bytes
	/*+0x1cd*/ /*packed*/ struct _DYOBJ_INST *leadcar;
	/*+0x1d1*/ /*packed*/ struct _DYOBJ_INST *midcar;
	/*+0x1d5*/ /*packed*/ struct _DYOBJ_INST *endcar;
public:
	void TrainClass(const /*packed*/ class TrainClass&);
	void TrainClass(long, long);
	void TrainClass();
	virtual void ~TrainClass(); // vtable+0x0
	// calltype: NearC
	static /*packed*/ class TrainClass* CreateInstance(long, long, int32_t);
	// calltype: NearC
	static /*packed*/ class TrainClass* CreateInstance(int32_t);
	// calltype: NearC
	static /*packed*/ class TrainClass* GetTrainPointer(long);
	// calltype: NearC
	static int32_t MIFFLoad(void * __ptr32);
	// calltype: NearC
	static int32_t MIFFSave(void * __ptr32);
	// calltype: NearC
	static void ItterateAll();
	// calltype: NearC
	static void ResetAll();
	// calltype: NearC
	static int32_t FindTrainToCrash(long);
	// calltype: NearC
	static int32_t FindTrainForRescue(long, int32_t);
protected:
	int32_t IsTrainInitialized();
	int32_t IsTrainPlaced();
	int32_t IsTrainAtDeadEnd();
	int32_t IsTrainTurning();
	int32_t IsTrainInIntersection();
	int32_t IsTrainMakingUturn();
	int32_t IsTrainMoving();
	int32_t IsTrainReadyToCrash();
	int32_t IsTrainCrashing();
	int32_t IsTrainOnRescue();
	long GetTrainModel();
	const const /*packed*/ struct _DYOBJ_INST* GetTrainDyObj();
	enum DirectionTypes GetDirection();
	int32_t AmIMovingNorth();
	int32_t AmIMovingSouth();
	int32_t AmIMovingEast();
	int32_t AmIMovingWest();
	const /*packed*/ struct Point3d& GetDirectionVector();
	int32_t GetSpeed();
	int32_t GetDesiredSpeed();
	const /*packed*/ struct Point2d& GetCurrentLocation1();
	const /*packed*/ struct Point2d& GetCurrentLocation2();
	const /*packed*/ struct Point2d& GetCurrentLocation3();
	const /*packed*/ struct Point2d& GetNextLocation();
	void SetCurrentLocation1(/*packed*/ struct Point2d&);
	void SetCurrentLocation2(/*packed*/ struct Point2d&);
	void SetCurrentLocation3(/*packed*/ struct Point2d&);
	void SetTrainReadyToCrash(long);
	int32_t CanTrainBePlacedOnTile(unsigned short);
	void SetSpeed(int32_t);
	int32_t Initialize(int32_t);
	void Itterate();
	virtual void ItterateFSM(); // vtable+0x4
	virtual void AdjustSpeed(); // vtable+0x8
	virtual enum TrainClass::StoppedReasons IsPathClear(); // vtable+0xc
	enum TrainClass::StoppedReasons CheckDynamicObjectsAt(const /*packed*/ struct Point2d&, const /*packed*/ struct Point3d&);
	int32_t IsTrainOutOfCameraRange();
	void SetTrainDirection(unsigned short);
	int32_t CheckForStop(short, short);
	int32_t FinishedUturn();
	void SlowDown();
	void Stop();
	void MoveForward();
	int32_t HaveIReachedNextLoc();
	int32_t AmIInANewCell();
	int32_t IsAnythingThere(const /*packed*/ struct Point2d&, /*packed*/ struct mv);
	void UnlinkFromCell(const /*packed*/ struct Point2d&, /*packed*/ struct _DYOBJ_INST*);
	void LinkToCell(const /*packed*/ struct Point2d&, /*packed*/ struct _DYOBJ_INST*);
	int32_t IsLocationAnIntersection(/*packed*/ struct Point2d&);
	virtual enum TrainClass::IntersectionTypes PickTurnDirection(const /*packed*/ struct Point2d&); // vtable+0x10
	int32_t DoRailTilesConnect(unsigned short, unsigned short, enum DirectionTypes);
	void MakeATurn(enum TrainClass::IntersectionTypes);
	void GetNewPredictedLocation();
	void AdjustCurrentPosition();
	void AdjustNextPosition();
	enum TrainClass::StoppedReasons WhyAmIStopped();
	void GoStraight();
	void MakeUturn();
	void TurnLeft();
	void TurnRight();
	void UnPlaceTrain();
	void SetTrailingCars();
	void AdjustTrailingCars();
	void SetCrashWhenReady();
	void TrainCrashMovement();
	void TrainSoundDriver();
	void Reset();
	int32_t SetTrainForRescue(long, int32_t);
	// calltype: NearC
	static void InitArrays();
	// calltype: NearC
	static void SetTrainTypesAndLocations();
	// calltype: NearC
	static void PlaceInitialTrains();
	virtual void BeamToWithinCameraRange(); // vtable+0x14
	virtual int32_t BeamToLocation(long, long); // vtable+0x18
private:
	int32_t InitializeInstance(long, long, int32_t);
public:
	/*packed*/ class TrainClass operator=(const /*packed*/ class TrainClass&);
};

// Type: void ();

// Type: void;

// Type: long;

// Type: int32_t;

// Type: /*packed*/ struct VRview;
struct VRview{ // packed(0x58 bytes) TI: 0x2ecc
	/*+0x0*/   /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0xc*/   /*packed*/ struct Point3d scale; // 0xc bytes
	/*+0x18*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct _MISSION_PARMS;
struct _MISSION_PARMS{ // packed(0x18 bytes) TI: 0x307d
	/*+0x0*/   long op;
	/*+0x4*/   long id;
	/*+0x8*/   /*packed*/ struct Point2d maploc; // 0x8 bytes
	/*+0x10*/  long i2num;
	/*+0x14*/  long flags;
};

// Type: /*packed*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // packed(0x18 bytes) TI: 0x1b03
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*packed*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*packed*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*packed*/ struct _DYOBJ_INST *vwptr;
};

// Type: enum TrainClass::StoppedReasons;
enum StoppedReasons {
	NO_REASON = 0,
	TRAFFIC = 1,
	STOPPED_TRAFFIC = 2,
	PERSON_IN_WAY = 3,
	END_OF_RAIL = 4,
	INTERSECTION_FULL = 5,
};

// Type: /*packed*/ struct Point2d (forward reference);
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: unsigned short;

// Type: /*packed*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // packed(0x64 bytes) TI: 0x1deb
	/*+0x0*/   /*packed*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*packed*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*packed*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: enum TrainClass::IntersectionTypes;
enum IntersectionTypes {
	DEAD_END = 0,
	STRAIGHT_AHEAD = 1,
	LEFT_ONLY = 2,
	RIGHT_ONLY = 4,
	LEFT_OR_STRAIGHT = 3,
	LEFT_OR_RIGHT = 6,
	RIGHT_OR_STRAIGHT = 5,
	LEFT_STRAIGHT_OR_RIGHT = 7,
};

// Type: enum DirectionTypes;
enum DirectionTypes {
	NO_DIRECTION = 0,
	NORTH = 1,
	EAST = 2,
	SOUTH = 4,
	WEST = 8,
	RISING = 16,
	RISING_NORTH = 17,
	RISING_SOUTH = 20,
	RISING_EAST = 18,
	RISING_WEST = 24,
	NORTH_EAST = 3,
	SOUTH_EAST = 6,
	SOUTH_WEST = 12,
	NORTH_WEST = 9,
};

// Type: /*packed*/ struct VRObjInfo;
struct VRObjInfo{ // packed(0x24 bytes) TI: 0x2ea8
	/*+0x0*/   int32_t Faces;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Radius;
	/*+0x10*/  /*packed*/ struct Point3d *ObjCenter;
	/*+0x14*/  /*packed*/ struct Point3d *VertsPtr;
	/*+0x18*/  /*packed*/ struct Xform3d *VertsXfm;
	/*+0x1c*/  /*packed*/ struct Point3d *OrgVerts;
	/*+0x20*/  int32_t *Matrix[4][4];
};

// Type: short;

// Type: void * __ptr32;

// Type: uint32_t;



// Contribution: 1:0012cda0-00133970 Module: 162, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x0052dda0
static void $E7() {

	$E3();
	$E6();
	__asm        jmp    __RETURN;
__RETURN:
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x0052ddba
static void $E3() {

	TrainClass::lsTrain<vftable> = 0x593238;
	__asm        jmp    _T15;
_T15:
	return;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x0052ddd9
static void $E6() {

	atexit(0x52ddf6);
	__asm        jmp    __RETURN;
__RETURN:
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x0052ddf6
static void $E4() {

	__asm        xor    eax, eax;
	__asm        mov    al, ds:[0x62B998];
	__asm        test   al, 1;
	__asm        jne    _T2d;

	__asm        xor    eax, eax;
	__asm        mov    al, ds:[0x62B998];
	__asm        or     al, 1;
	__asm        mov    ds:[0x62B998], al;
