// Module: S3user.obj
// Source: C:\Copter\Source\Game\S3user.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct tagCareerCityInfo (forward reference);
struct tagCareerCityInfo{ // packed(0x48 bytes) TI: 0x26ee
	/*+0x0*/   long lCityLevel;
	/*+0x4*/   /*packed*/ struct tagCitySettings citySettings; // 0x24 bytes
	/*+0x28*/  long lNextCities[3]; // 0xc bytes
	/*+0x34*/  long lPrevCities[3]; // 0xc bytes
	/*+0x40*/  long lCityNameStringIndex;
	/*+0x44*/  char * chCityFileNameBase;
};

// Type: /*packed*/ struct tagCurrentCareerCityInfo;
struct tagCurrentCareerCityInfo{ // packed(0x6c bytes) TI: 0x26e5
	/*+0x0*/   long lCurrentCities[3]; // 0xc bytes
	/*+0xc*/   long lCurrentCityIndex;
	/*+0x10*/  long bUserHasSavedGame;
	/*+0x14*/  /*packed*/ struct tagUserPersonalInfo userPersonalInfo; // 0x58 bytes
};

// Type: /*packed*/ struct GraduationState;
struct GraduationState{ // packed(0x14 bytes) TI: 0x485c
	/*+0x0*/   int32_t nGraduationState;
	/*+0x4*/   /*packed*/ class MTimer timerGraduationState; // 0x10 bytes
	void GraduationState();
	void Reset();
	void MoveToNewState(int32_t);
};

// Type: long;

// Type: char;

// Type: void ();

// Type: char *;

// Type: /*packed*/ struct tagUserCityInfo;
struct tagUserCityInfo{ // packed(0x80 bytes) TI: 0x2b80
	/*+0x0*/   /*packed*/ struct tagCitySettings citySettings; // 0x24 bytes
	/*+0x24*/  long bUserHasSavedGame;
	/*+0x28*/  /*packed*/ struct tagUserPersonalInfo userPersonalInfo; // 0x58 bytes
};

// Type: void;

// Type: /*packed*/ struct tagUserPersonalInfo (forward reference);
struct tagUserPersonalInfo{ // packed(0x58 bytes) TI: 0x1a2a
	/*+0x0*/   char szUserName[64]; // 0x40 bytes
	/*+0x40*/  long lMoney;
	/*+0x44*/  long lHelicopters;
	/*+0x48*/  long lEquipment;
	/*+0x4c*/  long lTrophies;
	/*+0x50*/  long lPoints;
	/*+0x54*/  long lTeargasCount;
};

// Type: /*packed*/ struct tagCitySettings (forward reference);
struct tagCitySettings{ // packed(0x24 bytes) TI: 0x26eb
	/*+0x0*/   long lDifficulty;
	/*+0x4*/   long lMissionFrequencyFire;
	/*+0x8*/   long lMissionFrequencyCrime;
	/*+0xc*/   long lMissionFrequencyRescue;
	/*+0x10*/  long lMissionFrequencyRiot;
	/*+0x14*/  long lMissionFrequencyTraffic;
	/*+0x18*/  long lMissionFrequencyMedEvac;
	/*+0x1c*/  long lMissionFrequencyTransport;
	/*+0x20*/  long lDaytime;
};

// Type: int32_t;

// Type: int32_t *;



// Contribution: 1:00027e80-000294ea Module: 67, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00428e80
static void $E48() {

	__asm        call   $E45;
	__asm        call   $E47;
	__asm        jmp    __RETURN;
__RETURN:
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00428e9a
static void $E45() {

	__asm        mov    gGraduationState.timerGraduationState.nTimerResolution, 1;
	__asm        mov    gGraduationState.timerGraduationState.lStartTime, 0;
	__asm        mov    gGraduationState.timerGraduationState.lTotalElapsedTime, 0;
	__asm        mov    gGraduationState.timerGraduationState.lFrequency, 0;
	__asm        cmp    gGraduationState.timerGraduationState.nTimerResolution, 0;
	__asm        jne    _T5b;

	__asm        lea    eax, [ebp-0xC];
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3668];
	__asm        mov    eax, [ebp-0xC];
