// Module: Lighting.obj
// Source: C:\Copter\source\engine\Lighting.c
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct COLOR_SHADE (forward reference);
struct COLOR_SHADE{ // packed(0x8 bytes) TI: 0x2eb5
	/*+0x0*/   int32_t base;
	/*+0x4*/   int32_t count;
};

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: int32_t;

// Type: /*packed*/ struct TEXT_Resource (forward reference);
struct TEXT_Resource{ // packed(0x18 bytes) TI: 0x2ec2
	/*+0x0*/   /*packed*/ struct VRResource res; // 0x10 bytes
	/*+0x10*/  int32_t count;
	/*+0x14*/  uint32_t * bmpcolors;
	/*+0x18*/  /*packed*/ struct VRBITMAP bmp[0]; // 0x0 bytes
};

// Type: /*packed*/ struct VRResource (forward reference);
struct VRResource{ // packed(0x10 bytes) TI: 0x18ae
	/*+0x0*/   char * mem;
	/*+0x4*/   int32_t mempoolid;
	/*+0x8*/   int32_t type;
	/*+0xc*/   int32_t entry;
};

// Type: unsigned char *;

// Type: /*packed*/ struct VRBmpHdr (forward reference);
struct VRBmpHdr{ // packed(0x10 bytes) TI: 0x2312
	/*+0x0*/   /*packed*/ struct VRBmpInfo info; // 0xc bytes
	/*+0xc*/   int32_t ScanOffset[1];
};

// Type: uint32_t *;

// Type: int32_t *;

// Type: /*packed*/ struct _FaceHdr (forward reference);
struct _FaceHdr{ // packed(0x30 bytes) TI: 0x2e99
	/*+0x0*/   /*packed*/ struct _FaceHdr *NextFace;
	/*+0x4*/   int32_t Nverts;
	/*+0x8*/   int32_t Attrib1;
	/*+0xc*/   int32_t Attrib2;
	/*+0x10*/  int32_t Plotter;
	/*+0x14*/  int32_t Count2d;
	/*+0x18*/  /*packed*/ struct Clip3d *Verts2d;
	/*+0x1c*/  int32_t PlyVerts;
	/*+0x20*/  /*packed*/ struct MapVert *MapVerts;
	/*+0x24*/  int32_t Bitmap;
	/*+0x28*/  /*packed*/ struct MapVert *Barrys;
	/*+0x2c*/  /*packed*/ struct Project3d *Normal;
};

// Type: void;

// Type: /*packed*/ struct VRObjInfo;
struct VRObjInfo{ // packed(0x24 bytes) TI: 0x2ea8
	/*+0x0*/   int32_t Faces;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Radius;
	/*+0x10*/  /*packed*/ struct Point3d *ObjCenter;
	/*+0x14*/  /*packed*/ struct Point3d *VertsPtr;
	/*+0x18*/  /*packed*/ struct Xform3d *VertsXfm;
	/*+0x1c*/  /*packed*/ struct Point3d *OrgVerts;
	/*+0x20*/  int32_t *Matrix[4][4];
};

// Type: /*packed*/ struct ObjectHdr (forward reference);
struct ObjectHdr{ // packed(0x90 bytes) TI: 0x2ebb
	/*+0x0*/   int32_t Attrib;
	/*+0x4*/   int32_t NVerts;
	/*+0x8*/   /*packed*/ struct Point3d *VertsPtr;
	/*+0xc*/   int32_t MemPool;
	/*+0x10*/  int32_t NFaces;
	/*+0x14*/  int32_t PolyVerts;
	/*+0x18*/  /*packed*/ struct Point3d CenterOrg; // 0xc bytes
	/*+0x24*/  /*packed*/ struct Point3d Center; // 0xc bytes
	/*+0x30*/  int32_t Radius;
	/*+0x34*/  /*packed*/ struct _BSPtree *bsptree;
	/*+0x38*/  int32_t StaticCnt;
	/*+0x3c*/  int32_t StaticPtr;
	/*+0x40*/  int32_t MiscReg1;
	/*+0x44*/  int32_t ID;
	/*+0x48*/  int32_t Entry;
	/*+0x4c*/  /*packed*/ struct _FaceHdr *FacePtr;
	/*+0x50*/  int32_t Matrix[4][4]; // 0x40 bytes
};

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};



// Contribution: 1:000d7cc0-000d89a4 Module: 132, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004d8cc0
int32_t VRCreateTexColors(/*packed*/ struct VRResource *res, int32_t create_new) {
	/*bp-0x4*/   /*packed*/ struct VRBmpHdr *bhdr;
	/*bp-0x8*/   int32_t maxval;
	/*bp-0xc*/   int32_t i;
	/*bp-0x10*/  int32_t j;
	/*bp-0x14*/  /*packed*/ struct TEXT_Resource *hdr;
	/*bp-0x18*/  int32_t maxcolor;
	/*bp-0x1c*/  unsigned char * tptr;

// LINE 122:
	hdr = res;
// LINE 123:
	S_texres = hdr;
// LINE 126:
	__asm        cmp    create_new, 1;
	__asm        jne    _T40;
// LINE 129:
	__asm        mov    eax, hdr;
	__asm        mov    eax, [eax+0x10];
	__asm        shl    eax, 2;
	__asm        push   eax;
	__asm        mov    eax, res;
	__asm        mov    eax, [eax+4];
	__asm        push   eax;
	__asm        call   S2Alloc;
	__asm        add    esp, 8;
	__asm        mov    ecx, hdr;
	__asm        mov    [ecx+0x14], eax;
// LINE 132:
_T40:
