// Module: Loadobj.obj
// Source: C:\Copter\source\engine\Loadobj.c
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct _BSPtree (forward reference);
struct _BSPtree{ // packed(0x1c bytes) TI: 0x2ec5
	/*+0x0*/   /*packed*/ struct _FaceHdr *Polygon;
	/*+0x4*/   /*packed*/ struct _PlaneType Plane; // 0x10 bytes
	/*+0x14*/  /*packed*/ struct _BSPtree *infront;
	/*+0x18*/  /*packed*/ struct _BSPtree *behind;
};

// Type: unsigned short;

// Type: int32_t;

// Type: char *;

// Type: /*packed*/ struct ObjInfo (forward reference);
struct ObjInfo{ // packed(0x1c bytes) TI: 0x2f03
	/*+0x0*/   int32_t TreeCount;
	/*+0x4*/   int32_t VertCount;
	/*+0x8*/   int32_t Face2dCnt;
	/*+0xc*/   int32_t Face2dSub;
	/*+0x10*/  int32_t FaceCount;
	/*+0x14*/  int32_t XYZCount;
	/*+0x18*/  int32_t Untextured;
};

// Type: /*packed*/ struct GEOM_Resource (forward reference);
struct GEOM_Resource{ // packed(0x18 bytes) TI: 0x2f05
	/*+0x0*/   /*packed*/ struct VRResource res; // 0x10 bytes
	/*+0x10*/  int32_t count;
	/*+0x14*/  int32_t barrymempool;
	/*+0x18*/  int32_t pointer[0]; // 0x0 bytes
};

// Type: /*packed*/ struct VRResource (forward reference);
struct VRResource{ // packed(0x10 bytes) TI: 0x18ae
	/*+0x0*/   char * mem;
	/*+0x4*/   int32_t mempoolid;
	/*+0x8*/   int32_t type;
	/*+0xc*/   int32_t entry;
};

// Type: /*packed*/ struct VRMemPool (forward reference);
struct VRMemPool{ // packed(0x20 bytes) TI: 0x2453
	/*+0x0*/   int32_t ObjCount;
	/*+0x4*/   int32_t entry;
	/*+0x8*/   char * Reset_Xf;
	/*+0xc*/   char * Reset_2d;
	/*+0x10*/  char * Current_Xf;
	/*+0x14*/  char * Current_2d;
	/*+0x18*/  char * End_Xf;
	/*+0x1c*/  char * End_2d;
};

// Type: void;

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct GameObjectHdrType;
struct GameObjectHdrType{ // packed(0x7c bytes) TI: 0x2f0f
	/*+0x0*/   char Id[4];
	/*+0x4*/   long Size;
	/*+0x8*/   short NVerts; // 0x2 bytes
	/*+0xa*/   short NFaces; // 0x2 bytes
	/*+0xc*/   unsigned long Attrib;
	/*+0x10*/  long Radius;
	/*+0x14*/  long YRadius;
	/*+0x18*/  char ObjName[24]; // 0x18 bytes
	/*+0x30*/  char TextureFile[64]; // 0x40 bytes
	/*+0x70*/  long ObjAnimCnt;
	/*+0x74*/  long ObjAnimPtr;
	/*+0x78*/  int32_t ID;
};

// Type: int32_t *;

// Type: short;

// Type: /*packed*/ struct FileBSPTreeHdrType;
struct FileBSPTreeHdrType{ // packed(0xa bytes) TI: 0x2f12
	/*+0x0*/   char Id[4];
	/*+0x4*/   long Size;
	/*+0x8*/   short NNodes; // 0x2 bytes
};

// Type: /*packed*/ struct _FaceHdr (forward reference);
struct _FaceHdr{ // packed(0x30 bytes) TI: 0x2e99
	/*+0x0*/   /*packed*/ struct _FaceHdr *NextFace;
	/*+0x4*/   int32_t Nverts;
	/*+0x8*/   int32_t Attrib1;
	/*+0xc*/   int32_t Attrib2;
	/*+0x10*/  int32_t Plotter;
	/*+0x14*/  int32_t Count2d;
	/*+0x18*/  /*packed*/ struct Clip3d *Verts2d;
	/*+0x1c*/  int32_t PlyVerts;
	/*+0x20*/  /*packed*/ struct MapVert *MapVerts;
	/*+0x24*/  int32_t Bitmap;
	/*+0x28*/  /*packed*/ struct MapVert *Barrys;
	/*+0x2c*/  /*packed*/ struct Project3d *Normal;
};

// Type: /*packed*/ struct FileFaceHdrType;
struct FileFaceHdrType{ // packed(0x15 bytes) TI: 0x2f14
	/*+0x0*/   char Id[4];
	/*+0x4*/   long Size;
	/*+0x8*/   short NVerts; // 0x2 bytes
	/*+0xa*/   unsigned long Attrib;
	/*+0xe*/   unsigned long AuxAttrib;
	/*+0x12*/  unsigned char Color; // 0x1 bytes
	/*+0x13*/  short TextureId; // 0x2 bytes
};

// Type: /*packed*/ struct ObjectHdr (forward reference);
struct ObjectHdr{ // packed(0x90 bytes) TI: 0x2ebb
	/*+0x0*/   int32_t Attrib;
	/*+0x4*/   int32_t NVerts;
	/*+0x8*/   /*packed*/ struct Point3d *VertsPtr;
	/*+0xc*/   int32_t MemPool;
	/*+0x10*/  int32_t NFaces;
	/*+0x14*/  int32_t PolyVerts;
	/*+0x18*/  /*packed*/ struct Point3d CenterOrg; // 0xc bytes
	/*+0x24*/  /*packed*/ struct Point3d Center; // 0xc bytes
	/*+0x30*/  int32_t Radius;
	/*+0x34*/  /*packed*/ struct _BSPtree *bsptree;
	/*+0x38*/  int32_t StaticCnt;
	/*+0x3c*/  int32_t StaticPtr;
	/*+0x40*/  int32_t MiscReg1;
	/*+0x44*/  int32_t ID;
	/*+0x48*/  int32_t Entry;
	/*+0x4c*/  /*packed*/ struct _FaceHdr *FacePtr;
	/*+0x50*/  int32_t Matrix[4][4]; // 0x40 bytes
};

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct TEXT_Resource (forward reference);
struct TEXT_Resource{ // packed(0x18 bytes) TI: 0x2ec2
	/*+0x0*/   /*packed*/ struct VRResource res; // 0x10 bytes
	/*+0x10*/  int32_t count;
	/*+0x14*/  uint32_t * bmpcolors;
	/*+0x18*/  /*packed*/ struct VRBITMAP bmp[0]; // 0x0 bytes
};

// Type: /*packed*/ struct VRObjInfo;
struct VRObjInfo{ // packed(0x24 bytes) TI: 0x2ea8
	/*+0x0*/   int32_t Faces;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Radius;
	/*+0x10*/  /*packed*/ struct Point3d *ObjCenter;
	/*+0x14*/  /*packed*/ struct Point3d *VertsPtr;
	/*+0x18*/  /*packed*/ struct Xform3d *VertsXfm;
	/*+0x1c*/  /*packed*/ struct Point3d *OrgVerts;
	/*+0x20*/  int32_t *Matrix[4][4];
};

// Type: /*packed*/ struct VRBmpHdr (forward reference);
struct VRBmpHdr{ // packed(0x10 bytes) TI: 0x2312
	/*+0x0*/   /*packed*/ struct VRBmpInfo info; // 0xc bytes
	/*+0xc*/   int32_t ScanOffset[1];
};

// Type: /*packed*/ struct MapVert (forward reference);
struct MapVert{ // packed(0x8 bytes) TI: 0x2e89
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};

// Type: /*packed*/ struct Project3d (forward reference);
struct Project3d{ // packed(0x10 bytes) TI: 0x2e8d
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
	/*+0xc*/   /*packed*/ struct Point3d *p;
};

// Type: /*packed*/ struct FPoint3d;
struct FPoint3d{ // packed(0x18 bytes) TI: 0x2f28
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double y; // 0x8 bytes
	/*+0x10*/  double z; // 0x8 bytes
};

// Type: double;



// Contribution: 1:000d1180-000d42ba Module: 147, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004d2180
/*packed*/ struct VRResource* LoadGroup(/*packed*/ struct ObjInfo *info, int32_t objs) {
	/*bp-0x4*/   char * group;
	/*bp-0x8*/   /*packed*/ struct GEOM_Resource *res;
	/*bp-0xc*/   int32_t i;

// LINE 152:
	res = S2Alloc(G_currmempool, ((objs << 0x2) + 0x18));
// LINE 153:
	__asm        cmp    res, 0;
	__asm        jne    _T3f;
// LINE 154:
	GlobalError = 0x4;
// LINE 155:
	return 0x0;
// LINE 166:
_T3f:
	__asm        mov    eax, info;
	__asm        mov    eax, [eax+4];
	__asm        mov    ecx, info;
	__asm        mov    ecx, [ecx+4];
	__asm        shl    ecx, 2;
	__asm        lea    eax, [ecx+eax*8];
	__asm        mov    ecx, info;
	__asm        mov    ecx, [ecx];
	__asm        mov    edx, ecx;
	__asm        shl    ecx, 3;
	__asm        sub    ecx, edx;
	__asm        lea    eax, [eax+ecx*4];
