// Module: Yobject.obj
// Source: C:\Copter\Source\X\Y\Yobject.cpp
// autogenerated by simcopter_tool from PDB file

// Type: long;

// Type: /*unpacked*/ class cYObject (forward reference);
// VTABLE: COPTER_D 0x005935e0
class cYObject : public TreeSim, public YObjLang
{ // not packed(0x168 bytes) TI: 0x48a0
	using DataType = short;
	enum /* __unnamed */ {
		kNumData = 48,
		kNumTemp = 8,
		kNumPointers = 4,
	};
	struct cYObject::ObjDefHeader{ // not packed(0x1c bytes) TI: 0x374c
		/*+0x0*/   long version;
		/*+0x4*/   short stackSize; // 0x2 bytes
		/*+0x6*/   short baseGraphic; // 0x2 bytes
		/*+0x8*/   short numGraphics; // 0x2 bytes
		/*+0xa*/   short initBhav; // 0x2 bytes
		/*+0xc*/   short toolbarPict; // 0x2 bytes
		/*+0xe*/   short treeTableID; // 0x2 bytes
		/*+0x10*/  short personalityID; // 0x2 bytes
		/*+0x12*/  short type; // 0x2 bytes
		/*+0x14*/  short red; // 0x2 bytes
		/*+0x16*/  short green; // 0x2 bytes
		/*+0x18*/  short blue; // 0x2 bytes
		/*+0x1a*/  short _padding2; // 0x2 bytes
	};
	enum MoveErrorCode {
		kMoveError = -1,
		kMoveSuccess = 0,
		kMoveFailTooHigh = 1,
		kMoveFailTooLow = 2,
		kMoveFailNonNeutralTerritory = 3,
		kMoveFailDynObjGeneric = 4,
		kMoveFailDynObjPerson = 5,
		kMoveFailOutOfDynObjRect = 6,
		kMoveFailNoSpeed = 7,
		kMoveFailFinishedMoving = 8,
		kMoveFailStaticObj = 9,
		kMoveFailStackObject = 10,
		kMoveFailUnwalkableLoctype = 11,
		kMoveFailOutOfRoad = 12,
	};
	enum ObjectType {
		kPerson = 0,
		kNumObjectTypes = 1,
	};
public:
	static short sStackSize[1];
	void SetToLoc(/*unpacked*/ struct _DYOBJ_INST*);
	unsigned short Gosub(short);
	short GetTree();
	void ReceiveHit(long, /*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct _DYOBJ_INST*, long, long);
	void Die();
	enum MissionUpdates {
		kPickedUp = 0,
		kOuttaHere = 1,
		kReportNewPickupLocation = 2,
		kJoinedRiot = 3,
		kDrivenFromRiot = 4,
		kLeftRiotOfOwnVolition = 5,
		kReportNewLocation = 6,
		kMedVicToted = 7,
		kMedVicPickedUp = 8,
		kPersonCaught = 9,
	};
	enum Checks {
		kHeliLanded = 0,
		kHeliLow = 1,
		kMasterObjectLow = 2,
		kMasterObjectMovingSlowly = 3,
		kStackObjectLow = 4,
	};
	enum CompareMyLocWith {
		kMissionDestLoc = 0,
		kStackPointer = 1,
		kHeli = 2,
		kBucket = 3,
		kLastHitter = 4,
		kClosestMedevacVictim = 5,
		kClosestCriminal = 6,
		k_pad_MotherShipLoc = 7,
		kClosestCop = 8,
		kAvatarClose = 9,
		kClosestAmbulance = 10,
		kClosestCopCar = 11,
		kClosestFiretruck = 12,
		kClosestCriminalCar = 13,
		kClosestAmbient = 14,
	};
public:
	short * GetLocalVar(short);
	// calltype: NearC
	static void StartScurkPeople(short, short);
	// calltype: NearC
	static void StartScurkPeopleNearAvatar();
	// calltype: NearC
	static void BeamRemainingAmbients();
	// calltype: NearC
	static void StartForScurkID(enum PersonType, enum MissionType, short, short, short, /*unpacked*/ struct _DYOBJ_INST*, int32_t, int32_t);
	// calltype: NearC
	static void StartForScurkID(enum PersonType, enum MissionType, short, short, short, /*unpacked*/ struct _DYOBJ_INST*);
	unsigned short GetNearbyFire(short, short *, short *);
	unsigned short StartMission(enum PersonType, enum MissionType, short, short, long, /*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct Point3d*);
	unsigned short StartScurkAmbientMission(short, short, enum PersonType, short, short, /*unpacked*/ struct _DYOBJ_INST*, int32_t, int32_t);
	unsigned short StartScurkAmbientMission(short, short, enum PersonType, short, short, /*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct Point3d*);
	void ResetToAmbient();
	long JoinRiot();
	// calltype: NearC
	static short StartPerson(enum PersonType, enum MissionType);
	unsigned short AddToHeli();
	void RemoveFromHeli();
	void SetPersonData(enum PersonType, enum MissionType, long);
	static short sInitBhav[14];
	static short sHitRxnTree[20];
	// calltype: NearC
	static void SetRxnTree(short, short);
	static long sSimTicks;
	/*+0x18*/  long fLastInterrupt;
	enum LocationType {
		kOutOfCity = -1,
		kLocNoInfo = 0,
		kLocUnknown = 1,
		kNothing = 2,
		kForest = 3,
		kRubble = 4,
		kSmallPark = 5,
		kWireStuff = 6,
		kCarRoad = 7,
		kCarBridge = 8,
		kTrainTrack = 9,
		kDomestic = 10,
		kCommercial = 11,
		kWhiteCollarBusiness = 12,
		kBlueCollarBusiness = 13,
		kNumLocTypes = 14,
	};
public:
	static enum cYObject::LocationType sLocType[256];
	enum SearchType {
		kSearchEdgeGround = 0,
		kSearchAnywhereGround = 1,
		kSearchRoof = 2,
		kSearchAnywhereAtAll = 3,
	};
	struct cYObject::LocationInfo{ // not packed(0x8 bytes) TI: 0x425a
		/*+0x0*/   enum cYObject::SearchType searchType;
		/*+0x4*/   short maxNormalLoiterers; // 0x2 bytes
	};
public:
	static /*unpacked*/ struct cYObject::LocationInfo sLocInfo[14];
	/*unpacked*/ struct _DYOBJ_INST* SearchForDynObj(short, short, /*unpacked*/ struct _DYOBJ_INST*);
	short GetDirectionTo(/*unpacked*/ struct _DYOBJ_INST*);
	short GetDirectionTo(short, short);
	unsigned short SearchForPersonSpot(/*unpacked*/ struct _CELL_INFO*, /*unpacked*/ struct Point3d*, enum cYObject::SearchType);
	unsigned short SearchForPersonSpot(/*unpacked*/ struct _CELL_INFO*, int32_t *, int32_t *, enum cYObject::SearchType);
	unsigned short SearchForPersonSpot(/*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct Point3d*);
	static short sBeamed;
	static short sDebugNumBeamed;
	// calltype: NearC
	static unsigned short LikelyToBeamSuccessfully();
	// calltype: NearC
	static short GetScurkID(short, short);
	// calltype: NearC
	static unsigned short IsSuitableForMission(enum MissionType, short, short);
	// calltype: NearC
	static unsigned short IsNeutralForPerson(enum PersonType, enum cYObject::LocationType);
	unsigned short IsNeutralAndSparse(/*unpacked*/ struct _CELL_INFO*, enum cYObject::LocationType);
	// calltype: NearC
	static /*unpacked*/ struct Point3d GetPos(unsigned char, unsigned char, int32_t, int32_t);
	// calltype: NearC
	static /*unpacked*/ struct Point3d GetPos(/*unpacked*/ struct _CELL_INFO*, int32_t, int32_t);
	unsigned short AdjoinsRoad(/*unpacked*/ struct Point3d);
	unsigned short RoadTile(int32_t, int32_t);
	unsigned short GetNeutralLoc(int32_t *, int32_t *, int32_t *, int32_t *);
	void UpdateMission(enum cYObject::MissionUpdates, long);
	void ResetTree();
	void ResetTree(short);
	struct cYObject::MoveInfo{ // not packed(0x10 bytes) TI: 0x3748
		/*+0x0*/   enum cYObject::LocationType *locType;
		/*+0x4*/   signed char * roadDir;
		/*+0x8*/   /*unpacked*/ struct _DYOBJ_INST *dyBlock;
		/*+0xc*/   /*unpacked*/ struct _STOBJ_INST *stBlock;
	};
	struct cYObject::_ControlInput{ // not packed(0x18 bytes) TI: 0x3745
		/*+0x0*/   /*unpacked*/ struct Point3d vector; // 0xc bytes
		/*+0xc*/   int32_t fwdSpeed;
		/*+0x10*/  int32_t rotateRate;
		/*+0x14*/  int32_t yaw;
	};
	struct cYObject::_ControlInput{ // not packed(0x18 bytes) TI: 0x3745
		/*+0x0*/   /*unpacked*/ struct Point3d vector; // 0xc bytes
		/*+0xc*/   int32_t fwdSpeed;
		/*+0x10*/  int32_t rotateRate;
		/*+0x14*/  int32_t yaw;
	};
private:
	static unsigned short sInited;
	static /*unpacked*/ class cYObject *sObjects[100];
	static enum cYObject::LocationType sNeutralPersonLocs[18][10];
	static enum cYObject::LocationType sNeutralMissionLocs[14][10];
	static /*unpacked*/ class cYObject *sList;
	static /*unpacked*/ class NResFile sFile;
	static /*unpacked*/ class ResFile sErrorFile;
public:
	static /*unpacked*/ class YObjLang *sLanguage;
	static /*unpacked*/ class Behavior *sBehavior;
	static /*unpacked*/ struct Point3d sMoveTable[8];
	static /*unpacked*/ struct Point3d sUnitVectorTable[8];
	// calltype: NearC
	static void InitObjects(char *);
	// calltype: NearC
	static void DestroyObjects();
	// calltype: NearC
	static short MakeNewObject(short, /*unpacked*/ struct Point3d, /*unpacked*/ class Behavior*);
	// calltype: NearC
	static void KillObject(short);
	// calltype: NearC
	static void MakePlebes();
	void InitForEngine(short);
	void TellLocToEngine();
	/*unpacked*/ class cYObject* GetClosest(enum MissionSupertype, enum MissionType, unsigned short, short *);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetObjectA(short);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetObjectA(/*unpacked*/ struct _DYOBJ_INST*);
	/*unpacked*/ class cYObject* GetPersonWithMaster(/*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetSleepingPerson();
	// calltype: NearC
	static void DrawOnePerson(/*unpacked*/ struct VRBlit*);
	void SetCell(unsigned char, unsigned char);
	void UnsetCell(unsigned char, unsigned char);
	void Link();
	void Link(unsigned char, unsigned char);
	/*+0x1c*/  long fMissionID;
	void PutOnGround();
	void Unlink();
	unsigned short CellIsSet();
	/*+0x20*/  unsigned short fbLinked; // 0x2 bytes
	unsigned short Linked();
	/*+0x22*/  unsigned short fInited; // 0x2 bytes
	// calltype: NearC
	static unsigned short ConvertObjDef(void * __ptr32);
	// calltype: NearC
	static short GetAvailRouteMask();
	// calltype: NearC
	static void ClearRouteMask(short);
	// calltype: NearC
	static void MaskTile(short, short, short);
	// calltype: NearC
	static void IntegrityCheck(unsigned char *);
	static short sNumMissionAwake;
	static short sNumAmbientAwake;
	static unsigned short sAllAmbientStarted;
	static short sAmbientTopOff;
	static short sAmbientAbsoluteMax;
	static short sScurkRectRad;
	/*+0x24*/  /*unpacked*/ struct _DYOBJ_INST fDyn; // 0x64 bytes
	/*+0x88*/  unsigned char fCellX; // 0x1 bytes
	/*+0x89*/  unsigned char fCellY; // 0x1 bytes
	/*+0x8c*/  unsigned long fBodyName;
	/*+0x90*/  /*unpacked*/ class cCopterBody *fBody;
	/*+0x94*/  unsigned long fAnimName;
	/*+0x98*/  /*unpacked*/ class cCopterAnim *fAnim;
	/*+0x9c*/  short fFace; // 0x2 bytes
	void SetFace(short);
	/*+0xa0*/  /*unpacked*/ struct Point3d fLastMasterLoc; // 0xc bytes
	unsigned short SetMaster(/*unpacked*/ struct _DYOBJ_INST*);
	/*unpacked*/ struct _DYOBJ_INST* GetMaster();
	void FollowMaster();
	/*+0xac*/  enum cYObject::LocationType fCurLocType;
	// calltype: NearC
	static unsigned short GetOutOfHeli(long);
	// calltype: NearC
	static /*unpacked*/ struct Point2d GetRiotCenter(short, short);
	// calltype: NearC
	static /*unpacked*/ struct Point2d GetRiotCenter(long);
	void SimAnim();
	void Simulate();
	// calltype: NearC
	static void SimulateAll();
	// calltype: NearC
	static void TryStartAllAmbient();
	unsigned long GetBody();
	void SetBody(unsigned long);
	void IncAndCheckAnimFrame();
	void CheckAnimFrame();
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetOnePersonForScurkID(short, short);
	// calltype: NearC
	static /*unpacked*/ struct _DYOBJ_INST* GetFirstDynObj(/*unpacked*/ struct _CELL_INFO*, long);
	// calltype: NearC
	static short CountDynObjs(/*unpacked*/ struct _CELL_INFO*, long);
	void SetMissionType(enum MissionType);
	void SetMissionID(long);
	void SetPersonType(enum PersonType);
	void ChangeMission(enum MissionType, long);
	void IncrementMissionStats(enum MissionType, short);
	void ClickHeels();
	void VisitOz();
	unsigned long GetAnim();
	void SetAnim(unsigned long);
	/*+0xb0*/  unsigned short fSimulate; // 0x2 bytes
	/*+0xb4*/  /*unpacked*/ class Behavior *fBehavior;
	/*+0xb8*/  /*unpacked*/ class cYObject *fNext;
	/*+0xbc*/  short fID; // 0x2 bytes
	/*+0xbe*/  short _pad; // 0x2 bytes
	/*+0xc0*/  short fTemp[8]; // 0x10 bytes
	/*+0xd0*/  short fData[48]; // 0x60 bytes
	/*+0x130*/ unsigned char * fPointers[4]; // 0x10 bytes
	/*+0x140*/ short fIterations; // 0x2 bytes
	/*+0x142*/ short _pad2; // 0x2 bytes
	/*+0x144*/ short fDirInc; // 0x2 bytes
	/*+0x148*/ /*unpacked*/ struct cYObject::ObjDefHeader fDefinition; // 0x1c bytes
	enum /* __unnamed */ {
		kMasterObject = 0,
		kLastHitterObject = 1,
	};
	enum /* __unnamed */ {
		kDirection = 0,
		kAwake = 1,
		kHeightCanJump = 2,
		kPersonType = 3,
		kMissionType = 4,
		kMissionSupertype = 5,
		kAnimFrame = 6,
		kObjectID = 7,
		kRiotVal = 8,
		kVisible = 9,
		kLastRiotVal = 10,
		kNearMedFar = 11,
		kLastHitterMsg = 12,
		kMegaphoneMessage = 13,
		kInRxnTree = 14,
		kDead = 15,
		kColorIndexShift = 16,
		kDynAnim = 17,
		kSpeed = 18,
		kOnlyOnRoad = 19,
		kMoveOnlyNeutrally = 20,
		kMoveNoMatterWhat = 21,
		kSpecificToScurkID = 22,
		kCaptured = 23,
		kStartingObject = 24,
		kSoundChannel = 25,
		kCurrentSound = 26,
		kDynSound = 27,
		kSoundFrequencyAdj = 28,
		kInitBhav = 29,
		kLastRxnTree = 30,
	};
protected:
	virtual enum TreeSim::ReturnCode TryElement(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*) /* override */;
	virtual void HandleOverflow(); // vtable+0x10
	virtual short InterpValue(short, short, short **); // vtable+0x14
	enum TreeSim::ReturnCode TryExpression(/*unpacked*/ struct YObjLang::AttrParam*);
public:
	enum cYObject::MoveErrorCode TryVectorMove(/*unpacked*/ struct Point3d, int32_t, /*unpacked*/ struct cYObject::MoveInfo*);
	enum cYObject::MoveErrorCode TryTableMove(short, unsigned short, /*unpacked*/ struct cYObject::MoveInfo*);
	enum cYObject::MoveErrorCode TryMove(unsigned short, /*unpacked*/ struct cYObject::MoveInfo*, int32_t, int32_t, int32_t, unsigned short);
	enum cYObject::LocationType GetLocType();
	// calltype: NearC
	static enum cYObject::LocationType GetLocType(short, short);
	// calltype: NearC
	static unsigned short IsWater(short, short);
	unsigned short IsWalkable(short, short, enum cYObject::LocationType);
	unsigned short CanJumpOffHere();
	// calltype: NearC
	static signed char GetRoadDir(/*unpacked*/ struct Point3d);
	enum SoundNum {
		kSNone = -1,
		kSAssertion = 1,
		kSDunno = 2,
		kSHoHum = 3,
		kSQuery = 4,
		kSSad = 5,
		kSTitter = 6,
		kSYouGoGirl = 7,
		kSGrunt = 8,
		kSWhoa = 9,
		kSHey = 10,
		kSHiThere = 11,
		kSAaah = 12,
		kSAck = 13,
		kSFeet = 14,
		kSYrUnderArrest = 15,
		kSGimmeYrCash = 16,
		kSSinisterChuckle = 17,
		kSSayYrKindaHot = 18,
	};
public:
	// calltype: NearC
	static short DistributeSoundChannels(short, short);
	unsigned short PlaySoundA(enum cYObject::SoundNum, unsigned short);
	// calltype: NearC
	static void PhaseAndBeamSoundChannels();
	static short sSoundChannels[15];
	// calltype: NearC
	static short ExtraSoundChannelForSure();
	// calltype: NearC
	static short RegSoundChannel();
	// calltype: NearC
	static void StopAllSounds();
	void StopSound();
	void ClearSoundChannel();
	short GetActualSoundChannel();
	// calltype: NearC
	static short GetActualSoundChannel(short);
	void SetSoundChannel(short);
	// calltype: NearC
	static short GetSRadius(/*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static int32_t GetRadius(/*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static /*unpacked*/ struct _DYOBJ_INST* GetDynObj(/*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct Point3d, int32_t, /*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static /*unpacked*/ struct _STOBJ_INST* GetStaticObj(/*unpacked*/ struct Point3d, int32_t);
	// calltype: NearC
	static unsigned short InBoundingRect(/*unpacked*/ struct Point3d, int32_t, /*unpacked*/ struct Point3d, int32_t);
	unsigned short MasterSlowerThan(short);
	short GetHeightOverGround();
	unsigned short GetFakeDistTo(/*unpacked*/ struct _DYOBJ_INST*);
	unsigned short CloseTo(/*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetFirst();
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetFirst(short, short);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetFirstInvisible(short);
	/*unpacked*/ class cYObject* PutTotedMedVicOnHeli();
	/*unpacked*/ class cYObject* PutTotedMedVicOn(/*unpacked*/ struct _DYOBJ_INST*);
	unsigned short SetStartingObject(/*unpacked*/ struct _DYOBJ_INST*);
	/*unpacked*/ class cYObject* DropToted();
	/*unpacked*/ class cYObject* GetToted();
	unsigned short GetOffMasterObject();
	// calltype: NearC
	static unsigned short IsHigherThan(/*unpacked*/ struct Point3d, short);
	// calltype: NearC
	static unsigned short IsFlattenedTerrain(/*unpacked*/ struct _CELL_INFO*);
	// calltype: NearC
	static void RandomEdgeOffset(short, int32_t *, int32_t *);
	// calltype: NearC
	static void RandomOffset(short, int32_t *, int32_t *);
	virtual void Reset(); // vtable+0x18
	virtual void ~cYObject() /* override */;
protected:
	virtual void Error(short) /* override */;
	void cYObject(short, /*unpacked*/ class Behavior*, /*unpacked*/ struct Point3d, short);
public:
	/*unpacked*/ struct cYObject::ObjDefHeader* GetDef();
	void GetTypeName(char *);
	// calltype: NearC
	static /*unpacked*/ class ResFile* GetGlobalFile();
	// calltype: NearC
	static /*unpacked*/ class YObjLang* GetLanguage();
	// calltype: NearC
	static /*unpacked*/ class ResFile* GetErrorFile();
	short GetID();
	/*unpacked*/ struct Point3d GetLocation();
	/*unpacked*/ class Behavior* GetBehavior();
	void Draw(/*unpacked*/ struct VRBlit*);
	/*+0x164*/ float fScale;
	void DefaultDrawStr(short, short, unsigned char, unsigned char *, int32_t);
	void SetCellAndLoc(/*unpacked*/ struct Point3d, unsigned char, unsigned char);
	void SetCellAndLoc(unsigned char, unsigned char, int32_t, int32_t);
	void Start(int32_t, int32_t, int32_t, int32_t);
	unsigned short BeamIntoCameraRange();
	unsigned short OutOfCameraRange();
	unsigned short CanPlace(/*unpacked*/ struct Point3d);
	void AdjustRadiusForRiotVal();
	unsigned short HasRiotValChanged();
	void IncrementRiotVal(short);
	void GetSurroundingRiotInfo(short, short *, short *, short *);
	void Turn(short);
	/*unpacked*/ class cYObject* GetNext();
	void DynEffects(short, enum cYObject::MoveErrorCode, /*unpacked*/ struct cYObject::MoveInfo*);
	void DynEffectsFixed(int32_t, enum cYObject::MoveErrorCode, /*unpacked*/ struct cYObject::MoveInfo*);
	using PrimProc = enum TreeSim::ReturnCode (*)(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
public:
	static enum TreeSim::ReturnCode (*PrimProcs[64])(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIdle(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIdle(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSetAnim(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSetAnim(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sAttr(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iAttr(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sWalk(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iWalk(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSetBody(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSetBody(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sRandom(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iRandom(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sWalkToAndGrabOntoStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iWalkToAndGrabOntoStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sUpdateMyMission(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iUpdateMyMission(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCheckForTrue(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCheckForTrue(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCompareMyLocWith(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCompareMyLocWith(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSelfDecommission(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSelfDecommission(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetOffMasterObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetOffMasterObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnTowardsStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnTowardsStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIsThisLocType(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIsThisLocType(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIsThisLocTypeNeutral(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIsThisLocTypeNeutral(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCanJumpOffHere(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCanJumpOffHere(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCheckForSpotlightInMyCell(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCheckForSpotlightInMyCell(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIncrementRiotVal(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIncrementRiotVal(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetSurroundingRiotVal(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetSurroundingRiotVal(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIsThisScurkID(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIsThisScurkID(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGosubToInitbhav(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGosubToInitbhav(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sAdjustRadiusForRiotVal(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iAdjustRadiusForRiotVal(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sJoinRiot(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iJoinRiot(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSetDirection(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSetDirection(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sThrowProjectile(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iThrowProjectile(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnFromStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnFromStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnFromLastHitter(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnFromLastHitter(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnTowardsLastHitter(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnTowardsLastHitter(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetOutOfRoadEtc(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetOutOfRoadEtc(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGenerateMedevacAndSetSelfAsVictim(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGenerateMedevacAndSetSelfAsVictim(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnToNearbyFire(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnToNearbyFire(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sDie(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iDie(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sWalkToStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iWalkToStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sPutObjIntoTreeNum(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iPutObjIntoTreeNum(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sVisitOz(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iVisitOz(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sMakeMyMedevacVictimVisible(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iMakeMyMedevacVictimVisible(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sMakeMyMedevacVictimInvisible(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iMakeMyMedevacVictimInvisible(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sMakeMeMasterOfStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iMakeMeMasterOfStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sMakeMyStackObjectVisitOz(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iMakeMyStackObjectVisitOz(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sPutTotedMedVicOnStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iPutTotedMedVicOnStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTakeAnyMedVicOffStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTakeAnyMedVicOffStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetOnStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetOnStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sUpdateStackVictimToted(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iUpdateStackVictimToted(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetNumSpacesOnStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetNumSpacesOnStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sDropToted(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iDropToted(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sUpdateStackVictimPickedUp(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iUpdateStackVictimPickedUp(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCloseToHeli(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCloseToHeli(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSetMyExpression(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSetMyExpression(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetHeliSpeedPlusDamage(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetHeliSpeedPlusDamage(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIsThisCellSafe(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIsThisCellSafe(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sPlaySound(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iPlaySound(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetOnHeliIfHarnessRaised(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetOnHeliIfHarnessRaised(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sAmIOnHeli(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iAmIOnHeli(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sThrowFieryProjectile(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iThrowFieryProjectile(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTellStartingObjectTrueOrFalse(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTellStartingObjectTrueOrFalse(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sPutMyCarInStack(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iPutMyCarInStack(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sDoIHaveAMaster(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iDoIHaveAMaster(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
};

// Type: enum cYObject::LocationType;
enum LocationType {
	kOutOfCity = -1,
	kLocNoInfo = 0,
	kLocUnknown = 1,
	kNothing = 2,
	kForest = 3,
	kRubble = 4,
	kSmallPark = 5,
	kWireStuff = 6,
	kCarRoad = 7,
	kCarBridge = 8,
	kTrainTrack = 9,
	kDomestic = 10,
	kCommercial = 11,
	kWhiteCollarBusiness = 12,
	kBlueCollarBusiness = 13,
	kNumLocTypes = 14,
};

// Type: /*unpacked*/ struct Point3d (forward reference);
struct Point3d{ // not packed(0xc bytes) TI: 0x348f
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: short;

// Type: /*unpacked*/ class cAvatar (forward reference);
// VTABLE: COPTER_D 0x005935a8
class cAvatar : public cYObject
{ // not packed(0x180 bytes) TI: 0x4825
public:
	void cAvatar(/*unpacked*/ struct Point3d);
	// calltype: NearC
	static /*unpacked*/ class cAvatar* MakeAvatar();
	/*+0x168*/ /*unpacked*/ struct cYObject::_ControlInput fUserControl; // 0x18 bytes
	void RotateMatrixAndYawForEngine();
	void GetControlInput();
	void Start(int32_t, int32_t, int32_t, int32_t);
	void Simulate();
	enum cYObject::MoveErrorCode AvatarMove(/*unpacked*/ struct cYObject::MoveInfo*);
	virtual void Reset() /* override */;
	void ResetView();
	short GetScurkID();
};

// Type: /*unpacked*/ struct cYObject::LocationInfo (forward reference);
struct cYObject::LocationInfo{ // not packed(0x8 bytes) TI: 0x425a
	/*+0x0*/   enum cYObject::SearchType searchType;
	/*+0x4*/   short maxNormalLoiterers; // 0x2 bytes
};

// Type: /*unpacked*/ struct BodyDebugInfo (forward reference);
struct BodyDebugInfo{ // not packed(0x1c bytes) TI: 0x3e09
	/*+0x0*/   long screenx;
	/*+0x4*/   long screeny;
	/*+0x8*/   char text[20]; // 0x14 bytes
};

// Type: unsigned short;

// Type: /*unpacked*/ class NResFile;
// VTABLE: COPTER_D 0x00591218
class NResFile : public ResFile
{ // not packed(0x124 bytes) TI: 0x3621
private:
	/*+0x11c*/ /*unpacked*/ class PtrList<StdResLoader> fLoaders; // 0x8 bytes
public:
	virtual void ~NResFile() /* override */;
	/*unpacked*/ class StdResLoader* GetLoader(unsigned long, void (*)(void * __ptr32, long));
	void ReleaseLoader(/*unpacked*/ class StdResLoader*);
};

// Type: /*unpacked*/ class ResFile;
// VTABLE: COPTER_D 0x00593518
class ResFile : public FlatResFile
{ // not packed(0x11c bytes) TI: 0x3334
public:
	long OpenFromOtherFile(/*unpacked*/ class ResFile*);
};

// Type: /*unpacked*/ class YObjLang (forward reference);
// VTABLE: COPTER_D 0x005936e8
class YObjLang : public Language
{ // not packed(0x4 bytes) TI: 0x484d
public:
	void YObjLang(/*unpacked*/ class YObjLang&);
	void YObjLang(unsigned char *);
	void ~YObjLang();
	virtual void GetNodeText(/*unpacked*/ class Behavior*, /*unpacked*/ struct Behavior::Node*, unsigned char *) /* override */;
	virtual void GetPrimName(short, unsigned char *) /* override */;
	virtual unsigned short IsSingleExit(/*unpacked*/ struct Behavior::Node*) /* override */;
	// calltype: NearC
	static void SwizzleTreeParam(short, /*unpacked*/ struct Behavior::NodeParameter*);
	// calltype: NearC
	static void SwizzleTree(void * __ptr32, long);
	virtual void (*)(void * __ptr32, long) GetSwizzler() /* override */;
	enum /* __unnamed */ {
		kIdle = 0,
		kSetAnim = 1,
		kAttr = 2,
		_kWhatsAhead = 3,
		kWalk = 4,
		_kRunPad = 5,
		kSetBody = 6,
		kRandom = 7,
		_kGetDirDistToFirst = 8,
		_kGetDirDistToPerson = 9,
		_kRoadDir = 10,
		_kSearchForDyn = 11,
		kWalkToAndGrabOntoStackObject = 12,
		kUpdateMyMission = 13,
		kCheckForTrue = 14,
		kCompareMyLocWith = 15,
		kSelfDecommission = 16,
		kGetOffMasterObject = 17,
		kTurnTowardsStackObject = 18,
		kIsThisLocType = 19,
		kIsThisLocTypeNeutral = 20,
		kCanJumpOffHere = 21,
		kCheckForSpotlightInMyCell = 22,
		kIncrementRiotVal = 23,
		kGetSurroundingRiotVal = 24,
		kIsThisScurkID = 25,
		kGosubToInitbhav = 26,
		kAdjustRadiusForRiotVal = 27,
		kJoinRiot = 28,
		kSetDirection = 29,
		kThrowProjectile = 30,
		kTurnFromStackObject = 31,
		kTurnFromLastHitter = 32,
		kTurnTowardsLastHitter = 33,
		kGetOutOfRoadEtc = 34,
		kGenerateMedevacAndSetSelfAsVictim = 35,
		kTurnToNearbyFire = 36,
		kDie = 37,
		kWalkToStackObject = 38,
		kPutObjIntoTreeNum = 39,
		kVisitOz = 40,
		_kNotUsed = 41,
		kMakeMyMedevacVictimVisible = 42,
		kMakeMyMedevacVictimInvisible = 43,
		kMakeMeMasterOfStackObject = 44,
		kMakeMyStackObjectVisitOz = 45,
		kPutTotedMedVicOnStackObject = 46,
		kTakeAnyMedVicOffStackObject = 47,
		kGetOnStackObject = 48,
		kUpdateStackVictimToted = 49,
		kGetNumSpacesOnStackObject = 50,
		kDropToted = 51,
		kUpdateStackVictimPickedUp = 52,
		kCloseToHeli = 53,
		kSetMyExpression = 54,
		kGetHeliSpeedPlusDamage = 55,
		kIsThisCellSafe = 56,
		kPlaySound = 57,
		kGetOnHeliIfHarnessRaised = 58,
		kAmIOnHeli = 59,
		kThrowFieryProjectile = 60,
		kTellStartingObjectTrueOrFalse = 61,
		kPutMyCarInStack = 62,
		kDoIHaveAMaster = 63,
		kNumPrimitives = 64,
	};
public:
	virtual short CountPrimitives() /* override */;
	enum /* __unnamed */ {
		kMyself = 0,
		kTreeParam = 1,
		kTargetObj = 2,
		kMyData = 3,
		kTreeParamData = 4,
		kTargetObjData = 5,
		kSimGlobals = 6,
		kImmediate = 7,
		kTempVars = 8,
		kStackVars = 9,
		kStackObject = 10,
		kTempTempVars = 11,
		kTreeTableValue = 12,
		kNumOwners = 13,
	};
	struct YObjLang::OwnerDataParam{ // not packed(0x8 bytes) TI: 0x3593
		/*+0x0*/   short owner1; // 0x2 bytes
		/*+0x2*/   short data1; // 0x2 bytes
		/*+0x4*/   short owner2; // 0x2 bytes
		/*+0x6*/   short data2; // 0x2 bytes
	};
	struct YObjLang::TurnToFireParam{ // not packed(0x4 bytes) TI: 0x3591
		/*+0x0*/   short xdistloc; // 0x2 bytes
		/*+0x2*/   short ydistloc; // 0x2 bytes
	};
	struct YObjLang::GetOutOfRoadParam{ // not packed(0x2 bytes) TI: 0x358f
		/*+0x0*/   short decTemp; // 0x2 bytes
	};
	struct YObjLang::SetDirectionParam{ // not packed(0x2 bytes) TI: 0x358e
		/*+0x0*/   short dirTemp; // 0x2 bytes
	};
	struct YObjLang::CheckForSpotParam{ // not packed(0x4 bytes) TI: 0x358c
		/*+0x0*/   short brightnessTemp; // 0x2 bytes
		/*+0x2*/   short dirToHeliTemp; // 0x2 bytes
	};
	struct YObjLang::GetSurroundingRiotValParam{ // not packed(0x8 bytes) TI: 0x358a
		/*+0x0*/   short distTemp; // 0x2 bytes
		/*+0x2*/   short dirToConcTemp; // 0x2 bytes
		/*+0x4*/   short riotValTemp; // 0x2 bytes
		/*+0x6*/   short numPeopleCountedTemp; // 0x2 bytes
	};
	struct YObjLang::IncrementRiotValParam{ // not packed(0x2 bytes) TI: 0x3588
		/*+0x0*/   short riotValLiteral; // 0x2 bytes
	};
	struct YObjLang::IsThisScurkIDParam{ // not packed(0x2 bytes) TI: 0x3586
		/*+0x0*/   short scurkIDLiteral; // 0x2 bytes
	};
	struct YObjLang::IsThisLocTypeParam{ // not packed(0x2 bytes) TI: 0x3584
		/*+0x0*/   short locTypeLiteral; // 0x2 bytes
	};
	struct YObjLang::UpdateMyMissionParam{ // not packed(0x2 bytes) TI: 0x3582
		/*+0x0*/   short updateLiteral; // 0x2 bytes
	};
	struct YObjLang::CheckForTrueParam{ // not packed(0x2 bytes) TI: 0x3580
		/*+0x0*/   short whatLiteral; // 0x2 bytes
	};
	struct YObjLang::CompareMyLocWithParam{ // not packed(0x6 bytes) TI: 0x357e
		/*+0x0*/   short withWhatLiteral; // 0x2 bytes
		/*+0x2*/   short distData; // 0x2 bytes
		/*+0x4*/   short distOwner; // 0x2 bytes
	};
	struct YObjLang::WalkAndGrabParam{ // not packed(0x4 bytes) TI: 0x357c
		/*+0x0*/   short decTemp; // 0x2 bytes
		/*+0x2*/   short dynAnimBoolean; // 0x2 bytes
	};
	struct YObjLang::SearchForDynParam{ // not packed(0x6 bytes) TI: 0x357a
		/*+0x0*/   short searchdynobjtypetemp; // 0x2 bytes
		/*+0x2*/   short onlyonmasterboolean; // 0x2 bytes
		/*+0x4*/   short numcellstospiral; // 0x2 bytes
	};
	struct YObjLang::IdleParam{ // not packed(0x2 bytes) TI: 0x3578
		/*+0x0*/   short decTemp; // 0x2 bytes
	};
	struct YObjLang::SetAnimParam{ // not packed(0x4 bytes) TI: 0x3576
		/*+0x0*/   unsigned long animname;
	};
	struct YObjLang::SetBodyParam{ // not packed(0x4 bytes) TI: 0x3574
		/*+0x0*/   unsigned long bodyname;
	};
	struct YObjLang::WalkRunParam{ // not packed(0x7 bytes) TI: 0x3572
		/*+0x0*/   signed char decTemp; // 0x1 bytes
		/*+0x1*/   signed char onlyNeutralBoolean; // 0x1 bytes
		/*+0x2*/   signed char moveFailTemp; // 0x1 bytes
		/*+0x3*/   signed char newLocTemp; // 0x1 bytes
		/*+0x4*/   signed char roadDirTemp; // 0x1 bytes
		/*+0x5*/   signed char dynAnimBoolean; // 0x1 bytes
		/*+0x6*/   signed char speedTemp; // 0x1 bytes
	};
	struct YObjLang::RandomParam{ // not packed(0x6 bytes) TI: 0x3570
		/*+0x0*/   short destTemp; // 0x2 bytes
		/*+0x2*/   short rangeData; // 0x2 bytes
		/*+0x4*/   short rangeOwner; // 0x2 bytes
	};
	struct YObjLang::RoadDirParam{ // not packed(0x6 bytes) TI: 0x356e
		/*+0x0*/   short dirTemp; // 0x2 bytes
		/*+0x2*/   short distAheadData; // 0x2 bytes
		/*+0x4*/   short distAheadOwner; // 0x2 bytes
	};
	struct YObjLang::DirDistFirstParam{ // not packed(0x8 bytes) TI: 0x356c
		/*+0x0*/   short dirToTemp; // 0x2 bytes
		/*+0x2*/   short distToTemp; // 0x2 bytes
		/*+0x4*/   short whatData; // 0x2 bytes
		/*+0x6*/   short whatOwner; // 0x2 bytes
	};
	struct YObjLang::DirDistPersonParam{ // not packed(0x8 bytes) TI: 0x356a
		/*+0x0*/   short dirToTemp; // 0x2 bytes
		/*+0x2*/   short distToTemp; // 0x2 bytes
		/*+0x4*/   short whoData; // 0x2 bytes
		/*+0x6*/   short whoOwner; // 0x2 bytes
	};
	struct YObjLang::AttrParam{ // not packed(0x8 bytes) TI: 0x3568
		/*+0x0*/   short lhsData; // 0x2 bytes
		/*+0x2*/   short rhsData; // 0x2 bytes
		/*+0x4*/   LfBitfield @ 0x5d5b4:
		[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
		[90m   LB.[95mTI[m = 0x3565
		[90m   LB.[32m[  1.  1][m [95mposition[m = 0x0
		[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
		 isSigned; // 0x8 bytes
		/*+0x4*/   LfBitfield @ 0x5d5bc:
		[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
		[90m   LB.[95mTI[m = 0x3566
		[90m   LB.[32m[  1.  1][m [95mposition[m = 0x8
		[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
		 opType; // 0x8 bytes
		/*+0x6*/   LfBitfield @ 0x5d5b4:
		[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
		[90m   LB.[95mTI[m = 0x3565
		[90m   LB.[32m[  1.  1][m [95mposition[m = 0x0
		[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
		 lhsOwner; // 0x8 bytes
		/*+0x6*/   LfBitfield @ 0x5d5bc:
		[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
		[90m   LB.[95mTI[m = 0x3566
		[90m   LB.[32m[  1.  1][m [95mposition[m = 0x8
		[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
		 rhsOwner; // 0x8 bytes
	};
	enum /* __unnamed */ {
		kGreaterThan = 0,
		kLessThan = 1,
		kEquals = 2,
		kIncrement = 3,
		kDecrement = 4,
		kSetValue = 5,
		kTimesEq = 6,
		kDivideEq = 7,
		kIsFlagSet = 8,
		kSetFlag = 9,
		kClearFlag = 10,
		kNumOps = 11,
	};
	struct YObjLang::MiscParam{ // not packed(0x8 bytes) TI: 0x3564
		/*+0x0*/   short m1; // 0x2 bytes
		/*+0x2*/   short m2; // 0x2 bytes
		/*+0x4*/   short m3; // 0x2 bytes
		/*+0x6*/   short m4; // 0x2 bytes
	};
	// TODO: Unknown nested type: <class 'tpi.LfUnion'>
	// /*unpacked*/ union YObjLang::Param Param
	enum TreeNum {
		kNoTree = -1,
		kSpotlightTree = 900,
		kMegaphoneTree = 901,
		kOuchTree = 902,
		kDieTree = 903,
		kRunTree = 904,
		kRunOrSwoonTree = 905,
		kSwoonTree = 906,
	};
	enum /* __unnamed */ {
		kWeightStringsID = 140,
		kPrimitiveStringsID = 139,
		kDataLabelsID = 129,
		kDataBase = 1,
		kGlobalBase = 33,
		kOwnerStringsID = 132,
		kNewOwnerBase = 1,
		kMacroDescriptionStrings = 133,
		kPrimMacroBase = 1,
		kMotiveStringsID = 134,
		kMiscStringsID = 135,
		kDontCare = 1,
		kSaveChanges = 2,
		kMaxEntryLabel = 3,
		kBehStringsID = 128,
		kPrimBase = 1,
		kOwnerBase = 33,
		kGosubStr = 65,
		kOpenParen = 66,
		kForType = 67,
		kRadius = 68,
		kFromZeroTo = 69,
		kInto = 70,
		kDistance = 71,
		kStack = 72,
		kUseTempVars = 73,
		kCloseParen = 74,
		kTreetemp = 75,
		kObjtemp = 76,
		kThisObj = 77,
		kAlertType = 78,
		kCheckTreeID = 79,
		kActionTreeID = 80,
		kForAction = 81,
		kEqualStr = 82,
		kTree = 83,
		kRate = 84,
		kTo = 85,
		kForNeed = 86,
		kSel = 87,
		kPairAction = 88,
		kToCheck = 89,
		kSet = 90,
		kToNeed = 91,
		kUpdateNeed = 92,
		kToIndex = 93,
		kCheck = 94,
		kAct = 95,
		kUntil = 96,
		kNot = 97,
		kClear = 98,
		kFor = 99,
		kByAmount = 100,
		kOpBase = 117,
		kTypeBase = 143,
		kBaseTreeBase = 164,
	};
};

// Type: /*unpacked*/ class Behavior (forward reference);
// VTABLE: COPTER_D 0x005936d8
class Behavior{ // not packed(0x1c bytes) TI: 0x35de
protected:
	/*+0x4*/   /*unpacked*/ class NResFile *fGlobFile;
	/*+0x8*/   /*unpacked*/ class NResFile *fPrivFile;
	/*+0xc*/   /*unpacked*/ class StdResLoader *fGlobalTrees;
	/*+0x10*/  /*unpacked*/ class StdResLoader *fPrivateTrees;
	/*+0x14*/  /*unpacked*/ class Language *fLanguage;
	/*+0x18*/  void (*fSwizzler)(void * __ptr32, long);
	enum /* __unnamed */ {
		kPrimitiveBase = 0,
		kPrimitiveMax = 255,
		kActionBase = 256,
		kGlobalBase = 256,
		kGlobalMax = 4095,
		kPrivateBase = 4096,
		kPrivateMax = 8191,
		kSemiGlobalBase = 8192,
		kSemiGlobalMax = 30000,
		kTreeMax = 30000,
		kPrimitives = 0,
		kGlobalTrees = 1,
		kPrivateTrees = 2,
		kSemiGlobalTrees = 3,
		kMaxTreeClass = 3,
	};
	struct Behavior::NodeParameter{ // not packed(0x8 bytes) TI: 0x35e5
		/*+0x0*/   short p1; // 0x2 bytes
		/*+0x2*/   short p2; // 0x2 bytes
		/*+0x4*/   short p3; // 0x2 bytes
		/*+0x6*/   short p4; // 0x2 bytes
	};
	struct Behavior::Node{ // not packed(0xc bytes) TI: 0x35e3
		/*+0x0*/   short treeID; // 0x2 bytes
		/*+0x0*/   short primCode; // 0x2 bytes
		/*+0x2*/   signed char trueTrans; // 0x1 bytes
		/*+0x3*/   signed char falseTrans; // 0x1 bytes
		/*+0x4*/   /*unpacked*/ struct Behavior::NodeParameter param; // 0x8 bytes
	};
	enum /* __unnamed */ {
		kUndefined = -3,
		kPopOutTrue = -2,
		kPopOutFalse = -1,
	};
	struct Behavior::Tree{ // not packed(0xe bytes) TI: 0x35e1
		/*+0x0*/   short numNodes; // 0x2 bytes
		/*+0x2*/   /*unpacked*/ struct Behavior::Node nodes[1]; // 0xc bytes
	};
public:
	void Behavior(/*unpacked*/ class Language*, /*unpacked*/ class NResFile*, /*unpacked*/ class NResFile*);
	void ~Behavior();
	void GetNode(short, short, /*unpacked*/ struct Behavior::Node*);
	virtual const /*unpacked*/ struct Behavior::Node* GetNodeRef(short, short); // vtable+0x0
	virtual void GetNodeText(short, short, unsigned char *); // vtable+0x4
	void GetNodeText(/*unpacked*/ struct Behavior::Node*, unsigned char *);
	virtual void GetTreeName(short, unsigned char *); // vtable+0x8
	short CountPrimitives();
	/*unpacked*/ class Language* GetLanguage();
	/*unpacked*/ class ResFile* GetPrivFile();
	/*unpacked*/ class ResFile* GetGlobFile();
	virtual /*unpacked*/ class ResFile* GetResFile(short); // vtable+0xc
	// calltype: NearC
	static short GetBaseID(short);
	// calltype: NearC
	static short GetMaxID(short);
	// calltype: NearC
	static short GetTreeClass(short);
	// calltype: NearC
	static void GetClassNameA(short, unsigned char *);
	using ParamSwizzleProc = void (*)(short, /*unpacked*/ struct Behavior::NodeParameter*);
public:
	// calltype: NearC
	static void StdTreeSwizzle(/*unpacked*/ struct Behavior::Tree*, long, void (*)(short, /*unpacked*/ struct Behavior::NodeParameter*));
	// calltype: NearC
	static unsigned short IsDefaultParam(/*unpacked*/ struct Behavior::NodeParameter*);
	// calltype: NearC
	static void SetDefaultParam(/*unpacked*/ struct Behavior::NodeParameter*);
};

// Type: int32_t;

// Type: void ();

// Type: /*unpacked*/ class MTimer;
class MTimer{ // not packed(0x10 bytes) TI: 0x3bee
	enum TimerResolution {
		nTimerResolutionMicroseconds = 0,
		nTimerResolutionMilliseconds = 1,
		nTimerResolutionSeconds = 2,
	};
public:
	void MTimer(enum MTimer::TimerResolution);
	void ~MTimer();
	void SetResolution(enum MTimer::TimerResolution);
	enum MTimer::TimerResolution GetResolution();
	void Start();
	void Stop();
	void Reset();
	void Restart();
	unsigned long GetElapsedTime();
	int32_t IsTimerRunning();
	unsigned long GetTickCount();
protected:
	/*+0x0*/   enum MTimer::TimerResolution nTimerResolution;
	/*+0x4*/   unsigned long lStartTime;
	/*+0x8*/   unsigned long lTotalElapsedTime;
	unsigned long GetWindowsTimerFrequency();
	/*+0xc*/   unsigned long lFrequency;
};

// Type: void;

// Type: int32_t *;

// Type: /*unpacked*/ struct _DYOBJ_INST (forward reference);
struct _DYOBJ_INST{ // not packed(0x64 bytes) TI: 0x3681
	/*+0x0*/   /*unpacked*/ struct _DYOBJ_INST *next;
	/*+0x4*/   /*unpacked*/ struct _DYOBJ_INST *vnext;
	/*+0x8*/   void * __ptr32 mesh;
	/*+0xc*/   short flags; // 0x2 bytes
	/*+0xe*/   short user1; // 0x2 bytes
	/*+0x10*/  long radius;
	/*+0x14*/  long height;
	/*+0x18*/  /*unpacked*/ struct Point3d loc; // 0xc bytes
	/*+0x24*/  int32_t matrix[4][4]; // 0x40 bytes
};

// Type: /*unpacked*/ struct Point3d;
struct Point3d{ // not packed(0xc bytes) TI: 0x348f
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*unpacked*/ struct _CELL_INFO (forward reference);
struct _CELL_INFO{ // not packed(0x18 bytes) TI: 0x3671
	/*+0x0*/   short flags; // 0x2 bytes
	/*+0x2*/   short x; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short z; // 0x2 bytes
	/*+0x8*/   short size; // 0x2 bytes
	/*+0xa*/   short ctr; // 0x2 bytes
	/*+0xc*/   /*unpacked*/ struct _STOBJ_INST *stptr;
	/*+0x10*/  /*unpacked*/ struct _DYOBJ_INST *dyptr;
	/*+0x14*/  /*unpacked*/ struct _DYOBJ_INST *vwptr;
};

// Type: enum cYObject::SearchType;
enum SearchType {
	kSearchEdgeGround = 0,
	kSearchAnywhereGround = 1,
	kSearchRoof = 2,
	kSearchAnywhereAtAll = 3,
};

// Type: char;

// Type: double;

// Type: /*unpacked*/ struct cYObject::MoveInfo;
struct cYObject::MoveInfo{ // not packed(0x10 bytes) TI: 0x3748
	/*+0x0*/   enum cYObject::LocationType *locType;
	/*+0x4*/   signed char * roadDir;
	/*+0x8*/   /*unpacked*/ struct _DYOBJ_INST *dyBlock;
	/*+0xc*/   /*unpacked*/ struct _STOBJ_INST *stBlock;
};

// Type: enum MissionSupertype;
enum MissionSupertype {
	kMissionSupertypeError = -2,
	kCriminal = 0,
	kCop = 1,
	kAmbient = 2,
};

// Type: unsigned char;

// Type: /*unpacked*/ struct VRBlit (forward reference);
struct VRBlit{ // not packed(0x10 bytes) TI: 0x3643
	/*+0x0*/   int32_t nverts;
	/*+0x4*/   /*unpacked*/ struct Proj2d *verts;
	/*+0x8*/   int32_t notused;
	/*+0xc*/   int32_t user1;
};

// Type: /*unpacked*/ struct _HELI_DATA (forward reference);
struct _HELI_DATA{ // not packed(0x32c bytes) TI: 0x390f
	/*+0x0*/   int32_t type;
	/*+0x4*/   int32_t state;
	/*+0x8*/   int32_t flags;
	/*+0xc*/   int32_t altdelta;
	/*+0x10*/  /*unpacked*/ struct Point2d lastpos; // 0x8 bytes
	/*+0x18*/  /*unpacked*/ struct Point2d currpos; // 0x8 bytes
	/*+0x20*/  int32_t rotor_mat[4][4]; // 0x40 bytes
	/*+0x60*/  int32_t rotortl_mat[4][4]; // 0x40 bytes
	/*+0xa0*/  /*unpacked*/ struct _DYOBJ_INST *dycannon;
	/*+0xa4*/  /*unpacked*/ struct _DYOBJ_INST *dyheli;
	/*+0xa8*/  /*unpacked*/ struct _DYOBJ_INST *dyshadow;
	/*+0xac*/  /*unpacked*/ struct _DYOBJ_INST *dyrotor;
	/*+0xb0*/  /*unpacked*/ struct _DYOBJ_INST *dyrotortl;
	/*+0xb4*/  /*unpacked*/ struct _DYOBJ_INST *dyrotshadow;
	/*+0xb8*/  /*unpacked*/ struct _DYOBJ_INST *dyrope;
	/*+0xbc*/  /*unpacked*/ struct _DYOBJ_INST *dybucket;
	/*+0xc0*/  /*unpacked*/ struct _DYOBJ_INST *dyspot;
	/*+0xc4*/  /*unpacked*/ struct _DYOBJ_INST *dybracket;
	/*+0xc8*/  void * __ptr32 bucketmesh;
	/*+0xcc*/  void * __ptr32 harnessmesh;
	/*+0xd0*/  int32_t damage;
	/*+0xd4*/  int32_t smokeseq;
	/*+0xd8*/  /*unpacked*/ struct mv heli_p; // 0x14 bytes
	/*+0xec*/  /*unpacked*/ struct mv heli_r; // 0x14 bytes
	/*+0x100*/ /*unpacked*/ struct Point3d vector; // 0xc bytes
	/*+0x10c*/ int32_t yaw;
	/*+0x110*/ int32_t collide_delay;
	/*+0x114*/ int32_t roll;
	/*+0x118*/ int32_t slide;
	/*+0x11c*/ int32_t pitch;
	/*+0x120*/ int32_t yawrate;
	/*+0x124*/ int32_t yspeed;
	/*+0x128*/ int32_t fwd_speed;
	/*+0x12c*/ int32_t delta_fwd_speed;
	/*+0x130*/ int32_t movex;
	/*+0x134*/ int32_t movez;
	/*+0x138*/ int32_t hover_ht;
	/*+0x13c*/ int32_t can_land;
	/*+0x140*/ long spotlevel;
	/*+0x144*/ int32_t rotstate;
	/*+0x148*/ int32_t rotspeed;
	/*+0x14c*/ int32_t fireprojectile;
	/*+0x150*/ int32_t terralt;
	/*+0x154*/ int32_t buildalt;
	/*+0x158*/ /*unpacked*/ struct Point3d collisvec; // 0xc bytes
	/*+0x164*/ int32_t shad_color;
	/*+0x168*/ /*unpacked*/ struct _MISSILE_DATA *crash_traj;
	/*+0x16c*/ int32_t crash_timer;
	/*+0x170*/ long crash_seq;
	/*+0x174*/ int32_t over_water;
	/*+0x178*/ /*unpacked*/ struct _ROPE_DATA rinfo; // 0x44 bytes
	/*+0x1bc*/ /*unpacked*/ struct _WATER_DATA winfo; // 0x8 bytes
	/*+0x1c4*/ /*unpacked*/ struct tagHeliPassengerData passengerData; // 0x15c bytes
	/*+0x320*/ int32_t fuel;
	/*+0x324*/ int32_t flight_time;
	/*+0x328*/ int32_t pct_load;
};

// Type: enum PersonType;
enum PersonType {
	kNoPreferredType = -1,
	kCountryBlonde = 0,
	kDominatrix = 1,
	kNiceWoman1 = 2,
	kNiceWoman2 = 3,
	kChild = 4,
	kQualityAssuranceEngineer = 5,
	kFatMan = 6,
	kSovietTractorDriver = 7,
	kSuit = 8,
	kShadyCharacter = 9,
	kGuyInCap = 10,
	kElectricDog = 11,
	kParamedicPerson = 12,
	kFiremanPerson = 13,
	kCopPerson = 14,
	kBadGuy = 15,
	kNessie = 16,
	kBessie = 17,
	kNumPersonTypes = 18,
};

// Type: enum MissionType;
enum MissionType {
	kMissionTypeError = -2,
	kAmbientNoMission = 0,
	kOnCapsizedBoat = 1,
	kOnBurningBuilding = 2,
	kRioting = 3,
	kTransport = 4,
	kMedevacParamedic = 5,
	kMedevacVictim = 6,
	kCopAerial = 7,
	kCopFoot = 8,
	kFireman = 9,
	kCrimRobber = 10,
	kCrimArsonist = 11,
	kCrimMugger = 12,
	kCrimCar = 13,
	kNumMissionTypes = 14,
};

// Type: /*unpacked*/ struct _LZ_INFO (forward reference);
struct _LZ_INFO{ // not packed(0x14 bytes) TI: 0x3e5a
	/*+0x0*/   int32_t flags;
	/*+0x4*/   int32_t ulx;
	/*+0x8*/   int32_t ulz;
	/*+0xc*/   int32_t dimx;
	/*+0x10*/  int32_t dimz;
};

// Type: /*unpacked*/ struct Rect;
struct Rect{ // not packed(0x8 bytes) TI: 0x3463
	/*+0x0*/   short top; // 0x2 bytes
	/*+0x2*/   short left; // 0x2 bytes
	/*+0x4*/   short bottom; // 0x2 bytes
	/*+0x6*/   short right; // 0x2 bytes
};

// Type: /*unpacked*/ struct _SYSTEMTIME;
struct _SYSTEMTIME{ // not packed(0x10 bytes) TI: 0x3e00
	/*+0x0*/   unsigned short wYear; // 0x2 bytes
	/*+0x2*/   unsigned short wMonth; // 0x2 bytes
	/*+0x4*/   unsigned short wDayOfWeek; // 0x2 bytes
	/*+0x6*/   unsigned short wDay; // 0x2 bytes
	/*+0x8*/   unsigned short wHour; // 0x2 bytes
	/*+0xa*/   unsigned short wMinute; // 0x2 bytes
	/*+0xc*/   unsigned short wSecond; // 0x2 bytes
	/*+0xe*/   unsigned short wMilliseconds; // 0x2 bytes
};

// Type: char *;

// Type: /*unpacked*/ struct _MISSION_PARMS;
struct _MISSION_PARMS{ // not packed(0x18 bytes) TI: 0x38f9
	/*+0x0*/   long op;
	/*+0x4*/   long id;
	/*+0x8*/   /*unpacked*/ struct Point2d maploc; // 0x8 bytes
	/*+0x10*/  long i2num;
	/*+0x14*/  long flags;
};

// Type: enum cYObject::SoundNum;
enum SoundNum {
	kSNone = -1,
	kSAssertion = 1,
	kSDunno = 2,
	kSHoHum = 3,
	kSQuery = 4,
	kSSad = 5,
	kSTitter = 6,
	kSYouGoGirl = 7,
	kSGrunt = 8,
	kSWhoa = 9,
	kSHey = 10,
	kSHiThere = 11,
	kSAaah = 12,
	kSAck = 13,
	kSFeet = 14,
	kSYrUnderArrest = 15,
	kSGimmeYrCash = 16,
	kSSinisterChuckle = 17,
	kSSayYrKindaHot = 18,
};

// Type: /*unpacked*/ class DigitalSound (forward reference);
// VTABLE: COPTER_D 0x0058f488
class DigitalSound : public Sound
{ // not packed(0x7c bytes) TI: 0x475b
protected:
	/*+0x34*/  int32_t nStreamingType;
	/*+0x38*/  int32_t nCompletionEstimationTimerSet;
	static /*unpacked*/ struct IDirectSound *lpDirectSound;
	/*+0x3c*/  uint32_t cbSize;
	/*+0x40*/  /*unpacked*/ struct tWAVEFORMATEX waveFormatEx; // 0x12 bytes
	/*+0x54*/  /*unpacked*/ struct IDirectSoundBuffer *lpSound[8]; // 0x20 bytes
	/*+0x74*/  /*unpacked*/ struct _STREAMBUFINFO *lpStreamBufferInfo;
	/*+0x78*/  unsigned long dwDesiredBufferDescFlags;
public:
	void DigitalSound(long);
	void DigitalSound(const /*unpacked*/ class basic_string<char>&, int32_t);
	void DigitalSound();
	virtual void ~DigitalSound() /* override */;
	/*unpacked*/ class DigitalSound& operator=(/*unpacked*/ class DigitalSound&);
	virtual void SetSoundFile(const /*unpacked*/ class basic_string<char>&, int32_t); // vtable+0x2c
	virtual int32_t Load(); // vtable+0x30
	virtual int32_t LoadFromResource(); // vtable+0x34
	virtual int32_t LoadFromFile(); // vtable+0x38
	virtual void Unload(); // vtable+0x3c
	virtual long Play(long, int32_t) /* override */;
	virtual long Stop() /* override */;
	virtual long ShouldWeStream(); // vtable+0x40
	virtual long PlayStream(); // vtable+0x44
	virtual long StopStream(); // vtable+0x48
protected:
	virtual long IsPlaying(/*unpacked*/ struct IDirectSoundBuffer**); // vtable+0x4c
public:
	virtual long IsPlaying() /* override */;
	virtual int32_t GetVolume(long *) /* override */;
	virtual int32_t SetVolume(long) /* override */;
	virtual int32_t GetPan(long *); // vtable+0x50
	virtual int32_t SetPan(long); // vtable+0x54
	virtual int32_t SetPosition(long, long, long); // vtable+0x58
	virtual long GetOriginalFrequency(); // vtable+0x5c
	virtual int32_t GetFrequency(long *); // vtable+0x60
	virtual int32_t SetFrequency(long); // vtable+0x64
	virtual int32_t GetSoundType() /* override */;
	virtual int32_t SetCompletionNotification(void (*)(long), long) /* override */;
	virtual void StopCompletionNotification() /* override */;
	virtual long EstimateRemainingPlayTime() /* override */;
protected:
	virtual int32_t GetSoundAliasToPlay(/*unpacked*/ struct IDirectSoundBuffer**); // vtable+0x68
	virtual int32_t CreateSoundBuffer(/*unpacked*/ struct _DSBUFFERDESC*); // vtable+0x6c
	virtual int32_t CreatePrimarySoundBuffer(); // vtable+0x70
	virtual int32_t ReleaseSoundBuffer(); // vtable+0x74
	virtual long InitializeStreamBuffer(long); // vtable+0x78
	virtual void ProcessStreamingBufferTimerCallback(); // vtable+0x7c
	virtual void ProcessCompletionEstimationTimerCallback(); // vtable+0x80
	virtual void StopCompletionNotificationEstimationTimer(); // vtable+0x84
	virtual int32_t StartCompletionNotificationEstimationTimer(); // vtable+0x88
};

// Type: /*unpacked*/ struct tagPassengerInfo;
struct tagPassengerInfo{ // not packed(0x14 bytes) TI: 0x3a4a
	/*+0x0*/   long lPassengerFace;
	/*+0x4*/   long lPassengerExpression;
	/*+0x8*/   long lPassengerHealth;
	/*+0xc*/   long lPassengerID;
	/*+0x10*/  long lPassengerSeatUsed;
};

// Type: /*unpacked*/ struct cYObject::MoveInfo (forward reference);
struct cYObject::MoveInfo{ // not packed(0x10 bytes) TI: 0x3748
	/*+0x0*/   enum cYObject::LocationType *locType;
	/*+0x4*/   signed char * roadDir;
	/*+0x8*/   /*unpacked*/ struct _DYOBJ_INST *dyBlock;
	/*+0xc*/   /*unpacked*/ struct _STOBJ_INST *stBlock;
};

// Type: enum cYObject::MoveErrorCode;
enum MoveErrorCode {
	kMoveError = -1,
	kMoveSuccess = 0,
	kMoveFailTooHigh = 1,
	kMoveFailTooLow = 2,
	kMoveFailNonNeutralTerritory = 3,
	kMoveFailDynObjGeneric = 4,
	kMoveFailDynObjPerson = 5,
	kMoveFailOutOfDynObjRect = 6,
	kMoveFailNoSpeed = 7,
	kMoveFailFinishedMoving = 8,
	kMoveFailStaticObj = 9,
	kMoveFailStackObject = 10,
	kMoveFailUnwalkableLoctype = 11,
	kMoveFailOutOfRoad = 12,
};

// Type: /*unpacked*/ struct Point3D;
struct Point3D{ // not packed(0x18 bytes) TI: 0x349b
	/*+0x0*/   double x; // 0x8 bytes
	/*+0x8*/   double y; // 0x8 bytes
	/*+0x10*/  double z; // 0x8 bytes
};

// Type: unsigned long;

// Type: /*unpacked*/ struct VRFaceInfo;
struct VRFaceInfo{ // not packed(0x20 bytes) TI: 0x3e07
	/*+0x0*/   int32_t Face;
	/*+0x4*/   int32_t Verts;
	/*+0x8*/   int32_t Attribute;
	/*+0xc*/   int32_t Plotter;
	/*+0x10*/  /*unpacked*/ struct VRBmpHdr *Bitmap;
	/*+0x14*/  int32_t * VertList;
	/*+0x18*/  /*unpacked*/ struct MapVert *MapVList;
	/*+0x1c*/  /*unpacked*/ struct MapVert *BarryPtr;
};

// Type: float;

// Type: /*unpacked*/ struct BodyDebugInfo;
struct BodyDebugInfo{ // not packed(0x1c bytes) TI: 0x3e09
	/*+0x0*/   long screenx;
	/*+0x4*/   long screeny;
	/*+0x8*/   char text[20]; // 0x14 bytes
};

// Type: /*unpacked*/ class CBackBuffer (forward reference);
// VTABLE: COPTER_D 0x00590808
class CBackBuffer : public IBackBuffer
{ // not packed(0x3c bytes) TI: 0x3e77
public:
	void CBackBuffer(long, long, const /*unpacked*/ struct SparkalColor*);
	void CBackBuffer(char *);
	void CBackBuffer();
	virtual void InitializeMemberVariables(); // vtable+0x28
	void ~CBackBuffer();
	unsigned long Load();
	virtual unsigned long Lock() /* override */;
	virtual unsigned long Unlock() /* override */;
	// calltype: NearC
	static int32_t GetPaletteFromImage(char *, /*unpacked*/ struct SparkalColor*);
	virtual unsigned long Swap(/*unpacked*/ class CSparkalWindow*, long, long) /* override */;
	virtual unsigned long SwapRect(/*unpacked*/ class CSparkalWindow*, long, long, long, long, long, long) /* override */;
	virtual unsigned long StretchRect(/*unpacked*/ class CSparkalWindow*, long, long, long, long, long, long, long, long) /* override */;
	virtual unsigned long Compose(/*unpacked*/ class IFlatImage*, const /*unpacked*/ struct SparkalPoint&, const /*unpacked*/ struct SparkalRect&); // vtable+0x2c
	virtual unsigned long Compose(/*unpacked*/ class IFlatImage*, long, long, long, long, long, long) /* override */;
	virtual unsigned long StretchCompose(/*unpacked*/ class IFlatImage*, long, long, long, long, long, long, long, long) /* override */;
	virtual unsigned long StretchCompose(/*unpacked*/ class IFlatImage*, const /*unpacked*/ struct SparkalRect&, const /*unpacked*/ struct SparkalRect&); // vtable+0x30
	virtual unsigned long Duplicate(/*unpacked*/ class CBackBuffer*, int32_t); // vtable+0x34
	virtual unsigned long ComposeNoClip(/*unpacked*/ class IFlatImage*, const /*unpacked*/ struct SparkalPoint&, const /*unpacked*/ struct SparkalRect&); // vtable+0x38
	virtual unsigned long ComposeNoClip(/*unpacked*/ class IFlatImage*, long, long, long, long, long, long); // vtable+0x3c
	void UpdatePalette(long, long, const /*unpacked*/ struct SparkalColor*);
	virtual void SetTransparentColor(int32_t, long) /* override */;
	unsigned long GetTransparentColor(long&);
	unsigned long SetFont(/*unpacked*/ class MFont*);
	void SetFontColor(/*unpacked*/ struct SparkalColor&);
	void SetFontIndex(int32_t);
	void SetColor(/*unpacked*/ struct SparkalColor&);
	void SetColorIndex(int32_t);
	virtual unsigned long DrawLine(long, long, long, long, long); // vtable+0x40
	virtual unsigned long FillRect(long, const /*unpacked*/ struct SparkalRect*); // vtable+0x44
	virtual unsigned long DrawBufferText(char *, long, unsigned long, const /*unpacked*/ class MRect&, /*unpacked*/ class MFont*); // vtable+0x48
	virtual unsigned long DrawBufferText(char *, unsigned long, long *, long *, long *, long *, /*unpacked*/ class MFont*); // vtable+0x4c
	virtual unsigned long DrawLineUnclipped(long, long, long, long, long); // vtable+0x50
	virtual unsigned long DrawLineClipped(long, long, long, long, long); // vtable+0x54
	virtual unsigned long DrawRectangleOutline(const /*unpacked*/ struct SparkalRect&, long); // vtable+0x58
	virtual unsigned long DrawRectangleOutlineUnclipped(const /*unpacked*/ struct SparkalRect&, long); // vtable+0x5c
	/*+0x18*/  char * szFilePath;
protected:
	/*+0x1c*/  int32_t bSurfacePrimary;
	/*+0x20*/  int32_t bSurfaceTransparent;
	/*+0x24*/  /*unpacked*/ class MFont *mFont;
	/*+0x28*/  /*unpacked*/ struct SparkalColor colorFontCurrent;
	/*+0x2c*/  /*unpacked*/ struct SparkalColor colorCurrent;
	/*+0x30*/  int32_t nColorIndexFontCurrent;
	/*+0x34*/  int32_t nColorIndexCurrent;
	/*+0x38*/  int32_t nColorIndexTransparent;
};

// Type: /*unpacked*/ struct _STOBJ_INST (forward reference);
struct _STOBJ_INST{ // not packed(0x10 bytes) TI: 0x365f
	/*+0x0*/   /*unpacked*/ struct _STOBJ_INST *next;
	/*+0x4*/   void * __ptr32 mesh;
	/*+0x8*/   long user1;
	/*+0xc*/   long user2;
};

// Type: uint32_t;

// Type: /*unpacked*/ class PtrList<StdResLoader> (forward reference);
class PtrList<StdResLoader>{ // not packed(0x8 bytes) TI: 0x3651
	class PtrList<StdResLoader>::Iter{ // not packed(0x8 bytes) TI: 0x365b
	private:
		/*+0x0*/   /*unpacked*/ class PtrList<StdResLoader> *fObject;
		/*+0x4*/   /*unpacked*/ struct PtrList<StdResLoader>::PtrNode *fCur;
	public:
		void Iter(/*unpacked*/ class PtrList<StdResLoader>*);
		/*unpacked*/ class StdResLoader* Current();
		void Next();
		void Reset();
		/*unpacked*/ class StdResLoader* First();
	};
	struct PtrList<StdResLoader>::PtrNode{ // not packed(0x8 bytes) TI: 0x3653
		/*+0x0*/   /*unpacked*/ class StdResLoader *data;
		/*+0x4*/   /*unpacked*/ struct PtrList<StdResLoader>::PtrNode *next;
	};
private:
	/*+0x0*/   /*unpacked*/ struct PtrList<StdResLoader>::PtrNode *fFirst;
	/*+0x4*/   short fCount; // 0x2 bytes
public:
	void PtrList<StdResLoader>();
	void ~PtrList<StdResLoader>();
	unsigned short Contains(/*unpacked*/ class StdResLoader*);
	void RemoveAll();
	void Remove(/*unpacked*/ class StdResLoader*);
	long Count();
	void Add(/*unpacked*/ class StdResLoader*);
	/*unpacked*/ class StdResLoader* GetByIndex(long);
	/*unpacked*/ class StdResLoader* GetByOrder(long);
};

// Type: void (void * __ptr32, long);

// Type: /*unpacked*/ class vector<char> (forward reference);
class vector<char>{ // not packed(0xc bytes) TI: 0x38ac
	using vector_allocator = /*unpacked*/ class allocator<char>;
	using value_type = char;
	using pointer = char *;
	using iterator = char *;
	using const_iterator = char *;
	using reference = char&;
	using const_reference = const char&;
	using size_type = uint32_t;
	using difference_type = int32_t;
	using const_reverse_iterator = /*unpacked*/ class reverse_iterator<char const *,char,char const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_iterator<char *,char,char &,int>;
protected:
	static /*unpacked*/ class allocator<char> static_allocator;
	/*+0x0*/   char * start;
	/*+0x4*/   char * finish;
	/*+0x8*/   char * end_of_storage;
	void insert_aux(char *, const char&);
public:
	char * begin();
	char * begin();
	char * end();
	char * end();
	/*unpacked*/ class reverse_iterator<char const *,char,char const &,int> rbegin();
	/*unpacked*/ class reverse_iterator<char *,char,char &,int> rbegin();
	/*unpacked*/ class reverse_iterator<char const *,char,char const &,int> rend();
	/*unpacked*/ class reverse_iterator<char *,char,char &,int> rend();
	uint32_t size();
	uint32_t max_size();
	uint32_t capacity();
	int32_t empty();
	const char& operator[](uint32_t);
	char& operator[](uint32_t);
	void vector<char>(char *, char *);
	void vector<char>(const /*unpacked*/ class vector<char>&);
	void vector<char>(uint32_t, const char&);
	void vector<char>();
	void ~vector<char>();
	/*unpacked*/ class vector<char>& operator=(const /*unpacked*/ class vector<char>&);
	void reserve(uint32_t);
	const char& front();
	char& front();
	const char& back();
	char& back();
	void push_back(const char&);
	void swap(/*unpacked*/ class vector<char>&);
	void insert(char *, uint32_t, const char&);
	void insert(char *, char *, char *);
	char * insert(char *, const char&);
	void pop_back();
	void erase(char *, char *);
	void erase(char *);
};

// Type: /*unpacked*/ struct TreeSim::StackElem (forward reference);
struct TreeSim::StackElem{ // not packed(0x14 bytes) TI: 0x3614
	/*+0x0*/   short treeID; // 0x2 bytes
	/*+0x2*/   short nodeNum; // 0x2 bytes
	/*+0x4*/   short objectID; // 0x2 bytes
	/*+0x4*/   short _pad; // 0x2 bytes
	/*+0x4*/   unsigned char * objectPtr;
	/*+0x8*/   short locals[4]; // 0x8 bytes
	/*+0x10*/  /*unpacked*/ class Behavior *pBehavior;
	void GetTreeName(unsigned char *);
};

// Type: /*unpacked*/ struct Behavior::Node (forward reference);
struct Behavior::Node{ // not packed(0xc bytes) TI: 0x35e3
	/*+0x0*/   short treeID; // 0x2 bytes
	/*+0x0*/   short primCode; // 0x2 bytes
	/*+0x2*/   signed char trueTrans; // 0x1 bytes
	/*+0x3*/   signed char falseTrans; // 0x1 bytes
	/*+0x4*/   /*unpacked*/ struct Behavior::NodeParameter param; // 0x8 bytes
};

// Type: enum TreeSim::ReturnCode;
enum ReturnCode {
	kTrueComplete = 1,
	kFalseComplete = 0,
	kEngaged = 2,
	kError = -1,
	kStackLoaded = 3,
};

// Type: /*unpacked*/ class TreeSim;
// VTABLE: COPTER_D 0x00593630
class TreeSim{ // not packed(0x14 bytes) TI: 0x3610
	enum /* __unnamed */ {
		kNumLocals = 4,
		kMaxIterations = 128,
	};
	struct TreeSim::StackElem{ // not packed(0x14 bytes) TI: 0x3614
		/*+0x0*/   short treeID; // 0x2 bytes
		/*+0x2*/   short nodeNum; // 0x2 bytes
		/*+0x4*/   short objectID; // 0x2 bytes
		/*+0x4*/   short _pad; // 0x2 bytes
		/*+0x4*/   unsigned char * objectPtr;
		/*+0x8*/   short locals[4]; // 0x8 bytes
		/*+0x10*/  /*unpacked*/ class Behavior *pBehavior;
		void GetTreeName(unsigned char *);
	};
private:
	/*+0x4*/   /*unpacked*/ struct TreeSim::StackElem *fStack;
	/*+0x8*/   short fStackSize; // 0x2 bytes
	/*+0xa*/   short fMaxStackSize; // 0x2 bytes
	/*+0xc*/   short fIterations; // 0x2 bytes
	/*+0xe*/   short _pad; // 0x2 bytes
	/*+0x10*/  short * fAutoStackArea;
	enum ReturnCode {
		kTrueComplete = 1,
		kFalseComplete = 0,
		kEngaged = 2,
		kError = -1,
		kStackLoaded = 3,
	};
	enum /* __unnamed */ {
		kStackErrorBase = 1000,
		kStackOverflow = 1000,
		kUndefinedTransition = 1001,
		kTooManyIterations = 1002,
		kStackUnderflow = 1003,
		kStackErrorMax = 1004,
	};
protected:
	virtual enum TreeSim::ReturnCode TryElement(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*); // vtable+0x0
	virtual void Error(short); // vtable+0x4
	void GetCurrentNode(short *, short *);
	void Reset(/*unpacked*/ class Behavior*, short);
	signed char NodeComplete(unsigned short);
	unsigned short Gosub(/*unpacked*/ class Behavior*, short *, short);
public:
	void TreeSim(short, short *);
	void TreeSim(short, short, /*unpacked*/ class Behavior*, short *);
	virtual void ~TreeSim(); // vtable+0x8
	virtual unsigned short Simulate(long, unsigned short); // vtable+0xc
	/*unpacked*/ struct TreeSim::StackElem* GetHighLevelAction();
	/*unpacked*/ struct TreeSim::StackElem* GetCurElem();
	/*unpacked*/ struct TreeSim::StackElem* GetNthElem(short);
	short GetStackSize();
	short GetMaxStackSize();
};

// Type: /*unpacked*/ class YObjLang;
// VTABLE: COPTER_D 0x005936e8
class YObjLang : public Language
{ // not packed(0x4 bytes) TI: 0x484d
public:
	void YObjLang(/*unpacked*/ class YObjLang&);
	void YObjLang(unsigned char *);
	void ~YObjLang();
	virtual void GetNodeText(/*unpacked*/ class Behavior*, /*unpacked*/ struct Behavior::Node*, unsigned char *) /* override */;
	virtual void GetPrimName(short, unsigned char *) /* override */;
	virtual unsigned short IsSingleExit(/*unpacked*/ struct Behavior::Node*) /* override */;
	// calltype: NearC
	static void SwizzleTreeParam(short, /*unpacked*/ struct Behavior::NodeParameter*);
	// calltype: NearC
	static void SwizzleTree(void * __ptr32, long);
	virtual void (*)(void * __ptr32, long) GetSwizzler() /* override */;
	enum /* __unnamed */ {
		kIdle = 0,
		kSetAnim = 1,
		kAttr = 2,
		_kWhatsAhead = 3,
		kWalk = 4,
		_kRunPad = 5,
		kSetBody = 6,
		kRandom = 7,
		_kGetDirDistToFirst = 8,
		_kGetDirDistToPerson = 9,
		_kRoadDir = 10,
		_kSearchForDyn = 11,
		kWalkToAndGrabOntoStackObject = 12,
		kUpdateMyMission = 13,
		kCheckForTrue = 14,
		kCompareMyLocWith = 15,
		kSelfDecommission = 16,
		kGetOffMasterObject = 17,
		kTurnTowardsStackObject = 18,
		kIsThisLocType = 19,
		kIsThisLocTypeNeutral = 20,
		kCanJumpOffHere = 21,
		kCheckForSpotlightInMyCell = 22,
		kIncrementRiotVal = 23,
		kGetSurroundingRiotVal = 24,
		kIsThisScurkID = 25,
		kGosubToInitbhav = 26,
		kAdjustRadiusForRiotVal = 27,
		kJoinRiot = 28,
		kSetDirection = 29,
		kThrowProjectile = 30,
		kTurnFromStackObject = 31,
		kTurnFromLastHitter = 32,
		kTurnTowardsLastHitter = 33,
		kGetOutOfRoadEtc = 34,
		kGenerateMedevacAndSetSelfAsVictim = 35,
		kTurnToNearbyFire = 36,
		kDie = 37,
		kWalkToStackObject = 38,
		kPutObjIntoTreeNum = 39,
		kVisitOz = 40,
		_kNotUsed = 41,
		kMakeMyMedevacVictimVisible = 42,
		kMakeMyMedevacVictimInvisible = 43,
		kMakeMeMasterOfStackObject = 44,
		kMakeMyStackObjectVisitOz = 45,
		kPutTotedMedVicOnStackObject = 46,
		kTakeAnyMedVicOffStackObject = 47,
		kGetOnStackObject = 48,
		kUpdateStackVictimToted = 49,
		kGetNumSpacesOnStackObject = 50,
		kDropToted = 51,
		kUpdateStackVictimPickedUp = 52,
		kCloseToHeli = 53,
		kSetMyExpression = 54,
		kGetHeliSpeedPlusDamage = 55,
		kIsThisCellSafe = 56,
		kPlaySound = 57,
		kGetOnHeliIfHarnessRaised = 58,
		kAmIOnHeli = 59,
		kThrowFieryProjectile = 60,
		kTellStartingObjectTrueOrFalse = 61,
		kPutMyCarInStack = 62,
		kDoIHaveAMaster = 63,
		kNumPrimitives = 64,
	};
public:
	virtual short CountPrimitives() /* override */;
	enum /* __unnamed */ {
		kMyself = 0,
		kTreeParam = 1,
		kTargetObj = 2,
		kMyData = 3,
		kTreeParamData = 4,
		kTargetObjData = 5,
		kSimGlobals = 6,
		kImmediate = 7,
		kTempVars = 8,
		kStackVars = 9,
		kStackObject = 10,
		kTempTempVars = 11,
		kTreeTableValue = 12,
		kNumOwners = 13,
	};
	struct YObjLang::OwnerDataParam{ // not packed(0x8 bytes) TI: 0x3593
		/*+0x0*/   short owner1; // 0x2 bytes
		/*+0x2*/   short data1; // 0x2 bytes
		/*+0x4*/   short owner2; // 0x2 bytes
		/*+0x6*/   short data2; // 0x2 bytes
	};
	struct YObjLang::TurnToFireParam{ // not packed(0x4 bytes) TI: 0x3591
		/*+0x0*/   short xdistloc; // 0x2 bytes
		/*+0x2*/   short ydistloc; // 0x2 bytes
	};
	struct YObjLang::GetOutOfRoadParam{ // not packed(0x2 bytes) TI: 0x358f
		/*+0x0*/   short decTemp; // 0x2 bytes
	};
	struct YObjLang::SetDirectionParam{ // not packed(0x2 bytes) TI: 0x358e
		/*+0x0*/   short dirTemp; // 0x2 bytes
	};
	struct YObjLang::CheckForSpotParam{ // not packed(0x4 bytes) TI: 0x358c
		/*+0x0*/   short brightnessTemp; // 0x2 bytes
		/*+0x2*/   short dirToHeliTemp; // 0x2 bytes
	};
	struct YObjLang::GetSurroundingRiotValParam{ // not packed(0x8 bytes) TI: 0x358a
		/*+0x0*/   short distTemp; // 0x2 bytes
		/*+0x2*/   short dirToConcTemp; // 0x2 bytes
		/*+0x4*/   short riotValTemp; // 0x2 bytes
		/*+0x6*/   short numPeopleCountedTemp; // 0x2 bytes
	};
	struct YObjLang::IncrementRiotValParam{ // not packed(0x2 bytes) TI: 0x3588
		/*+0x0*/   short riotValLiteral; // 0x2 bytes
	};
	struct YObjLang::IsThisScurkIDParam{ // not packed(0x2 bytes) TI: 0x3586
		/*+0x0*/   short scurkIDLiteral; // 0x2 bytes
	};
	struct YObjLang::IsThisLocTypeParam{ // not packed(0x2 bytes) TI: 0x3584
		/*+0x0*/   short locTypeLiteral; // 0x2 bytes
	};
	struct YObjLang::UpdateMyMissionParam{ // not packed(0x2 bytes) TI: 0x3582
		/*+0x0*/   short updateLiteral; // 0x2 bytes
	};
	struct YObjLang::CheckForTrueParam{ // not packed(0x2 bytes) TI: 0x3580
		/*+0x0*/   short whatLiteral; // 0x2 bytes
	};
	struct YObjLang::CompareMyLocWithParam{ // not packed(0x6 bytes) TI: 0x357e
		/*+0x0*/   short withWhatLiteral; // 0x2 bytes
		/*+0x2*/   short distData; // 0x2 bytes
		/*+0x4*/   short distOwner; // 0x2 bytes
	};
	struct YObjLang::WalkAndGrabParam{ // not packed(0x4 bytes) TI: 0x357c
		/*+0x0*/   short decTemp; // 0x2 bytes
		/*+0x2*/   short dynAnimBoolean; // 0x2 bytes
	};
	struct YObjLang::SearchForDynParam{ // not packed(0x6 bytes) TI: 0x357a
		/*+0x0*/   short searchdynobjtypetemp; // 0x2 bytes
		/*+0x2*/   short onlyonmasterboolean; // 0x2 bytes
		/*+0x4*/   short numcellstospiral; // 0x2 bytes
	};
	struct YObjLang::IdleParam{ // not packed(0x2 bytes) TI: 0x3578
		/*+0x0*/   short decTemp; // 0x2 bytes
	};
	struct YObjLang::SetAnimParam{ // not packed(0x4 bytes) TI: 0x3576
		/*+0x0*/   unsigned long animname;
	};
	struct YObjLang::SetBodyParam{ // not packed(0x4 bytes) TI: 0x3574
		/*+0x0*/   unsigned long bodyname;
	};
	struct YObjLang::WalkRunParam{ // not packed(0x7 bytes) TI: 0x3572
		/*+0x0*/   signed char decTemp; // 0x1 bytes
		/*+0x1*/   signed char onlyNeutralBoolean; // 0x1 bytes
		/*+0x2*/   signed char moveFailTemp; // 0x1 bytes
		/*+0x3*/   signed char newLocTemp; // 0x1 bytes
		/*+0x4*/   signed char roadDirTemp; // 0x1 bytes
		/*+0x5*/   signed char dynAnimBoolean; // 0x1 bytes
		/*+0x6*/   signed char speedTemp; // 0x1 bytes
	};
	struct YObjLang::RandomParam{ // not packed(0x6 bytes) TI: 0x3570
		/*+0x0*/   short destTemp; // 0x2 bytes
		/*+0x2*/   short rangeData; // 0x2 bytes
		/*+0x4*/   short rangeOwner; // 0x2 bytes
	};
	struct YObjLang::RoadDirParam{ // not packed(0x6 bytes) TI: 0x356e
		/*+0x0*/   short dirTemp; // 0x2 bytes
		/*+0x2*/   short distAheadData; // 0x2 bytes
		/*+0x4*/   short distAheadOwner; // 0x2 bytes
	};
	struct YObjLang::DirDistFirstParam{ // not packed(0x8 bytes) TI: 0x356c
		/*+0x0*/   short dirToTemp; // 0x2 bytes
		/*+0x2*/   short distToTemp; // 0x2 bytes
		/*+0x4*/   short whatData; // 0x2 bytes
		/*+0x6*/   short whatOwner; // 0x2 bytes
	};
	struct YObjLang::DirDistPersonParam{ // not packed(0x8 bytes) TI: 0x356a
		/*+0x0*/   short dirToTemp; // 0x2 bytes
		/*+0x2*/   short distToTemp; // 0x2 bytes
		/*+0x4*/   short whoData; // 0x2 bytes
		/*+0x6*/   short whoOwner; // 0x2 bytes
	};
	struct YObjLang::AttrParam{ // not packed(0x8 bytes) TI: 0x3568
		/*+0x0*/   short lhsData; // 0x2 bytes
		/*+0x2*/   short rhsData; // 0x2 bytes
		/*+0x4*/   LfBitfield @ 0x5d5b4:
		[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
		[90m   LB.[95mTI[m = 0x3565
		[90m   LB.[32m[  1.  1][m [95mposition[m = 0x0
		[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
		 isSigned; // 0x8 bytes
		/*+0x4*/   LfBitfield @ 0x5d5bc:
		[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
		[90m   LB.[95mTI[m = 0x3566
		[90m   LB.[32m[  1.  1][m [95mposition[m = 0x8
		[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
		 opType; // 0x8 bytes
		/*+0x6*/   LfBitfield @ 0x5d5b4:
		[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
		[90m   LB.[95mTI[m = 0x3565
		[90m   LB.[32m[  1.  1][m [95mposition[m = 0x0
		[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
		 lhsOwner; // 0x8 bytes
		/*+0x6*/   LfBitfield @ 0x5d5bc:
		[90m   LB.[32m[  0.  1][m [95mlength[m = 0x8
		[90m   LB.[95mTI[m = 0x3566
		[90m   LB.[32m[  1.  1][m [95mposition[m = 0x8
		[90m   LB.[32m[  2.  2][m [95mtype[m = 0x206
		 rhsOwner; // 0x8 bytes
	};
	enum /* __unnamed */ {
		kGreaterThan = 0,
		kLessThan = 1,
		kEquals = 2,
		kIncrement = 3,
		kDecrement = 4,
		kSetValue = 5,
		kTimesEq = 6,
		kDivideEq = 7,
		kIsFlagSet = 8,
		kSetFlag = 9,
		kClearFlag = 10,
		kNumOps = 11,
	};
	struct YObjLang::MiscParam{ // not packed(0x8 bytes) TI: 0x3564
		/*+0x0*/   short m1; // 0x2 bytes
		/*+0x2*/   short m2; // 0x2 bytes
		/*+0x4*/   short m3; // 0x2 bytes
		/*+0x6*/   short m4; // 0x2 bytes
	};
	// TODO: Unknown nested type: <class 'tpi.LfUnion'>
	// /*unpacked*/ union YObjLang::Param Param
	enum TreeNum {
		kNoTree = -1,
		kSpotlightTree = 900,
		kMegaphoneTree = 901,
		kOuchTree = 902,
		kDieTree = 903,
		kRunTree = 904,
		kRunOrSwoonTree = 905,
		kSwoonTree = 906,
	};
	enum /* __unnamed */ {
		kWeightStringsID = 140,
		kPrimitiveStringsID = 139,
		kDataLabelsID = 129,
		kDataBase = 1,
		kGlobalBase = 33,
		kOwnerStringsID = 132,
		kNewOwnerBase = 1,
		kMacroDescriptionStrings = 133,
		kPrimMacroBase = 1,
		kMotiveStringsID = 134,
		kMiscStringsID = 135,
		kDontCare = 1,
		kSaveChanges = 2,
		kMaxEntryLabel = 3,
		kBehStringsID = 128,
		kPrimBase = 1,
		kOwnerBase = 33,
		kGosubStr = 65,
		kOpenParen = 66,
		kForType = 67,
		kRadius = 68,
		kFromZeroTo = 69,
		kInto = 70,
		kDistance = 71,
		kStack = 72,
		kUseTempVars = 73,
		kCloseParen = 74,
		kTreetemp = 75,
		kObjtemp = 76,
		kThisObj = 77,
		kAlertType = 78,
		kCheckTreeID = 79,
		kActionTreeID = 80,
		kForAction = 81,
		kEqualStr = 82,
		kTree = 83,
		kRate = 84,
		kTo = 85,
		kForNeed = 86,
		kSel = 87,
		kPairAction = 88,
		kToCheck = 89,
		kSet = 90,
		kToNeed = 91,
		kUpdateNeed = 92,
		kToIndex = 93,
		kCheck = 94,
		kAct = 95,
		kUntil = 96,
		kNot = 97,
		kClear = 98,
		kFor = 99,
		kByAmount = 100,
		kOpBase = 117,
		kTypeBase = 143,
		kBaseTreeBase = 164,
	};
};

// Type: /*unpacked*/ class Language (forward reference);
// Language Class implementation not found

// Type: /*unpacked*/ class cYObject;
// VTABLE: COPTER_D 0x005935e0
class cYObject : public TreeSim, public YObjLang
{ // not packed(0x168 bytes) TI: 0x48a0
	using DataType = short;
	enum /* __unnamed */ {
		kNumData = 48,
		kNumTemp = 8,
		kNumPointers = 4,
	};
	struct cYObject::ObjDefHeader{ // not packed(0x1c bytes) TI: 0x374c
		/*+0x0*/   long version;
		/*+0x4*/   short stackSize; // 0x2 bytes
		/*+0x6*/   short baseGraphic; // 0x2 bytes
		/*+0x8*/   short numGraphics; // 0x2 bytes
		/*+0xa*/   short initBhav; // 0x2 bytes
		/*+0xc*/   short toolbarPict; // 0x2 bytes
		/*+0xe*/   short treeTableID; // 0x2 bytes
		/*+0x10*/  short personalityID; // 0x2 bytes
		/*+0x12*/  short type; // 0x2 bytes
		/*+0x14*/  short red; // 0x2 bytes
		/*+0x16*/  short green; // 0x2 bytes
		/*+0x18*/  short blue; // 0x2 bytes
		/*+0x1a*/  short _padding2; // 0x2 bytes
	};
	enum MoveErrorCode {
		kMoveError = -1,
		kMoveSuccess = 0,
		kMoveFailTooHigh = 1,
		kMoveFailTooLow = 2,
		kMoveFailNonNeutralTerritory = 3,
		kMoveFailDynObjGeneric = 4,
		kMoveFailDynObjPerson = 5,
		kMoveFailOutOfDynObjRect = 6,
		kMoveFailNoSpeed = 7,
		kMoveFailFinishedMoving = 8,
		kMoveFailStaticObj = 9,
		kMoveFailStackObject = 10,
		kMoveFailUnwalkableLoctype = 11,
		kMoveFailOutOfRoad = 12,
	};
	enum ObjectType {
		kPerson = 0,
		kNumObjectTypes = 1,
	};
public:
	static short sStackSize[1];
	void SetToLoc(/*unpacked*/ struct _DYOBJ_INST*);
	unsigned short Gosub(short);
	short GetTree();
	void ReceiveHit(long, /*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct _DYOBJ_INST*, long, long);
	void Die();
	enum MissionUpdates {
		kPickedUp = 0,
		kOuttaHere = 1,
		kReportNewPickupLocation = 2,
		kJoinedRiot = 3,
		kDrivenFromRiot = 4,
		kLeftRiotOfOwnVolition = 5,
		kReportNewLocation = 6,
		kMedVicToted = 7,
		kMedVicPickedUp = 8,
		kPersonCaught = 9,
	};
	enum Checks {
		kHeliLanded = 0,
		kHeliLow = 1,
		kMasterObjectLow = 2,
		kMasterObjectMovingSlowly = 3,
		kStackObjectLow = 4,
	};
	enum CompareMyLocWith {
		kMissionDestLoc = 0,
		kStackPointer = 1,
		kHeli = 2,
		kBucket = 3,
		kLastHitter = 4,
		kClosestMedevacVictim = 5,
		kClosestCriminal = 6,
		k_pad_MotherShipLoc = 7,
		kClosestCop = 8,
		kAvatarClose = 9,
		kClosestAmbulance = 10,
		kClosestCopCar = 11,
		kClosestFiretruck = 12,
		kClosestCriminalCar = 13,
		kClosestAmbient = 14,
	};
public:
	short * GetLocalVar(short);
	// calltype: NearC
	static void StartScurkPeople(short, short);
	// calltype: NearC
	static void StartScurkPeopleNearAvatar();
	// calltype: NearC
	static void BeamRemainingAmbients();
	// calltype: NearC
	static void StartForScurkID(enum PersonType, enum MissionType, short, short, short, /*unpacked*/ struct _DYOBJ_INST*, int32_t, int32_t);
	// calltype: NearC
	static void StartForScurkID(enum PersonType, enum MissionType, short, short, short, /*unpacked*/ struct _DYOBJ_INST*);
	unsigned short GetNearbyFire(short, short *, short *);
	unsigned short StartMission(enum PersonType, enum MissionType, short, short, long, /*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct Point3d*);
	unsigned short StartScurkAmbientMission(short, short, enum PersonType, short, short, /*unpacked*/ struct _DYOBJ_INST*, int32_t, int32_t);
	unsigned short StartScurkAmbientMission(short, short, enum PersonType, short, short, /*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct Point3d*);
	void ResetToAmbient();
	long JoinRiot();
	// calltype: NearC
	static short StartPerson(enum PersonType, enum MissionType);
	unsigned short AddToHeli();
	void RemoveFromHeli();
	void SetPersonData(enum PersonType, enum MissionType, long);
	static short sInitBhav[14];
	static short sHitRxnTree[20];
	// calltype: NearC
	static void SetRxnTree(short, short);
	static long sSimTicks;
	/*+0x18*/  long fLastInterrupt;
	enum LocationType {
		kOutOfCity = -1,
		kLocNoInfo = 0,
		kLocUnknown = 1,
		kNothing = 2,
		kForest = 3,
		kRubble = 4,
		kSmallPark = 5,
		kWireStuff = 6,
		kCarRoad = 7,
		kCarBridge = 8,
		kTrainTrack = 9,
		kDomestic = 10,
		kCommercial = 11,
		kWhiteCollarBusiness = 12,
		kBlueCollarBusiness = 13,
		kNumLocTypes = 14,
	};
public:
	static enum cYObject::LocationType sLocType[256];
	enum SearchType {
		kSearchEdgeGround = 0,
		kSearchAnywhereGround = 1,
		kSearchRoof = 2,
		kSearchAnywhereAtAll = 3,
	};
	struct cYObject::LocationInfo{ // not packed(0x8 bytes) TI: 0x425a
		/*+0x0*/   enum cYObject::SearchType searchType;
		/*+0x4*/   short maxNormalLoiterers; // 0x2 bytes
	};
public:
	static /*unpacked*/ struct cYObject::LocationInfo sLocInfo[14];
	/*unpacked*/ struct _DYOBJ_INST* SearchForDynObj(short, short, /*unpacked*/ struct _DYOBJ_INST*);
	short GetDirectionTo(/*unpacked*/ struct _DYOBJ_INST*);
	short GetDirectionTo(short, short);
	unsigned short SearchForPersonSpot(/*unpacked*/ struct _CELL_INFO*, /*unpacked*/ struct Point3d*, enum cYObject::SearchType);
	unsigned short SearchForPersonSpot(/*unpacked*/ struct _CELL_INFO*, int32_t *, int32_t *, enum cYObject::SearchType);
	unsigned short SearchForPersonSpot(/*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct Point3d*);
	static short sBeamed;
	static short sDebugNumBeamed;
	// calltype: NearC
	static unsigned short LikelyToBeamSuccessfully();
	// calltype: NearC
	static short GetScurkID(short, short);
	// calltype: NearC
	static unsigned short IsSuitableForMission(enum MissionType, short, short);
	// calltype: NearC
	static unsigned short IsNeutralForPerson(enum PersonType, enum cYObject::LocationType);
	unsigned short IsNeutralAndSparse(/*unpacked*/ struct _CELL_INFO*, enum cYObject::LocationType);
	// calltype: NearC
	static /*unpacked*/ struct Point3d GetPos(unsigned char, unsigned char, int32_t, int32_t);
	// calltype: NearC
	static /*unpacked*/ struct Point3d GetPos(/*unpacked*/ struct _CELL_INFO*, int32_t, int32_t);
	unsigned short AdjoinsRoad(/*unpacked*/ struct Point3d);
	unsigned short RoadTile(int32_t, int32_t);
	unsigned short GetNeutralLoc(int32_t *, int32_t *, int32_t *, int32_t *);
	void UpdateMission(enum cYObject::MissionUpdates, long);
	void ResetTree();
	void ResetTree(short);
	struct cYObject::MoveInfo{ // not packed(0x10 bytes) TI: 0x3748
		/*+0x0*/   enum cYObject::LocationType *locType;
		/*+0x4*/   signed char * roadDir;
		/*+0x8*/   /*unpacked*/ struct _DYOBJ_INST *dyBlock;
		/*+0xc*/   /*unpacked*/ struct _STOBJ_INST *stBlock;
	};
	struct cYObject::_ControlInput{ // not packed(0x18 bytes) TI: 0x3745
		/*+0x0*/   /*unpacked*/ struct Point3d vector; // 0xc bytes
		/*+0xc*/   int32_t fwdSpeed;
		/*+0x10*/  int32_t rotateRate;
		/*+0x14*/  int32_t yaw;
	};
	struct cYObject::_ControlInput{ // not packed(0x18 bytes) TI: 0x3745
		/*+0x0*/   /*unpacked*/ struct Point3d vector; // 0xc bytes
		/*+0xc*/   int32_t fwdSpeed;
		/*+0x10*/  int32_t rotateRate;
		/*+0x14*/  int32_t yaw;
	};
private:
	static unsigned short sInited;
	static /*unpacked*/ class cYObject *sObjects[100];
	static enum cYObject::LocationType sNeutralPersonLocs[18][10];
	static enum cYObject::LocationType sNeutralMissionLocs[14][10];
	static /*unpacked*/ class cYObject *sList;
	static /*unpacked*/ class NResFile sFile;
	static /*unpacked*/ class ResFile sErrorFile;
public:
	static /*unpacked*/ class YObjLang *sLanguage;
	static /*unpacked*/ class Behavior *sBehavior;
	static /*unpacked*/ struct Point3d sMoveTable[8];
	static /*unpacked*/ struct Point3d sUnitVectorTable[8];
	// calltype: NearC
	static void InitObjects(char *);
	// calltype: NearC
	static void DestroyObjects();
	// calltype: NearC
	static short MakeNewObject(short, /*unpacked*/ struct Point3d, /*unpacked*/ class Behavior*);
	// calltype: NearC
	static void KillObject(short);
	// calltype: NearC
	static void MakePlebes();
	void InitForEngine(short);
	void TellLocToEngine();
	/*unpacked*/ class cYObject* GetClosest(enum MissionSupertype, enum MissionType, unsigned short, short *);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetObjectA(short);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetObjectA(/*unpacked*/ struct _DYOBJ_INST*);
	/*unpacked*/ class cYObject* GetPersonWithMaster(/*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetSleepingPerson();
	// calltype: NearC
	static void DrawOnePerson(/*unpacked*/ struct VRBlit*);
	void SetCell(unsigned char, unsigned char);
	void UnsetCell(unsigned char, unsigned char);
	void Link();
	void Link(unsigned char, unsigned char);
	/*+0x1c*/  long fMissionID;
	void PutOnGround();
	void Unlink();
	unsigned short CellIsSet();
	/*+0x20*/  unsigned short fbLinked; // 0x2 bytes
	unsigned short Linked();
	/*+0x22*/  unsigned short fInited; // 0x2 bytes
	// calltype: NearC
	static unsigned short ConvertObjDef(void * __ptr32);
	// calltype: NearC
	static short GetAvailRouteMask();
	// calltype: NearC
	static void ClearRouteMask(short);
	// calltype: NearC
	static void MaskTile(short, short, short);
	// calltype: NearC
	static void IntegrityCheck(unsigned char *);
	static short sNumMissionAwake;
	static short sNumAmbientAwake;
	static unsigned short sAllAmbientStarted;
	static short sAmbientTopOff;
	static short sAmbientAbsoluteMax;
	static short sScurkRectRad;
	/*+0x24*/  /*unpacked*/ struct _DYOBJ_INST fDyn; // 0x64 bytes
	/*+0x88*/  unsigned char fCellX; // 0x1 bytes
	/*+0x89*/  unsigned char fCellY; // 0x1 bytes
	/*+0x8c*/  unsigned long fBodyName;
	/*+0x90*/  /*unpacked*/ class cCopterBody *fBody;
	/*+0x94*/  unsigned long fAnimName;
	/*+0x98*/  /*unpacked*/ class cCopterAnim *fAnim;
	/*+0x9c*/  short fFace; // 0x2 bytes
	void SetFace(short);
	/*+0xa0*/  /*unpacked*/ struct Point3d fLastMasterLoc; // 0xc bytes
	unsigned short SetMaster(/*unpacked*/ struct _DYOBJ_INST*);
	/*unpacked*/ struct _DYOBJ_INST* GetMaster();
	void FollowMaster();
	/*+0xac*/  enum cYObject::LocationType fCurLocType;
	// calltype: NearC
	static unsigned short GetOutOfHeli(long);
	// calltype: NearC
	static /*unpacked*/ struct Point2d GetRiotCenter(short, short);
	// calltype: NearC
	static /*unpacked*/ struct Point2d GetRiotCenter(long);
	void SimAnim();
	void Simulate();
	// calltype: NearC
	static void SimulateAll();
	// calltype: NearC
	static void TryStartAllAmbient();
	unsigned long GetBody();
	void SetBody(unsigned long);
	void IncAndCheckAnimFrame();
	void CheckAnimFrame();
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetOnePersonForScurkID(short, short);
	// calltype: NearC
	static /*unpacked*/ struct _DYOBJ_INST* GetFirstDynObj(/*unpacked*/ struct _CELL_INFO*, long);
	// calltype: NearC
	static short CountDynObjs(/*unpacked*/ struct _CELL_INFO*, long);
	void SetMissionType(enum MissionType);
	void SetMissionID(long);
	void SetPersonType(enum PersonType);
	void ChangeMission(enum MissionType, long);
	void IncrementMissionStats(enum MissionType, short);
	void ClickHeels();
	void VisitOz();
	unsigned long GetAnim();
	void SetAnim(unsigned long);
	/*+0xb0*/  unsigned short fSimulate; // 0x2 bytes
	/*+0xb4*/  /*unpacked*/ class Behavior *fBehavior;
	/*+0xb8*/  /*unpacked*/ class cYObject *fNext;
	/*+0xbc*/  short fID; // 0x2 bytes
	/*+0xbe*/  short _pad; // 0x2 bytes
	/*+0xc0*/  short fTemp[8]; // 0x10 bytes
	/*+0xd0*/  short fData[48]; // 0x60 bytes
	/*+0x130*/ unsigned char * fPointers[4]; // 0x10 bytes
	/*+0x140*/ short fIterations; // 0x2 bytes
	/*+0x142*/ short _pad2; // 0x2 bytes
	/*+0x144*/ short fDirInc; // 0x2 bytes
	/*+0x148*/ /*unpacked*/ struct cYObject::ObjDefHeader fDefinition; // 0x1c bytes
	enum /* __unnamed */ {
		kMasterObject = 0,
		kLastHitterObject = 1,
	};
	enum /* __unnamed */ {
		kDirection = 0,
		kAwake = 1,
		kHeightCanJump = 2,
		kPersonType = 3,
		kMissionType = 4,
		kMissionSupertype = 5,
		kAnimFrame = 6,
		kObjectID = 7,
		kRiotVal = 8,
		kVisible = 9,
		kLastRiotVal = 10,
		kNearMedFar = 11,
		kLastHitterMsg = 12,
		kMegaphoneMessage = 13,
		kInRxnTree = 14,
		kDead = 15,
		kColorIndexShift = 16,
		kDynAnim = 17,
		kSpeed = 18,
		kOnlyOnRoad = 19,
		kMoveOnlyNeutrally = 20,
		kMoveNoMatterWhat = 21,
		kSpecificToScurkID = 22,
		kCaptured = 23,
		kStartingObject = 24,
		kSoundChannel = 25,
		kCurrentSound = 26,
		kDynSound = 27,
		kSoundFrequencyAdj = 28,
		kInitBhav = 29,
		kLastRxnTree = 30,
	};
protected:
	virtual enum TreeSim::ReturnCode TryElement(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*) /* override */;
	virtual void HandleOverflow(); // vtable+0x10
	virtual short InterpValue(short, short, short **); // vtable+0x14
	enum TreeSim::ReturnCode TryExpression(/*unpacked*/ struct YObjLang::AttrParam*);
public:
	enum cYObject::MoveErrorCode TryVectorMove(/*unpacked*/ struct Point3d, int32_t, /*unpacked*/ struct cYObject::MoveInfo*);
	enum cYObject::MoveErrorCode TryTableMove(short, unsigned short, /*unpacked*/ struct cYObject::MoveInfo*);
	enum cYObject::MoveErrorCode TryMove(unsigned short, /*unpacked*/ struct cYObject::MoveInfo*, int32_t, int32_t, int32_t, unsigned short);
	enum cYObject::LocationType GetLocType();
	// calltype: NearC
	static enum cYObject::LocationType GetLocType(short, short);
	// calltype: NearC
	static unsigned short IsWater(short, short);
	unsigned short IsWalkable(short, short, enum cYObject::LocationType);
	unsigned short CanJumpOffHere();
	// calltype: NearC
	static signed char GetRoadDir(/*unpacked*/ struct Point3d);
	enum SoundNum {
		kSNone = -1,
		kSAssertion = 1,
		kSDunno = 2,
		kSHoHum = 3,
		kSQuery = 4,
		kSSad = 5,
		kSTitter = 6,
		kSYouGoGirl = 7,
		kSGrunt = 8,
		kSWhoa = 9,
		kSHey = 10,
		kSHiThere = 11,
		kSAaah = 12,
		kSAck = 13,
		kSFeet = 14,
		kSYrUnderArrest = 15,
		kSGimmeYrCash = 16,
		kSSinisterChuckle = 17,
		kSSayYrKindaHot = 18,
	};
public:
	// calltype: NearC
	static short DistributeSoundChannels(short, short);
	unsigned short PlaySoundA(enum cYObject::SoundNum, unsigned short);
	// calltype: NearC
	static void PhaseAndBeamSoundChannels();
	static short sSoundChannels[15];
	// calltype: NearC
	static short ExtraSoundChannelForSure();
	// calltype: NearC
	static short RegSoundChannel();
	// calltype: NearC
	static void StopAllSounds();
	void StopSound();
	void ClearSoundChannel();
	short GetActualSoundChannel();
	// calltype: NearC
	static short GetActualSoundChannel(short);
	void SetSoundChannel(short);
	// calltype: NearC
	static short GetSRadius(/*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static int32_t GetRadius(/*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static /*unpacked*/ struct _DYOBJ_INST* GetDynObj(/*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct Point3d, int32_t, /*unpacked*/ struct _DYOBJ_INST*, /*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static /*unpacked*/ struct _STOBJ_INST* GetStaticObj(/*unpacked*/ struct Point3d, int32_t);
	// calltype: NearC
	static unsigned short InBoundingRect(/*unpacked*/ struct Point3d, int32_t, /*unpacked*/ struct Point3d, int32_t);
	unsigned short MasterSlowerThan(short);
	short GetHeightOverGround();
	unsigned short GetFakeDistTo(/*unpacked*/ struct _DYOBJ_INST*);
	unsigned short CloseTo(/*unpacked*/ struct _DYOBJ_INST*);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetFirst();
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetFirst(short, short);
	// calltype: NearC
	static /*unpacked*/ class cYObject* GetFirstInvisible(short);
	/*unpacked*/ class cYObject* PutTotedMedVicOnHeli();
	/*unpacked*/ class cYObject* PutTotedMedVicOn(/*unpacked*/ struct _DYOBJ_INST*);
	unsigned short SetStartingObject(/*unpacked*/ struct _DYOBJ_INST*);
	/*unpacked*/ class cYObject* DropToted();
	/*unpacked*/ class cYObject* GetToted();
	unsigned short GetOffMasterObject();
	// calltype: NearC
	static unsigned short IsHigherThan(/*unpacked*/ struct Point3d, short);
	// calltype: NearC
	static unsigned short IsFlattenedTerrain(/*unpacked*/ struct _CELL_INFO*);
	// calltype: NearC
	static void RandomEdgeOffset(short, int32_t *, int32_t *);
	// calltype: NearC
	static void RandomOffset(short, int32_t *, int32_t *);
	virtual void Reset(); // vtable+0x18
	virtual void ~cYObject() /* override */;
protected:
	virtual void Error(short) /* override */;
	void cYObject(short, /*unpacked*/ class Behavior*, /*unpacked*/ struct Point3d, short);
public:
	/*unpacked*/ struct cYObject::ObjDefHeader* GetDef();
	void GetTypeName(char *);
	// calltype: NearC
	static /*unpacked*/ class ResFile* GetGlobalFile();
	// calltype: NearC
	static /*unpacked*/ class YObjLang* GetLanguage();
	// calltype: NearC
	static /*unpacked*/ class ResFile* GetErrorFile();
	short GetID();
	/*unpacked*/ struct Point3d GetLocation();
	/*unpacked*/ class Behavior* GetBehavior();
	void Draw(/*unpacked*/ struct VRBlit*);
	/*+0x164*/ float fScale;
	void DefaultDrawStr(short, short, unsigned char, unsigned char *, int32_t);
	void SetCellAndLoc(/*unpacked*/ struct Point3d, unsigned char, unsigned char);
	void SetCellAndLoc(unsigned char, unsigned char, int32_t, int32_t);
	void Start(int32_t, int32_t, int32_t, int32_t);
	unsigned short BeamIntoCameraRange();
	unsigned short OutOfCameraRange();
	unsigned short CanPlace(/*unpacked*/ struct Point3d);
	void AdjustRadiusForRiotVal();
	unsigned short HasRiotValChanged();
	void IncrementRiotVal(short);
	void GetSurroundingRiotInfo(short, short *, short *, short *);
	void Turn(short);
	/*unpacked*/ class cYObject* GetNext();
	void DynEffects(short, enum cYObject::MoveErrorCode, /*unpacked*/ struct cYObject::MoveInfo*);
	void DynEffectsFixed(int32_t, enum cYObject::MoveErrorCode, /*unpacked*/ struct cYObject::MoveInfo*);
	using PrimProc = enum TreeSim::ReturnCode (*)(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
public:
	static enum TreeSim::ReturnCode (*PrimProcs[64])(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIdle(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIdle(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSetAnim(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSetAnim(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sAttr(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iAttr(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sWalk(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iWalk(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSetBody(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSetBody(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sRandom(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iRandom(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sWalkToAndGrabOntoStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iWalkToAndGrabOntoStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sUpdateMyMission(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iUpdateMyMission(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCheckForTrue(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCheckForTrue(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCompareMyLocWith(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCompareMyLocWith(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSelfDecommission(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSelfDecommission(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetOffMasterObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetOffMasterObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnTowardsStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnTowardsStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIsThisLocType(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIsThisLocType(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIsThisLocTypeNeutral(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIsThisLocTypeNeutral(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCanJumpOffHere(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCanJumpOffHere(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCheckForSpotlightInMyCell(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCheckForSpotlightInMyCell(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIncrementRiotVal(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIncrementRiotVal(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetSurroundingRiotVal(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetSurroundingRiotVal(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIsThisScurkID(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIsThisScurkID(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGosubToInitbhav(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGosubToInitbhav(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sAdjustRadiusForRiotVal(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iAdjustRadiusForRiotVal(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sJoinRiot(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iJoinRiot(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSetDirection(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSetDirection(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sThrowProjectile(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iThrowProjectile(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnFromStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnFromStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnFromLastHitter(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnFromLastHitter(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnTowardsLastHitter(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnTowardsLastHitter(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetOutOfRoadEtc(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetOutOfRoadEtc(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGenerateMedevacAndSetSelfAsVictim(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGenerateMedevacAndSetSelfAsVictim(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTurnToNearbyFire(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTurnToNearbyFire(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sDie(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iDie(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sWalkToStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iWalkToStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sPutObjIntoTreeNum(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iPutObjIntoTreeNum(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sVisitOz(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iVisitOz(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sMakeMyMedevacVictimVisible(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iMakeMyMedevacVictimVisible(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sMakeMyMedevacVictimInvisible(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iMakeMyMedevacVictimInvisible(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sMakeMeMasterOfStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iMakeMeMasterOfStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sMakeMyStackObjectVisitOz(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iMakeMyStackObjectVisitOz(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sPutTotedMedVicOnStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iPutTotedMedVicOnStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTakeAnyMedVicOffStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTakeAnyMedVicOffStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetOnStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetOnStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sUpdateStackVictimToted(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iUpdateStackVictimToted(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetNumSpacesOnStackObject(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetNumSpacesOnStackObject(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sDropToted(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iDropToted(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sUpdateStackVictimPickedUp(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iUpdateStackVictimPickedUp(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sCloseToHeli(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iCloseToHeli(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sSetMyExpression(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iSetMyExpression(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetHeliSpeedPlusDamage(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetHeliSpeedPlusDamage(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sIsThisCellSafe(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iIsThisCellSafe(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sPlaySound(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iPlaySound(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sGetOnHeliIfHarnessRaised(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iGetOnHeliIfHarnessRaised(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sAmIOnHeli(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iAmIOnHeli(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sThrowFieryProjectile(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iThrowFieryProjectile(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sTellStartingObjectTrueOrFalse(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iTellStartingObjectTrueOrFalse(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sPutMyCarInStack(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iPutMyCarInStack(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	// calltype: NearC
	static enum TreeSim::ReturnCode sDoIHaveAMaster(/*unpacked*/ class cYObject*, /*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
	enum TreeSim::ReturnCode iDoIHaveAMaster(/*unpacked*/ struct TreeSim::StackElem*, /*unpacked*/ struct Behavior::Node*);
};

// Type: /*unpacked*/ class FlatResFile;
// VTABLE: COPTER_D 0x00593508
class FlatResFile : public FlatFile
{ // not packed(0x11c bytes) TI: 0x330e
protected:
	/*+0x110*/ /*unpacked*/ class ResMap *fMap;
	/*+0x114*/ long fError;
	/*+0x118*/ short _alignPad; // 0x2 bytes
public:
	void FlatResFile();
	virtual void ~FlatResFile() /* override */;
	void LoadResMap(void * __ptr32*, short *, long *);
	unsigned short FileEquals(/*unpacked*/ class FlatResFile*);
	virtual long Open(unsigned char *) /* override */;
	virtual long Open(char *) /* override */;
	long OpenFromName();
	virtual long Close() /* override */;
	short CountTypes();
	unsigned long GetIndType(short);
	short Count(unsigned long);
	void * __ptr32 GetByID(unsigned long, short, void (*)(void * __ptr32, long));
	void * __ptr32 GetByName(unsigned long, unsigned char *, void (*)(void * __ptr32, long));
	void * __ptr32 GetByIndex(unsigned long, short, void (*)(void * __ptr32, long));
	void GetName(void * __ptr32, unsigned char *);
	void GetID(void * __ptr32, short *);
	unsigned long GetResType(void * __ptr32);
	void Release(void * __ptr32);
	void Detach(void * __ptr32);
	void Load(void * __ptr32);
	long GetError();
	void Add(void * __ptr32, unsigned long, short, unsigned char *);
	void ExclusiveAdd(void * __ptr32, unsigned long, short, unsigned char *);
	void FindUniqueName(unsigned long, unsigned char *);
	short FindUniqueID(unsigned long);
	void Write(void * __ptr32);
	void Remove(void * __ptr32);
	void GetString(unsigned char *, short, short);
	// calltype: NearC
	static short CheckForLeaks();
};

// Type: /*unpacked*/ class Sound;
// VTABLE: COPTER_D 0x0058f458
class Sound{ // not packed(0x34 bytes) TI: 0x4733
	enum SoundSourceType {
		nSoundSourceTypeResource = 0,
		nSoundSourceTypeFile = 1,
	};
public:
	/*+0x4*/   enum Sound::SoundSourceType nSoundSourceType;
	enum SoundDuplicateType {
		nSoundDuplicateDefault = 0,
		nSoundDuplicateInterrupt = 1,
		nSoundDuplicateContinue = 2,
		nSoundDuplicateOverlap = 3,
	};
public:
	/*+0x8*/   enum Sound::SoundDuplicateType nSoundDuplicateType;
	/*+0xc*/   long lID;
	/*+0x10*/  long lResID;
	/*+0x14*/  /*unpacked*/ class basic_string<char> sSoundFile; // 0x8 bytes
	/*+0x1c*/  long bLooping;
	/*+0x20*/  long bStreaming;
	/*+0x24*/  long lVolume;
	/*+0x28*/  void (*soundCompletionFunction)(long);
	/*+0x2c*/  long lSoundCompletionData;
	/*+0x30*/  int32_t bUnloadBeforeNextPlay;
	void Sound();
	virtual void ~Sound(); // vtable+0x0
	/*unpacked*/ class Sound& operator=(const /*unpacked*/ class Sound&);
	virtual void SetSoundFile(const /*unpacked*/ class basic_string<char>&); // vtable+0x4
	virtual long Play(long, int32_t); // vtable+0x8
	virtual long Stop(); // vtable+0xc
	virtual long IsPlaying(); // vtable+0x10
	virtual int32_t SetCompletionNotification(void (*)(long), long); // vtable+0x14
	virtual void StopCompletionNotification(); // vtable+0x18
	virtual long EstimateRemainingPlayTime(); // vtable+0x1c
	virtual int32_t GetVolume(long *); // vtable+0x20
	virtual int32_t SetVolume(long); // vtable+0x24
	virtual int32_t GetSoundType(); // vtable+0x28
	// calltype: NearC
	static unsigned long GetTotalMemoryUsage();
	static unsigned long lTotalMemoryUsage;
};

// Type: /*unpacked*/ class IBackBuffer;
// VTABLE: COPTER_D 0x005907e0
class IBackBuffer : public IFlatImage
{ // not packed(0x18 bytes) TI: 0x3e3c
public:
	virtual unsigned long Swap(/*unpacked*/ class CSparkalWindow*, long, long); // vtable+0x1c
	virtual unsigned long SwapRect(/*unpacked*/ class CSparkalWindow*, long, long, long, long, long, long); // vtable+0x20
	virtual unsigned long StretchRect(/*unpacked*/ class CSparkalWindow*, long, long, long, long, long, long, long, long); // vtable+0x24
};

// Type: /*unpacked*/ class FlatFile;
// VTABLE: COPTER_D 0x00593620
class FlatFile{ // not packed(0x110 bytes) TI: 0x32f4
	enum /* __unnamed */ {
		kMaxNameLen = 255,
	};
protected:
	/*+0x4*/   /*unpacked*/ class FlatFile *fNext;
	/*+0x8*/   unsigned char fName[256]; // 0x100 bytes
	/*+0x108*/ long fFileID;
	/*+0x10c*/ /*unpacked*/ struct _iobuf *fFile;
	long UniqueID();
private:
	static /*unpacked*/ class FlatFile *sList;
	static long sLastFileID;
	void Link();
	void Unlink();
	unsigned short Exclusive();
public:
	void FlatFile();
	virtual void ~FlatFile(); // vtable+0x0
	// calltype: NearC
	static /*unpacked*/ class FlatFile* FindByName(unsigned char *);
	unsigned short SameFile(/*unpacked*/ class FlatFile*);
	virtual long Open(unsigned char *); // vtable+0x4
	virtual long Open(char *); // vtable+0x8
	virtual long Close(); // vtable+0xc
	void OpenFromOtherFile(/*unpacked*/ class FlatFile*);
	long GetFileName(unsigned char *);
	unsigned short ValidFile();
	long ReadBlock(void * __ptr32, long *);
	long Read4(long *);
	long Read2(short *);
	long Read1(signed char *);
	long SetPos(long);
	long Advance(long);
	// calltype: NearC
	static short CheckForLeaks();
	long GetFileID();
	/*unpacked*/ struct _iobuf* GetFile();
};

// Type: /*unpacked*/ class IFlatImage;
// VTABLE: COPTER_D 0x00591050
class IFlatImage{ // not packed(0x18 bytes) TI: 0x3e30
public:
	void IFlatImage();
	virtual unsigned long Lock(); // vtable+0x0
	virtual unsigned long Unlock(); // vtable+0x4
	unsigned long GetLockCount();
	virtual void SetTransparentColor(int32_t, long); // vtable+0x8
	long GetHeight();
	long GetWidth();
	void * __ptr32 GetBitsPointer();
	long GetStride();
	virtual unsigned long Compose(/*unpacked*/ class IFlatImage*, long, long, long, long, long, long); // vtable+0xc
	unsigned long Compose(/*unpacked*/ class IFlatImage*, long, long);
	virtual unsigned long StretchCompose(/*unpacked*/ class IFlatImage*, long, long, long, long, long, long, long, long); // vtable+0x10
	virtual unsigned long StretchCompose(/*unpacked*/ class IFlatImage*, /*unpacked*/ struct SparkalRect, /*unpacked*/ struct SparkalRect); // vtable+0x14
	virtual unsigned long FillRect(long, /*unpacked*/ struct SparkalRect*); // vtable+0x18
	void DrawPixel(unsigned char, long, long);
	unsigned char GetPixel(long, long);
	static unsigned long lTotalMemoryUsage;
	static unsigned long lTotalLockCount;
protected:
	/*+0x4*/   unsigned long mLockCount;
	/*+0x8*/   long mWidth;
	/*+0xc*/   long mHeight;
	/*+0x10*/  void * __ptr32 mpBits;
	/*+0x14*/  long mStride;
};



// Contribution: 1:00142f70-00150d97 Module: 200, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00543f70
static void $E75() {

	__asm        call   $E71;
	__asm        call   $E74;
	__asm        jmp    near ptr 0x00543F85;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00543f8a
static void $E71() {
	// Function registers exception cleanup function at 0x00544088

	__asm        mov    ecx, 0x636BB8;
	__asm        call   FlatFile::FlatFile;
	__asm        mov    dword ptr [ebp-4], 0;
	__asm        mov    cYObject::sFile<NResFile+0x00>, 0x593508;
	__asm        mov    cYObject::sFile.fError, 0;
	__asm        mov    cYObject::sFile.fMap, 0;
	__asm        jmp    near ptr 0x00543FDC;

	__asm        mov    dword ptr [ebp-4], 0xFFFFFFFF;
	__asm        mov    dword ptr [ebp-0x10], 0x636BB8;
	__asm        jmp    _T70;
_L55004:
	__asm        mov    ecx, 0x636BB8;
	__asm        call   FlatFile::~FlatFile;
