// Module: Compress.obj
// Source: C:\Copter\source\sparkal\Compress.cpp
// autogenerated by simcopter_tool from PDB file

// Type: unsigned short *;

// Type: /*packed*/ class CRLECompressedImage (forward reference);
class CRLECompressedImage{ // packed(0xc bytes) TI: 0x2b8a
public:
	static unsigned short * RLEGraphicsPool;
	// calltype: NearC
	static void * __ptr32 operator new(uint32_t);
	// calltype: NearC
	static void operator delete(void * __ptr32);
	void CRLECompressedImage(const /*packed*/ class CFlatImage*, long, long, long, long, int32_t);
	void CRLECompressedImage(long);
	void ~CRLECompressedImage();
	unsigned long Lock();
	unsigned long Unlock();
	long GetHeight();
	long GetWidth();
	unsigned long Compose(/*unpacked*/ class IFlatImage*, long, long, long, long, long, long);
	unsigned long Compose(/*unpacked*/ class IFlatImage*, long, long);
protected:
	/*+0x0*/   void * __ptr32 mhRLEImage;
	/*+0x4*/   /*packed*/ struct RLEHeader *mpLockedImage;
	/*+0x8*/   unsigned long mLockCount;
};

// Type: long;

// Type: int32_t;

// Type: /*unpacked*/ class ifstream;
// VTABLE: COPTER_D 0x00593e2c
class ifstream : public virtual ios, public istream, public virtual <indirect> ios
{ // not packed(0x5c bytes) TI: 0x2177
public:
	void ifstream(int32_t, char *, int32_t);
	void ifstream(int32_t);
	void ifstream(char *, int32_t, int32_t);
	void ifstream();
	virtual void ~ifstream() /* override */;
	/*unpacked*/ class streambuf* setbuf(char *, int32_t);
	/*unpacked*/ class filebuf* rdbuf();
	void attach(int32_t);
	int32_t fd();
	int32_t is_open();
	void open(char *, int32_t, int32_t);
	void close();
	int32_t setmode(int32_t);
};

// Type: char;

// Type: /*unpacked*/ class ostrstream;
// VTABLE: COPTER_D 0x00593b34
class ostrstream : public ostream, public virtual <indirect> ios
{ // not packed(0x58 bytes) TI: 0x217a
public:
	int32_t *ios[0];
	void ostrstream(char *, int32_t, int32_t);
	void ostrstream();
	virtual void ~ostrstream() /* override */;
	int32_t pcount();
	/*unpacked*/ class strstreambuf* rdbuf();
	char * str();
};

// Type: void;

// Type: unsigned long;

// Type: /*packed*/ struct RLEHeader (forward reference);
struct RLEHeader{ // packed(0x8 bytes) TI: 0x218b
	/*+0x0*/   short Width; // 0x2 bytes
	/*+0x2*/   short Height; // 0x2 bytes
	/*+0x4*/   short XOffset; // 0x2 bytes
	/*+0x6*/   short YOffset; // 0x2 bytes
};

// Type: /*packed*/ class CFlatImage (forward reference);
// VTABLE: COPTER_D 0x00591070
class CFlatImage : public IFlatImage
{ // packed(0x1c bytes) TI: 0x20e3
public:
	void CFlatImage(/*unpacked*/ class IFlatImage*, long, long, long, long);
	void CFlatImage(long, long, unsigned char);
	void CFlatImage();
	virtual void ~CFlatImage(); // vtable+0x1c
	virtual unsigned long Lock() /* override */;
	virtual unsigned long Unlock() /* override */;
protected:
	/*+0x18*/  void * __ptr32 mBitsHandle;
};

// Type: /*packed*/ class IFlatImage (forward reference);
// VTABLE: COPTER_D 0x00591050
class IFlatImage{ // packed(0x18 bytes) TI: 0x13a1
public:
	void IFlatImage();
	virtual unsigned long Lock(); // vtable+0x0
	virtual unsigned long Unlock(); // vtable+0x4
	unsigned long GetLockCount();
	virtual void SetTransparentColor(int32_t, long); // vtable+0x8
	long GetHeight();
	long GetWidth();
	void * __ptr32 GetBitsPointer();
	long GetStride();
	virtual unsigned long Compose(/*packed*/ class IFlatImage*, long, long, long, long, long, long); // vtable+0xc
	unsigned long Compose(/*packed*/ class IFlatImage*, long, long);
	virtual unsigned long StretchCompose(/*packed*/ class IFlatImage*, long, long, long, long, long, long, long, long); // vtable+0x10
	virtual unsigned long StretchCompose(/*packed*/ class IFlatImage*, /*packed*/ struct SparkalRect, /*packed*/ struct SparkalRect); // vtable+0x14
	virtual unsigned long FillRect(long, /*packed*/ struct SparkalRect*); // vtable+0x18
	void DrawPixel(unsigned char, long, long);
	unsigned char GetPixel(long, long);
	static unsigned long lTotalMemoryUsage;
	static unsigned long lTotalLockCount;
protected:
	/*+0x4*/   unsigned long mLockCount;
	/*+0x8*/   long mWidth;
	/*+0xc*/   long mHeight;
	/*+0x10*/  void * __ptr32 mpBits;
	/*+0x14*/  long mStride;
};

// Type: unsigned char *;

// Type: short;

// Type: unsigned char;

// Type: /*unpacked*/ class IFlatImage (forward reference);
// IFlatImage Class implementation not found

// Type: /*unpacked*/ class ios (forward reference);
// ios Class implementation not found

// Type: /*unpacked*/ class istream;
// VTABLE: COPTER_D 0x00593ea4
class istream : public virtual ios
{ // not packed(0x5c bytes) TI: 0x4177
public:
	int32_t *ios[0];
	void istream(/*unpacked*/ class ios&);
	void istream(const /*unpacked*/ class istream&);
	void istream();
	void istream(/*unpacked*/ class streambuf*);
	virtual void ~istream() /* override */;
	int32_t ipfx(int32_t);
	void isfx();
	/*unpacked*/ class istream& operator>>(/*unpacked*/ class streambuf*);
	/*unpacked*/ class istream& operator>>(double&);
	/*unpacked*/ class istream& operator>>(double&);
	/*unpacked*/ class istream& operator>>(float&);
	/*unpacked*/ class istream& operator>>(unsigned long&);
	/*unpacked*/ class istream& operator>>(long&);
	/*unpacked*/ class istream& operator>>(uint32_t&);
	/*unpacked*/ class istream& operator>>(int32_t&);
	/*unpacked*/ class istream& operator>>(unsigned short&);
	/*unpacked*/ class istream& operator>>(short&);
	/*unpacked*/ class istream& operator>>(signed char&);
	/*unpacked*/ class istream& operator>>(unsigned char&);
	/*unpacked*/ class istream& operator>>(char&);
	/*unpacked*/ class istream& operator>>(signed char *);
	/*unpacked*/ class istream& operator>>(unsigned char *);
	/*unpacked*/ class istream& operator>>(char *);
	/*unpacked*/ class istream& operator>>(/*unpacked*/ class ios& (*)(/*unpacked*/ class ios&));
	/*unpacked*/ class istream& operator>>(/*unpacked*/ class istream& (*)(/*unpacked*/ class istream&));
	/*unpacked*/ class istream& get(char *, int32_t, int32_t);
	/*unpacked*/ class istream& get(/*unpacked*/ class streambuf&, char);
	/*unpacked*/ class istream& get(signed char&);
	/*unpacked*/ class istream& get(unsigned char&);
	/*unpacked*/ class istream& get(char&);
	/*unpacked*/ class istream& get(signed char *, int32_t, char);
	/*unpacked*/ class istream& get(unsigned char *, int32_t, char);
	/*unpacked*/ class istream& get(char *, int32_t, char);
	int32_t get();
	/*unpacked*/ class istream& getline(signed char *, int32_t, char);
	/*unpacked*/ class istream& getline(unsigned char *, int32_t, char);
	/*unpacked*/ class istream& getline(char *, int32_t, char);
	/*unpacked*/ class istream& ignore(int32_t, int32_t);
	/*unpacked*/ class istream& read(signed char *, int32_t);
	/*unpacked*/ class istream& read(unsigned char *, int32_t);
	/*unpacked*/ class istream& read(char *, int32_t);
	int32_t gcount();
	int32_t peek();
	/*unpacked*/ class istream& putback(char);
	int32_t sync();
	/*unpacked*/ class istream& seekg(long, enum ios::seek_dir);
	/*unpacked*/ class istream& seekg(long);
	long tellg();
	void eatwhite();
protected:
	/*unpacked*/ class istream& operator=(const /*unpacked*/ class istream&);
	/*unpacked*/ class istream& operator=(/*unpacked*/ class streambuf*);
	int32_t do_ipfx(int32_t);
private:
	int32_t getint(char *);
	int32_t getdouble(char *, int32_t);
	/*+0x4*/   int32_t _fGline;
	/*+0x8*/   int32_t x_gcount;
};

// Type: /*unpacked*/ class ios;
// VTABLE: COPTER_D 0x00593ad4
class ios{ // not packed(0x50 bytes) TI: 0x4126
	enum io_state {
		goodbit = 0,
		eofbit = 1,
		failbit = 2,
		badbit = 4,
	};
	enum open_mode {
		in = 1,
		out = 2,
		ate = 4,
		app = 8,
		trunc = 16,
		nocreate = 32,
		noreplace = 64,
		binary = 128,
	};
	enum seek_dir {
		beg = 0,
		cur = 1,
		end = 2,
	};
	enum /* __unnamed */ {
		skipws = 1,
		left = 2,
		right = 4,
		internal = 8,
		dec = 16,
		oct = 32,
		hex = 64,
		showbase = 128,
		showpoint = 256,
		uppercase = 512,
		showpos = 1024,
		scientific = 2048,
		fixed = 4096,
		unitbuf = 8192,
		stdio = 16384,
	};
public:
	static const long basefield;
	static const long adjustfield;
	static const long floatfield;
	void ios(const /*unpacked*/ class ios&);
	void ios();
	void ios(/*unpacked*/ class streambuf*);
	virtual void ~ios(); // vtable+0x0
	long flags(long);
	long flags();
	long setf(long);
	long setf(long, long);
	long unsetf(long);
	int32_t width(int32_t);
	int32_t width();
	/*unpacked*/ class ostream* tie();
	/*unpacked*/ class ostream* tie(/*unpacked*/ class ostream*);
	char fill(char);
	char fill();
	int32_t precision();
	int32_t precision(int32_t);
	int32_t rdstate();
	void clear(int32_t);
	void * __ptr32 operator void *();
	int32_t operator!();
	int32_t good();
	int32_t eof();
	int32_t fail();
	int32_t bad();
	/*unpacked*/ class streambuf* rdbuf();
	long& iword(int32_t);
	void * __ptr32& pword(int32_t);
	// calltype: NearC
	static long bitalloc();
	// calltype: NearC
	static int32_t xalloc();
	// calltype: NearC
	static void sync_with_stdio();
	// calltype: NearC
	void setlock();
	// calltype: NearC
	void clrlock();
	// calltype: NearC
	void lock();
	// calltype: NearC
	void unlock();
	// calltype: NearC
	void lockbuf();
	// calltype: NearC
	void unlockbuf();
protected:
	/*unpacked*/ class ios& operator=(const /*unpacked*/ class ios&);
	void init(/*unpacked*/ class streambuf*);
	enum /* __unnamed */ {
		skipping = 0,
		tied = 1,
	};
protected:
	/*+0x4*/   /*unpacked*/ class streambuf *bp;
	/*+0x8*/   int32_t state;
	/*+0xc*/   int32_t ispecial;
	/*+0x10*/  int32_t ospecial;
	/*+0x14*/  int32_t isfx_special;
	/*+0x18*/  int32_t osfx_special;
	/*+0x1c*/  int32_t x_delbuf;
	/*+0x20*/  /*unpacked*/ class ostream *x_tie;
	/*+0x24*/  long x_flags;
	/*+0x28*/  int32_t x_precision;
	/*+0x2c*/  char x_fill; // 0x1 bytes
	/*+0x30*/  int32_t x_width;
	static void (*stdioflush)();
	// calltype: NearC
	static void lockc();
	// calltype: NearC
	static void unlockc();
	/*unpacked*/ struct _CRT_CRITICAL_SECTION* lockptr();
public:
	void delbuf(int32_t);
	int32_t delbuf();
private:
	static long x_maxbit;
	static int32_t x_curindex;
	static int32_t sunk_with_stdio;
	static long x_statebuf[8];
	static int32_t fLockcInit;
	static /*unpacked*/ struct _CRT_CRITICAL_SECTION x_lockc;
	/*+0x34*/  int32_t LockFlg;
	/*+0x38*/  /*unpacked*/ struct _CRT_CRITICAL_SECTION x_lock; // 0x18 bytes
};

// Type: /*unpacked*/ class ostream (forward reference);
// ostream Class implementation not found



// Contribution: 1:000a9800-000aa528 Module: 7, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004aa800
void CRLECompressedImage::CRLECompressedImage(long ResourceID) {
	/*bp-0x58*/  /*unpacked*/ class ostrstream NameOut; // 0x58 bytes
	/*bp-0x68*/  char FileName[13]; // 0xd bytes
	/*bp-0xc4*/  /*unpacked*/ class ifstream InputFile; // 0x5c bytes
	/*bp-0xc8*/  int32_t InputMode;


	this->mhRLEImage = 0x0;
	this->mpLockedImage = 0x0;
	this->mLockCount = 0x0;
// LINE 51:
	__asm        push   1;
	__asm        push   2;
	__asm        push   0xD;
	__asm        lea    eax, FileName[0];
	__asm        push   eax;
	__asm        lea    ecx, NameOut.ios;
	__asm        call   ostrstream::ostrstream;
// LINE 52:
	__asm        push   0x59A9D8;
