// Module: ddrawhlp.obj
// Source: C:\Copter\source\sparkal\ddrawhlp.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct IDirectDraw (forward reference);
struct IDirectDraw{ // packed(0x4 bytes) TI: 0x275c
	/*+0x0*/   /*packed*/ struct IDirectDrawVtbl *lpVtbl;
};

// Type: /*packed*/ struct IDirectDrawPalette (forward reference);
struct IDirectDrawPalette{ // packed(0x4 bytes) TI: 0x2760
	/*+0x0*/   /*packed*/ struct IDirectDrawPaletteVtbl *lpVtbl;
};

// Type: /*packed*/ struct _DDCAPS;
struct _DDCAPS{ // packed(0xac bytes) TI: 0x1a7b
	/*+0x0*/   unsigned long dwSize;
	/*+0x4*/   unsigned long dwCaps;
	/*+0x8*/   unsigned long dwCaps2;
	/*+0xc*/   unsigned long dwCKeyCaps;
	/*+0x10*/  unsigned long dwFXCaps;
	/*+0x14*/  unsigned long dwFXAlphaCaps;
	/*+0x18*/  unsigned long dwPalCaps;
	/*+0x1c*/  unsigned long dwSVCaps;
	/*+0x20*/  unsigned long dwAlphaBltConstBitDepths;
	/*+0x24*/  unsigned long dwAlphaBltPixelBitDepths;
	/*+0x28*/  unsigned long dwAlphaBltSurfaceBitDepths;
	/*+0x2c*/  unsigned long dwAlphaOverlayConstBitDepths;
	/*+0x30*/  unsigned long dwAlphaOverlayPixelBitDepths;
	/*+0x34*/  unsigned long dwAlphaOverlaySurfaceBitDepths;
	/*+0x38*/  unsigned long dwZBufferBitDepths;
	/*+0x3c*/  unsigned long dwVidMemTotal;
	/*+0x40*/  unsigned long dwVidMemFree;
	/*+0x44*/  unsigned long dwMaxVisibleOverlays;
	/*+0x48*/  unsigned long dwCurrVisibleOverlays;
	/*+0x4c*/  unsigned long dwNumFourCCCodes;
	/*+0x50*/  unsigned long dwAlignBoundarySrc;
	/*+0x54*/  unsigned long dwAlignSizeSrc;
	/*+0x58*/  unsigned long dwAlignBoundaryDest;
	/*+0x5c*/  unsigned long dwAlignSizeDest;
	/*+0x60*/  unsigned long dwAlignStrideAlign;
	/*+0x64*/  unsigned long dwRops[8]; // 0x20 bytes
	/*+0x84*/  /*packed*/ struct _DDSCAPS ddsCaps;
	/*+0x88*/  unsigned long dwMinOverlayStretch;
	/*+0x8c*/  unsigned long dwMaxOverlayStretch;
	/*+0x90*/  unsigned long dwMinLiveVideoStretch;
	/*+0x94*/  unsigned long dwMaxLiveVideoStretch;
	/*+0x98*/  unsigned long dwMinHwCodecStretch;
	/*+0x9c*/  unsigned long dwMaxHwCodecStretch;
	/*+0xa0*/  unsigned long dwReserved1;
	/*+0xa4*/  unsigned long dwReserved2;
	/*+0xa8*/  unsigned long dwReserved3;
};

// Type: long;

// Type: void;

// Type: /*packed*/ struct IDirectDrawSurface (forward reference);
struct IDirectDrawSurface{ // packed(0x4 bytes) TI: 0x2764
	/*+0x0*/   /*packed*/ struct IDirectDrawSurfaceVtbl *lpVtbl;
};

// Type: unsigned long;

// Type: void * __ptr32;

// Type: /*packed*/ struct _DDSURFACEDESC;
struct _DDSURFACEDESC{ // packed(0x6c bytes) TI: 0x1737
	/*+0x0*/   unsigned long dwSize;
	/*+0x4*/   unsigned long dwFlags;
	/*+0x8*/   unsigned long dwHeight;
	/*+0xc*/   unsigned long dwWidth;
	/*+0x10*/  long lPitch;
	/*+0x14*/  unsigned long dwBackBufferCount;
	/*+0x18*/  unsigned long dwZBufferBitDepth;
	/*+0x1c*/  unsigned long dwAlphaBitDepth;
	/*+0x20*/  unsigned long dwReserved;
	/*+0x24*/  void * __ptr32 lpSurface;
	/*+0x28*/  /*packed*/ struct _DDCOLORKEY ddckCKDestOverlay; // 0x8 bytes
	/*+0x30*/  /*packed*/ struct _DDCOLORKEY ddckCKDestBlt; // 0x8 bytes
	/*+0x38*/  /*packed*/ struct _DDCOLORKEY ddckCKSrcOverlay; // 0x8 bytes
	/*+0x40*/  /*packed*/ struct _DDCOLORKEY ddckCKSrcBlt; // 0x8 bytes
	/*+0x48*/  /*packed*/ struct _DDPIXELFORMAT ddpfPixelFormat; // 0x20 bytes
	/*+0x68*/  /*packed*/ struct _DDSCAPS ddsCaps;
};

// Type: char *;

// Type: /*packed*/ struct ReadPalFile::__unnamed;
struct ReadPalFile::__unnamed{ // packed(0x418 bytes) TI: 0x2bdc
	/*+0x0*/   unsigned long dwRiff;
	/*+0x4*/   unsigned long dwFileSize;
	/*+0x8*/   unsigned long dwPal;
	/*+0xc*/   unsigned long dwData;
	/*+0x10*/  unsigned long dwDataSize;
	/*+0x14*/  unsigned short palVersion; // 0x2 bytes
	/*+0x16*/  unsigned short palNumEntries; // 0x2 bytes
	/*+0x18*/  /*packed*/ struct tagPALETTEENTRY ape[256]; // 0x400 bytes
};

// Type: int32_t;



// Contribution: 1:0001e500-0001e869 Module: 74, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x0041f500
long DDEnable() {
	/*bp-0x4*/   long hResult;

// LINE 33:
	__asm        cmp    lpDD, 0;
	__asm        jne    _T27;
// LINE 34:
	__asm        push   0;
	__asm        push   0x597264;
	__asm        push   0;
	__asm        call   0x004C4612;
	__asm        mov    hResult, eax;
// LINE 35:
_T27:
	__asm        cmp    hResult, 0;
	__asm        je     _T39;
// LINE 36:
	return hResult;
// LINE 38:
_T39:
	ddCaps.dwSize = 0xac;
// LINE 39:
	__asm        push   0;
	__asm        push   0x5C2798;
	__asm        mov    eax, lpDD;
	__asm        push   eax;
	__asm        mov    eax, lpDD;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+0x2C];
	__asm        mov    hResult, eax;
// LINE 40:
	__asm        cmp    hResult, 0;
	__asm        je     _T99;
// LINE 41:
_T67:
	__asm        mov    eax, lpDD;
	__asm        push   eax;
	__asm        mov    eax, lpDD;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+8];
	__asm        cmp    eax, 0x8876021C;
	__asm        jne    _T87;

	__asm        jmp    _T67;
// LINE 42:
_T87:
	lpDD = 0x0;
// LINE 43:
	return hResult;
// LINE 47:
_T99:
	return 0x0;
// LINE 49:
}

// FUNCTION: COPTER_D 0x0041f5a5
void DDDisable() {
// LINE 60:
	__asm        cmp    lpDD, 0;
	__asm        jne    _T18;
// LINE 61:
	return;
// LINE 65:
_T18:
	__asm        mov    eax, lpDD;
	__asm        push   eax;
	__asm        mov    eax, lpDD;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+8];
	__asm        cmp    eax, 0x8876021C;
	__asm        jne    _T38;

	__asm        jmp    _T18;
// LINE 66:
_T38:
	lpDD = 0x0;
// LINE 70:
	return;
}

// FUNCTION: COPTER_D 0x0041f5f1
unsigned long DDColorMatch(/*packed*/ struct IDirectDrawSurface *pdds, unsigned long rgb) {
	/*bp-0x6c*/  /*packed*/ struct _DDSURFACEDESC ddsd; // 0x6c bytes
	/*bp-0x70*/  long hres;
	/*bp-0x74*/  void * __ptr32 hdc;
	/*bp-0x78*/  unsigned long dw;
	/*bp-0x7c*/  unsigned long rgbT;

// LINE 87:
	dw = 0xffffffff;
// LINE 91:
	__asm        lea    eax, hdc;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+0x44];
	__asm        test   eax, eax;
	__asm        jne    _T5b;
// LINE 93:
	__asm        push   0;
	__asm        push   0;
	__asm        mov    eax, hdc;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3550];
	__asm        mov    rgbT, eax;
// LINE 94:
	__asm        mov    eax, rgb;
	__asm        push   eax;
	__asm        push   0;
	__asm        push   0;
	__asm        mov    eax, hdc;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C354C];
// LINE 95:
	__asm        mov    eax, hdc;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+0x68];
// LINE 98:
_T5b:
	ddsd.dwSize = 0x6c;
// LINE 99:
	__asm        push   0;
	__asm        push   1;
	__asm        lea    eax, ddsd.dwSize;
	__asm        push   eax;
	__asm        push   0;
	__asm        mov    eax, pdds;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+0x64];
	__asm        mov    hres, eax;
// LINE 101:
	__asm        cmp    hres, 0;
	__asm        jne    _Tac;
// LINE 103:
	__asm        mov    eax, ddsd.lpSurface;
	__asm        mov    eax, [eax];
	__asm        mov    dw, eax;
// LINE 104:
	__asm        mov    eax, 1;
	__asm        mov    cl, reinterpret_cast<uint8_t>(ddsd.ddpfPixelFormat.dwZBufferBitDepth);
	__asm        shl    eax, cl;
	__asm        dec    eax;
	__asm        and    dw, eax;
// LINE 105:
	__asm        push   0;
	__asm        mov    eax, pdds;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+0x80];
// LINE 108:
_Tac:
	__asm        lea    eax, hdc;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+0x44];
	__asm        test   eax, eax;
	__asm        jne    _Te6;
// LINE 110:
	__asm        mov    eax, rgbT;
	__asm        push   eax;
	__asm        push   0;
	__asm        push   0;
	__asm        mov    eax, hdc;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C354C];
// LINE 111:
	__asm        mov    eax, hdc;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        push   eax;
	__asm        mov    eax, pdds;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+0x68];
// LINE 114:
_Te6:
	return dw;
// LINE 115:
}

// FUNCTION: COPTER_D 0x0041f6e4
/*packed*/ struct IDirectDrawPalette* ReadPalFile(char * fname) {
	/*bp-0x4*/   /*packed*/ struct IDirectDrawPalette *ppal;
	/*bp-0x8*/   int32_t fh;
	/*bp-0xc*/   int32_t i;
	/*bp-0x10*/  long ddrval;
	/*bp-0x428*/ /*packed*/ struct ReadPalFile::__unnamed pal; // 0x418 bytes

// LINE 143:
	pal.dwRiff = 0x0;
// LINE 145:
	__asm        push   0;
	__asm        mov    eax, fname;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C37C0];
	__asm        mov    fh, eax;
// LINE 147:
	__asm        cmp    fh, 0xFFFFFFFF;
	__asm        je     _T4f;
// LINE 149:
	__asm        push   0x418;
	__asm        lea    eax, pal.dwRiff;
	__asm        push   eax;
	__asm        mov    eax, fh;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C37C4];
// LINE 150:
	__asm        mov    eax, fh;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C374C];
// LINE 162:
_T4f:
	__asm        cmp    pal.dwRiff, 0x46464952;
	__asm        jne    _Tbb;

	__asm        cmp    pal.dwPal, 0x204C4150;
	__asm        jne    _Tbb;

	__asm        cmp    pal.dwData, 0x61746164;
	__asm        jne    _Tbb;

	__asm        mov    eax, reinterpret_cast<uint32_t>(pal.palVersion);
	__asm        and    eax, 0xFFFF;
	__asm        cmp    eax, 0x300;
	__asm        jne    _Tbb;

	__asm        xor    eax, eax;
	__asm        mov    ax, pal.palNumEntries;
	__asm        cmp    eax, 0x100;
	__asm        jg     _Tbb;

	__asm        xor    eax, eax;
	__asm        mov    ax, pal.palNumEntries;
	__asm        cmp    eax, 1;
	__asm        jge    _T157;
// LINE 164:
_Tbb:
	__asm        push   0x59726C;
	__asm        call   DebugOutput;
	__asm        add    esp, 4;
// LINE 166:
	i = 0x0;
	__asm        jmp    _Td7;
_Td4:
	i++;
_Td7:
	__asm        cmp    i, 0x100;
	__asm        jge    _T157;
// LINE 168:
	__asm        mov    eax, i;
	__asm        shr    eax, 5;
	__asm        and    eax, 7;
	__asm        mov    ecx, eax;
	__asm        shl    eax, 8;
	__asm        sub    eax, ecx;
	__asm        mov    ecx, 7;
	__asm        cdq;
	__asm        idiv   ecx;
	__asm        mov    ecx, i;
	__asm        mov    [ebp+ecx*4-0x410], al;
// LINE 169:
	__asm        mov    eax, i;
	__asm        shr    eax, 2;
	__asm        and    eax, 7;
	__asm        mov    ecx, eax;
	__asm        shl    eax, 8;
	__asm        sub    eax, ecx;
	__asm        mov    ecx, 7;
	__asm        cdq;
	__asm        idiv   ecx;
	__asm        mov    ecx, i;
	__asm        mov    [ebp+ecx*4-0x40F], al;
// LINE 170:
	__asm        mov    eax, i;
	__asm        and    eax, 3;
	__asm        mov    ecx, eax;
	__asm        shl    eax, 8;
	__asm        sub    eax, ecx;
	__asm        mov    ecx, 3;
	__asm        cdq;
	__asm        idiv   ecx;
	__asm        mov    ecx, i;
	__asm        mov    [ebp+ecx*4-0x40E], al;
// LINE 171:
	__asm        mov    eax, i;
	__asm        mov    byte ptr [ebp+eax*4-0x40D], 0;
// LINE 172:
	__asm        jmp    _Td4;
// LINE 179:
_T157:
	__asm        push   0;
	__asm        lea    eax, ppal;
	__asm        push   eax;
	__asm        lea    eax, pal.ape[0].peRed;
	__asm        push   eax;
	__asm        push   4;
	__asm        mov    eax, lpDD;
	__asm        push   eax;
	__asm        mov    eax, lpDD;
	__asm        mov    eax, [eax];
	__asm        call   dword ptr [eax+0x14];
	__asm        mov    ddrval, eax;
// LINE 180:
	return ppal;
// LINE 182:
}



// Contribution: 3:00000264-00000297 Module: 74, 4 byte alignment, initialized_data, read, write, 
// GLOBAL: COPTER_D 0x00597264
/*packed*/ struct IDirectDraw *lpDD = { 0 /* todo */ };

// GLOBAL: COPTER_D 0x00597268
/*packed*/ struct IDirectDrawPalette *lpPalette = { 0 /* todo */ };



// Contribution: 3:0002b798-0002b843 Module: 74, 8 byte alignment, uninitialized_data, read, write, 
// GLOBAL: COPTER_D 0x005c2798
/*packed*/ struct _DDCAPS ddCaps;

