// Module: Debug.obj
// Source: C:\Copter\source\sparkal\Debug.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class CDebugWindow (forward reference);
class CDebugWindow{ // packed(0x40 bytes) TI: 0x43eb
public:
	void CDebugWindow();
	void ~CDebugWindow();
	void HandleDebugCommand(char *);
	int32_t Create(char *);
	int32_t Save(char *);
	void ShowWindow();
	void HideWindow();
	void RegisterCommand(/*packed*/ struct debug_command*);
	void UnregisterCommand(/*packed*/ struct debug_command*);
	void OutputString(char *);
	long InstanceWindowProcedure(uint32_t, uint32_t, long);
private:
	/*+0x0*/   /*packed*/ class deque<basic_string<char>> m_strings; // 0x2c bytes
	/*+0x2c*/  /*packed*/ class vector<debug_command *> m_commands; // 0xc bytes
	static char * m_className;
	static /*packed*/ struct tagWNDCLASSA m_class;
	/*+0x38*/  void * __ptr32 m_hWnd;
	/*+0x3c*/  void * __ptr32 m_editWnd;
	// calltype: NearStd
	static long WindowProcedure(void * __ptr32, uint32_t, uint32_t, long);
	void OnSize(unsigned long, unsigned short, unsigned short);
	void OnEditChange();
	void OnPaint();
	void OnScroll(int32_t, int32_t);
	void RecalcScrollRange();
};

// Type: char *;

// Type: unsigned char;

// Type: uint32_t;

// Type: /*packed*/ struct tagWNDCLASSA;
struct tagWNDCLASSA{ // packed(0x28 bytes) TI: 0x26d3
	/*+0x0*/   uint32_t style;
	/*+0x4*/   long (*lpfnWndProc)(void * __ptr32, uint32_t, uint32_t, long);
	/*+0x8*/   int32_t cbClsExtra;
	/*+0xc*/   int32_t cbWndExtra;
	/*+0x10*/  void * __ptr32 hInstance;
	/*+0x14*/  void * __ptr32 hIcon;
	/*+0x18*/  void * __ptr32 hCursor;
	/*+0x1c*/  void * __ptr32 hbrBackground;
	/*+0x20*/  char * lpszMenuName;
	/*+0x24*/  char * lpszClassName;
};

// Type: /*packed*/ struct debug_command (forward reference);
// VTABLE: COPTER_D 0x0058f420
struct debug_command{ // packed(0x14 bytes) TI: 0x43fc
	/*+0x4*/   /*packed*/ class basic_string<char> command_string; // 0x8 bytes
	/*+0xc*/   /*packed*/ class basic_string<char> usage_string; // 0x8 bytes
	virtual void execute(char *); // vtable+0x0
};

// Type: /*packed*/ class vector<basic_string<char>>;
class vector<basic_string<char>>{ // packed(0xc bytes) TI: 0x1f15
	using vector_allocator = /*packed*/ class allocator<basic_string<char>>;
	using value_type = /*packed*/ class basic_string<char>;
	using pointer = /*packed*/ class basic_string<char>*;
	using iterator = /*packed*/ class basic_string<char>*;
	using const_iterator = const /*packed*/ class basic_string<char>*;
	using reference = /*packed*/ class basic_string<char>&;
	using const_reference = const /*packed*/ class basic_string<char>&;
	using size_type = uint32_t;
	using difference_type = int32_t;
	using const_reverse_iterator = /*unpacked*/ class reverse_iterator<basic_string<char> const *,basic_string<char>,basic_string<char> const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_iterator<basic_string<char> *,basic_string<char>,basic_string<char> &,int>;
protected:
	static /*packed*/ class allocator<basic_string<char>> static_allocator;
	/*+0x0*/   /*packed*/ class basic_string<char> *start;
	/*+0x4*/   /*packed*/ class basic_string<char> *finish;
	/*+0x8*/   /*packed*/ class basic_string<char> *end_of_storage;
	void insert_aux(/*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>&);
public:
	const /*packed*/ class basic_string<char>* begin();
	/*packed*/ class basic_string<char>* begin();
	const /*packed*/ class basic_string<char>* end();
	/*packed*/ class basic_string<char>* end();
	/*unpacked*/ class reverse_iterator<basic_string<char> const *,basic_string<char>,basic_string<char> const &,int> rbegin();
	/*unpacked*/ class reverse_iterator<basic_string<char> *,basic_string<char>,basic_string<char> &,int> rbegin();
	/*unpacked*/ class reverse_iterator<basic_string<char> const *,basic_string<char>,basic_string<char> const &,int> rend();
	/*unpacked*/ class reverse_iterator<basic_string<char> *,basic_string<char>,basic_string<char> &,int> rend();
	uint32_t size();
	uint32_t max_size();
	uint32_t capacity();
	int32_t empty();
	const /*packed*/ class basic_string<char>& operator[](uint32_t);
	/*packed*/ class basic_string<char>& operator[](uint32_t);
	void vector<basic_string<char>>(const /*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>*);
	void vector<basic_string<char>>(const /*packed*/ class vector<basic_string<char>>&);
	void vector<basic_string<char>>(uint32_t, const /*packed*/ class basic_string<char>&);
	void vector<basic_string<char>>();
	void ~vector<basic_string<char>>();
	/*packed*/ class vector<basic_string<char>>& operator=(const /*packed*/ class vector<basic_string<char>>&);
	void reserve(uint32_t);
	const /*packed*/ class basic_string<char>& front();
	/*packed*/ class basic_string<char>& front();
	const /*packed*/ class basic_string<char>& back();
	/*packed*/ class basic_string<char>& back();
	void push_back(const /*packed*/ class basic_string<char>&);
	void swap(/*packed*/ class vector<basic_string<char>>&);
	void insert(/*packed*/ class basic_string<char>*, uint32_t, const /*packed*/ class basic_string<char>&);
	void insert(/*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>*);
	/*packed*/ class basic_string<char>* insert(/*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>&);
	void pop_back();
	void erase(/*packed*/ class basic_string<char>*, /*packed*/ class basic_string<char>*);
	void erase(/*packed*/ class basic_string<char>*);
};

// Type: int32_t;

// Type: void;

// Type: /*packed*/ struct class_debugger<CDebugWindow,CDebugWindowhelp_text>;
struct class_debugger<CDebugWindow,CDebugWindowhelp_text> : public debug_command
{ // packed(0x18 bytes) TI: 0x4456
	void class_debugger<CDebugWindow,CDebugWindowhelp_text>(/*packed*/ class CDebugWindow*);
	/*+0x14*/  /*packed*/ class CDebugWindow *m_instance;
	virtual void execute(char *) /* override */;
};

// Type: /*packed*/ struct _iobuf (forward reference);
struct _iobuf{ // packed(0x20 bytes) TI: 0x2278
	/*+0x0*/   char * _ptr;
	/*+0x4*/   int32_t _cnt;
	/*+0x8*/   char * _base;
	/*+0xc*/   int32_t _flag;
	/*+0x10*/  int32_t _file;
	/*+0x14*/  int32_t _charbuf;
	/*+0x18*/  int32_t _bufsiz;
	/*+0x1c*/  char * _tmpfname;
};

// Type: /*packed*/ class deque<basic_string<char>>::iterator;
class deque<basic_string<char>>::iterator : public random_access_iterator<basic_string<char>,int>
{ // packed(0x10 bytes) TI: 0x43a2
protected:
	/*+0x0*/   /*packed*/ class basic_string<char> *current;
	/*+0x4*/   /*packed*/ class basic_string<char> *first;
	/*+0x8*/   /*packed*/ class basic_string<char> *last;
	/*+0xc*/   /*packed*/ class basic_string<char> **node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ class basic_string<char>*, /*packed*/ class basic_string<char>**);
public:
	/*packed*/ class basic_string<char>& operator*();
	/*packed*/ class deque<basic_string<char>>::iterator operator-(int32_t);
	int32_t operator-(const /*packed*/ class deque<basic_string<char>>::iterator&);
	/*packed*/ class deque<basic_string<char>>::iterator operator++(int32_t);
	/*packed*/ class deque<basic_string<char>>::iterator& operator++();
	/*packed*/ class deque<basic_string<char>>::iterator operator--(int32_t);
	/*packed*/ class deque<basic_string<char>>::iterator& operator--();
	/*packed*/ class deque<basic_string<char>>::iterator& operator+=(int32_t);
	/*packed*/ class deque<basic_string<char>>::iterator& operator-=(int32_t);
	/*packed*/ class deque<basic_string<char>>::iterator operator+(int32_t);
	/*packed*/ class basic_string<char>& operator[](int32_t);
	int32_t operator==(const /*packed*/ class deque<basic_string<char>>::iterator&);
	int32_t operator<(const /*packed*/ class deque<basic_string<char>>::iterator&);
};

// Type: unsigned long;

// Type: unsigned short;

// Type: /*packed*/ struct tagRECT;
struct tagRECT{ // packed(0x10 bytes) TI: 0x13c4
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
};

// Type: /*packed*/ struct tagPAINTSTRUCT;
struct tagPAINTSTRUCT{ // packed(0x40 bytes) TI: 0x124b
	/*+0x0*/   void * __ptr32 hdc;
	/*+0x4*/   int32_t fErase;
	/*+0x8*/   /*packed*/ struct tagRECT rcPaint; // 0x10 bytes
	/*+0x18*/  int32_t fRestore;
	/*+0x1c*/  int32_t fIncUpdate;
	/*+0x20*/  unsigned char rgbReserved[32]; // 0x20 bytes
};

// Type: void * __ptr32;

// Type: /*packed*/ struct tagTEXTMETRICA;
struct tagTEXTMETRICA{ // packed(0x35 bytes) TI: 0x2b94
	/*+0x0*/   long tmHeight;
	/*+0x4*/   long tmAscent;
	/*+0x8*/   long tmDescent;
	/*+0xc*/   long tmInternalLeading;
	/*+0x10*/  long tmExternalLeading;
	/*+0x14*/  long tmAveCharWidth;
	/*+0x18*/  long tmMaxCharWidth;
	/*+0x1c*/  long tmWeight;
	/*+0x20*/  long tmOverhang;
	/*+0x24*/  long tmDigitizedAspectX;
	/*+0x28*/  long tmDigitizedAspectY;
	/*+0x2c*/  unsigned char tmFirstChar; // 0x1 bytes
	/*+0x2d*/  unsigned char tmLastChar; // 0x1 bytes
	/*+0x2e*/  unsigned char tmDefaultChar; // 0x1 bytes
	/*+0x2f*/  unsigned char tmBreakChar; // 0x1 bytes
	/*+0x30*/  unsigned char tmItalic; // 0x1 bytes
	/*+0x31*/  unsigned char tmUnderlined; // 0x1 bytes
	/*+0x32*/  unsigned char tmStruckOut; // 0x1 bytes
	/*+0x33*/  unsigned char tmPitchAndFamily; // 0x1 bytes
	/*+0x34*/  unsigned char tmCharSet; // 0x1 bytes
};

// Type: /*packed*/ class basic_string<char>;
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: long;

// Type: char;

// Type: /*packed*/ class vector<basic_string<char>> (forward reference);
class vector<basic_string<char>>{ // packed(0xc bytes) TI: 0x1f15
	using vector_allocator = /*packed*/ class allocator<basic_string<char>>;
	using value_type = /*packed*/ class basic_string<char>;
	using pointer = /*packed*/ class basic_string<char>*;
	using iterator = /*packed*/ class basic_string<char>*;
	using const_iterator = const /*packed*/ class basic_string<char>*;
	using reference = /*packed*/ class basic_string<char>&;
	using const_reference = const /*packed*/ class basic_string<char>&;
	using size_type = uint32_t;
	using difference_type = int32_t;
	using const_reverse_iterator = /*unpacked*/ class reverse_iterator<basic_string<char> const *,basic_string<char>,basic_string<char> const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_iterator<basic_string<char> *,basic_string<char>,basic_string<char> &,int>;
protected:
	static /*packed*/ class allocator<basic_string<char>> static_allocator;
	/*+0x0*/   /*packed*/ class basic_string<char> *start;
	/*+0x4*/   /*packed*/ class basic_string<char> *finish;
	/*+0x8*/   /*packed*/ class basic_string<char> *end_of_storage;
	void insert_aux(/*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>&);
public:
	const /*packed*/ class basic_string<char>* begin();
	/*packed*/ class basic_string<char>* begin();
	const /*packed*/ class basic_string<char>* end();
	/*packed*/ class basic_string<char>* end();
	/*unpacked*/ class reverse_iterator<basic_string<char> const *,basic_string<char>,basic_string<char> const &,int> rbegin();
	/*unpacked*/ class reverse_iterator<basic_string<char> *,basic_string<char>,basic_string<char> &,int> rbegin();
	/*unpacked*/ class reverse_iterator<basic_string<char> const *,basic_string<char>,basic_string<char> const &,int> rend();
	/*unpacked*/ class reverse_iterator<basic_string<char> *,basic_string<char>,basic_string<char> &,int> rend();
	uint32_t size();
	uint32_t max_size();
	uint32_t capacity();
	int32_t empty();
	const /*packed*/ class basic_string<char>& operator[](uint32_t);
	/*packed*/ class basic_string<char>& operator[](uint32_t);
	void vector<basic_string<char>>(const /*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>*);
	void vector<basic_string<char>>(const /*packed*/ class vector<basic_string<char>>&);
	void vector<basic_string<char>>(uint32_t, const /*packed*/ class basic_string<char>&);
	void vector<basic_string<char>>();
	void ~vector<basic_string<char>>();
	/*packed*/ class vector<basic_string<char>>& operator=(const /*packed*/ class vector<basic_string<char>>&);
	void reserve(uint32_t);
	const /*packed*/ class basic_string<char>& front();
	/*packed*/ class basic_string<char>& front();
	const /*packed*/ class basic_string<char>& back();
	/*packed*/ class basic_string<char>& back();
	void push_back(const /*packed*/ class basic_string<char>&);
	void swap(/*packed*/ class vector<basic_string<char>>&);
	void insert(/*packed*/ class basic_string<char>*, uint32_t, const /*packed*/ class basic_string<char>&);
	void insert(/*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>*);
	/*packed*/ class basic_string<char>* insert(/*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>&);
	void pop_back();
	void erase(/*packed*/ class basic_string<char>*, /*packed*/ class basic_string<char>*);
	void erase(/*packed*/ class basic_string<char>*);
};

// Type: /*packed*/ struct class_debugger<CDebugWindow,CDebugWindowhelp_text> (forward reference);
struct class_debugger<CDebugWindow,CDebugWindowhelp_text> : public debug_command
{ // packed(0x18 bytes) TI: 0x4456
	void class_debugger<CDebugWindow,CDebugWindowhelp_text>(/*packed*/ class CDebugWindow*);
	/*+0x14*/  /*packed*/ class CDebugWindow *m_instance;
	virtual void execute(char *) /* override */;
};

// Type: /*packed*/ class deque<basic_string<char>>::iterator (forward reference);
class deque<basic_string<char>>::iterator : public random_access_iterator<basic_string<char>,int>
{ // packed(0x10 bytes) TI: 0x43a2
protected:
	/*+0x0*/   /*packed*/ class basic_string<char> *current;
	/*+0x4*/   /*packed*/ class basic_string<char> *first;
	/*+0x8*/   /*packed*/ class basic_string<char> *last;
	/*+0xc*/   /*packed*/ class basic_string<char> **node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ class basic_string<char>*, /*packed*/ class basic_string<char>**);
public:
	/*packed*/ class basic_string<char>& operator*();
	/*packed*/ class deque<basic_string<char>>::iterator operator-(int32_t);
	int32_t operator-(const /*packed*/ class deque<basic_string<char>>::iterator&);
	/*packed*/ class deque<basic_string<char>>::iterator operator++(int32_t);
	/*packed*/ class deque<basic_string<char>>::iterator& operator++();
	/*packed*/ class deque<basic_string<char>>::iterator operator--(int32_t);
	/*packed*/ class deque<basic_string<char>>::iterator& operator--();
	/*packed*/ class deque<basic_string<char>>::iterator& operator+=(int32_t);
	/*packed*/ class deque<basic_string<char>>::iterator& operator-=(int32_t);
	/*packed*/ class deque<basic_string<char>>::iterator operator+(int32_t);
	/*packed*/ class basic_string<char>& operator[](int32_t);
	int32_t operator==(const /*packed*/ class deque<basic_string<char>>::iterator&);
	int32_t operator<(const /*packed*/ class deque<basic_string<char>>::iterator&);
};

// Type: /*packed*/ class basic_string<char> (forward reference);
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: /*packed*/ class deque<basic_string<char>> (forward reference);
class deque<basic_string<char>>{ // packed(0x2c bytes) TI: 0x4377
	class deque<basic_string<char>>::iterator : public random_access_iterator<basic_string<char>,int>
	{ // packed(0x10 bytes) TI: 0x43a2
	protected:
		/*+0x0*/   /*packed*/ class basic_string<char> *current;
		/*+0x4*/   /*packed*/ class basic_string<char> *first;
		/*+0x8*/   /*packed*/ class basic_string<char> *last;
		/*+0xc*/   /*packed*/ class basic_string<char> **node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ class basic_string<char>*, /*packed*/ class basic_string<char>**);
	public:
		/*packed*/ class basic_string<char>& operator*();
		/*packed*/ class deque<basic_string<char>>::iterator operator-(int32_t);
		int32_t operator-(const /*packed*/ class deque<basic_string<char>>::iterator&);
		/*packed*/ class deque<basic_string<char>>::iterator operator++(int32_t);
		/*packed*/ class deque<basic_string<char>>::iterator& operator++();
		/*packed*/ class deque<basic_string<char>>::iterator operator--(int32_t);
		/*packed*/ class deque<basic_string<char>>::iterator& operator--();
		/*packed*/ class deque<basic_string<char>>::iterator& operator+=(int32_t);
		/*packed*/ class deque<basic_string<char>>::iterator& operator-=(int32_t);
		/*packed*/ class deque<basic_string<char>>::iterator operator+(int32_t);
		/*packed*/ class basic_string<char>& operator[](int32_t);
		int32_t operator==(const /*packed*/ class deque<basic_string<char>>::iterator&);
		int32_t operator<(const /*packed*/ class deque<basic_string<char>>::iterator&);
	};
	class deque<basic_string<char>>::const_iterator : public random_access_iterator<basic_string<char>,int>
	{ // packed(0x10 bytes) TI: 0x4391
	protected:
		/*+0x0*/   /*packed*/ class basic_string<char> *current;
		/*+0x4*/   /*packed*/ class basic_string<char> *first;
		/*+0x8*/   /*packed*/ class basic_string<char> *last;
		/*+0xc*/   /*packed*/ class basic_string<char> **node;
	public:
		void const_iterator(const /*packed*/ class deque<basic_string<char>>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ class basic_string<char>*, /*packed*/ class basic_string<char>**);
	public:
		const /*packed*/ class basic_string<char>& operator*();
		/*packed*/ class deque<basic_string<char>>::const_iterator operator-(int32_t);
		int32_t operator-(const /*packed*/ class deque<basic_string<char>>::const_iterator&);
		/*packed*/ class deque<basic_string<char>>::const_iterator operator++(int32_t);
		/*packed*/ class deque<basic_string<char>>::const_iterator& operator++();
		/*packed*/ class deque<basic_string<char>>::const_iterator operator--(int32_t);
		/*packed*/ class deque<basic_string<char>>::const_iterator& operator--();
		/*packed*/ class deque<basic_string<char>>::const_iterator& operator+=(int32_t);
		/*packed*/ class deque<basic_string<char>>::const_iterator& operator-=(int32_t);
		/*packed*/ class deque<basic_string<char>>::const_iterator operator+(int32_t);
		const /*packed*/ class basic_string<char>& operator[](int32_t);
		int32_t operator==(const /*packed*/ class deque<basic_string<char>>::const_iterator&);
		int32_t operator<(const /*packed*/ class deque<basic_string<char>>::const_iterator&);
	};
	using value_type = /*packed*/ class basic_string<char>;
	using data_allocator_type = /*packed*/ class allocator<basic_string<char>>;
	using pointer = /*packed*/ class basic_string<char>*;
	using reference = /*packed*/ class basic_string<char>&;
	using const_reference = const /*packed*/ class basic_string<char>&;
	using size_type = uint32_t;
	using difference_type = int32_t;
	using map_allocator_type = /*packed*/ class allocator<basic_string<char> *>;
protected:
	static /*packed*/ class allocator<basic_string<char>> data_allocator;
	static uint32_t buffer_size;
	static /*packed*/ class allocator<basic_string<char> *> map_allocator;
	using map_pointer = /*packed*/ class basic_string<char>**;
	using const_reverse_iterator = /*unpacked*/ class reverse_iterator<deque<basic_string<char>>::const_iterator,basic_string<char>,basic_string<char> const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_iterator<deque<basic_string<char>>::iterator,basic_string<char>,basic_string<char> &,int>;
protected:
	/*+0x0*/   /*packed*/ class deque<basic_string<char>>::iterator start; // 0x10 bytes
	/*+0x10*/  /*packed*/ class deque<basic_string<char>>::iterator finish; // 0x10 bytes
	/*+0x20*/  uint32_t length;
	/*+0x24*/  /*packed*/ class basic_string<char> **map;
	/*+0x28*/  uint32_t map_size;
	void allocate_at_begin();
	void allocate_at_end();
	void deallocate_at_begin();
	void deallocate_at_end();
public:
	void deque<basic_string<char>>(const /*packed*/ class deque<basic_string<char>>&);
	void deque<basic_string<char>>(const /*packed*/ class basic_string<char>*, const /*packed*/ class basic_string<char>*);
	void deque<basic_string<char>>(uint32_t, const /*packed*/ class basic_string<char>&);
	void deque<basic_string<char>>();
	/*packed*/ class deque<basic_string<char>>::const_iterator begin();
	/*packed*/ class deque<basic_string<char>>::iterator begin();
	/*packed*/ class deque<basic_string<char>>::const_iterator end();
	/*packed*/ class deque<basic_string<char>>::iterator end();
	/*unpacked*/ class reverse_iterator<deque<basic_string<char>>::const_iterator,basic_string<char>,basic_string<char> const &,int> rbegin();
