// Module: Dialwin.obj
// Source: C:\Copter\source\sparkal\Dialwin.cpp
// autogenerated by simcopter_tool from PDB file

// Type: char *;

// Type: /*packed*/ class RadioCompassWindow (forward reference);
// VTABLE: COPTER_D 0x0058f650
class RadioCompassWindow : public GraphicWindow
{ // packed(0xb4 bytes) TI: 0x2a7c
public:
	void RadioCompassWindow(/*packed*/ class MRect&, long, /*unpacked*/ class GraphicWindow*, /*unpacked*/ class Radio*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual void ~RadioCompassWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual void InitializeCachedSettings(); // vtable+0xc4
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual void DestroyImage() /* override */;
	virtual int32_t ComposeSelf() /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	int32_t GetCurrentCompassPosition();
	void SetNewRadioStation(int32_t);
	void SetNewRadioStationVolume(long);
	void CheckForRadioChange();
protected:
	/*+0x74*/  long lFrameCount;
	/*+0x78*/  /*unpacked*/ class Radio *myRadio;
	/*+0x7c*/  int32_t nRadioStationIndex;
	/*+0x80*/  long lRadioStationVolume;
	/*+0x84*/  /*unpacked*/ class CBackBuffer *myCompassImage;
	/*+0x88*/  /*packed*/ class basic_string<char> sCompassFile; // 0x8 bytes
	/*+0x90*/  int32_t nLastCompassPosition;
	/*+0x94*/  /*packed*/ class MRect rectRadioStations; // 0x10 bytes
	/*+0xa4*/  /*packed*/ class MRect rectRadioStationVolume; // 0x10 bytes
};

// Type: /*packed*/ class MRect (forward reference);
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: long;

// Type: /*unpacked*/ class GraphicWindow (forward reference);
// GraphicWindow Class implementation not found

// Type: /*unpacked*/ class Radio (forward reference);
// Radio Class implementation not found

// Type: /*packed*/ class GraphicWindowOwner (forward reference);
// VTABLE: COPTER_D 0x00590f2c
class GraphicWindowOwner{ // packed(0x4 bytes) TI: 0x1647
public:
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32); // vtable+0x0
};

// Type: int32_t;

// Type: void;

// Type: /*packed*/ class basic_string<char>;
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: unsigned long;

// Type: /*packed*/ class DialWindow (forward reference);
// VTABLE: COPTER_D 0x0058f738
class DialWindow : public GraphicWindow
{ // packed(0x1e8 bytes) TI: 0x4212
public:
	void DialWindow(/*packed*/ class MRect&, long, /*packed*/ struct CommandSystem*, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual void ~DialWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual void InitializeCachedSettings(); // vtable+0xc4
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual void DestroyImage() /* override */;
	virtual int32_t ComposeSelf() /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
	virtual int32_t DoesWindowNeedUpdating() /* override */;
	void SetNewDialPositions();
	void DrawCurrentDamage();
	void CheckForChangedDamage();
	void TurnOffSpotlightCommand(int32_t);
	void TurnOnSpotlightCommand(int32_t);
protected:
	/*+0x74*/  /*packed*/ struct CommandSystem *myCommandSystem;
	/*+0x78*/  /*packed*/ class BitmappedFont *myMoneyGuageFont;
	/*+0x7c*/  /*unpacked*/ class CBackBuffer *mySecondImage;
	/*+0x80*/  /*unpacked*/ class CBackBuffer *myDamageImage;
	/*+0x84*/  /*unpacked*/ class CBackBuffer *myFuelLightImage;
	/*+0x88*/  /*unpacked*/ class CBackBuffer *myPointsLightImage;
	/*+0x8c*/  /*unpacked*/ class CBackBuffer *myAltitudeHundredsImage;
	/*+0x90*/  /*unpacked*/ class CBackBuffer *mySpotlightBootImage;
	/*+0x94*/  /*unpacked*/ class CBackBuffer *mySpotlightBootBackImage;
	/*+0x98*/  int32_t nCurrentDamage;
	/*+0x9c*/  long lCurrentFuelPercentage;
	/*+0xa0*/  long lCurrentFuelLight;
	/*+0xa4*/  /*packed*/ class DialHand dials[3]; // 0x9c bytes
	/*+0x140*/ /*packed*/ class MRect rectDials[3]; // 0x30 bytes
	/*+0x170*/ /*packed*/ class MRect rectMoneyFont; // 0x10 bytes
	/*+0x180*/ long lCurrentMoney;
	/*+0x184*/ long lCurrentPoints;
	/*+0x188*/ int32_t bCurrentPointsOverLimit;
	/*+0x18c*/ /*packed*/ class MPoint ptLastSpotlightPosition; // 0x8 bytes
	/*+0x194*/ /*packed*/ class MRect rectSpotlightControl; // 0x10 bytes
	/*+0x1a4*/ /*packed*/ class MRect rectSpotlightControlSet[4]; // 0x40 bytes
	/*+0x1e4*/ long lSpotlightControlCurrent;
};

// Type: /*packed*/ struct CommandSystem (forward reference);
struct CommandSystem{ // packed(0xaa8 bytes) TI: 0x12e4
	/*+0x0*/   /*packed*/ struct Command keyboardCommands[100]; // 0xc8 bytes
	/*+0xc8*/  /*packed*/ class CharList keyboardCommandList; // 0x10 bytes
	/*+0xd8*/  /*packed*/ class list<Shortcut> commandShortcuts; // 0x8 bytes
	/*+0xe0*/  unsigned char chCommandKeyboardArray[2048]; // 0x800 bytes
	/*+0x8e0*/ unsigned char chCommandJoystickArray[4][14]; // 0x38 bytes
	/*+0x918*/ long joystickCommands[100]; // 0x190 bytes
	void CommandSystem();
	void Initialize();
	void ClearAllCommands();
	void ClearAllCommandsDevice(long);
	void TurnOnCommand(int32_t);
	void TurnOffCommand(int32_t);
	void TurnOnCommandDevice(int32_t, long);
	void TurnOffCommandDevice(int32_t, long);
	int32_t IsCommandSet(int32_t);
	int32_t IsCommandPush(int32_t);
	void SetUpCommandArraysFromShortcuts();
	// calltype: NearC
	static int32_t GetKeystateIndexForChar(long, char);
	long GetJoystickCommandValue(int32_t);
	void PollJoysticksForCommands();
};

// Type: char;

// Type: /*packed*/ class MPoint;
class MPoint : public SparkalPoint
{ // packed(0x8 bytes) TI: 0x159a
public:
	void MPoint(unsigned long);
	void MPoint(/*packed*/ struct SparkalSize);
	void MPoint(/*packed*/ struct SparkalPoint);
	void MPoint(long, long);
	void MPoint();
	void Offset(/*packed*/ struct SparkalSize);
	void Offset(/*packed*/ struct SparkalPoint);
	void Offset(long, long);
	int32_t operator==(/*packed*/ struct SparkalPoint);
	int32_t operator!=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MSize operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator-();
	/*packed*/ class MPoint operator-(/*packed*/ struct SparkalSize);
};

// Type: /*packed*/ class PassengerWindow (forward reference);
// VTABLE: COPTER_D 0x0058f800
class PassengerWindow : public GraphicWindow
{ // packed(0xac bytes) TI: 0x2a76
	enum Position {
		nPositionUp = 0,
		nPositionDown = 1,
	};
	enum PositionChangeDirection {
		nPositionChangeDirectionDown = -1,
		nPositionChangeDirectionNone = 0,
		nPositionChangeDirectionUp = 1,
	};
public:
	void PassengerWindow(/*packed*/ class MRect&, long, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual void ~PassengerWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual void InitializeCachedSettings(); // vtable+0xc4
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual void DestroyImage() /* override */;
	virtual int32_t ComposeSelf() /* override */;
	virtual int32_t DoesWindowNeedUpdating() /* override */;
	virtual void MoveToUpPosition(); // vtable+0xc8
	virtual void MoveToDownPosition(); // vtable+0xcc
	virtual void TogglePosition(); // vtable+0xd0
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
protected:
	void DrawPassengers();
	void GetRectOfPassengerGraphic(int32_t, int32_t, /*packed*/ class MRect&);
	int32_t DoesPositionHitPassenger(long, long, long&);
	/*+0x74*/  enum PassengerWindow::Position nPositionCurrent;
	/*+0x78*/  int32_t nHeightOfWindowToShow;
	/*+0x7c*/  int32_t nYPositionOfWindowWhenDown;
	/*+0x80*/  /*packed*/ class MTimer timerForPositionChange; // 0x10 bytes
	/*+0x90*/  int32_t nChangingPosition;
	/*+0x94*/  long lPassengerDraggedID;
	/*+0x98*/  /*packed*/ class MPoint ptLastCursorPosition; // 0x8 bytes
	/*+0xa0*/  /*unpacked*/ class CBackBuffer *myPassengerImage;
	/*+0xa4*/  /*packed*/ class basic_string<char> sPassengerFile; // 0x8 bytes
};

// Type: /*packed*/ struct tagHeliPassengerData (forward reference);
struct tagHeliPassengerData{ // packed(0x15c bytes) TI: 0x2a7a
	/*+0x0*/   long lPassengerDataChanged;
	/*+0x4*/   long lSeatsTotal;
	/*+0x8*/   long lSeatsUsed;
	/*+0xc*/   long lDoubleSeatsTotal;
	/*+0x10*/  long lDoubleSeatsUsed;
	/*+0x14*/  long lRowWidth;
	/*+0x18*/  long lPassengerCount;
	/*+0x1c*/  /*packed*/ struct tagPassengerInfo passengers[16]; // 0x140 bytes
};

// Type: /*packed*/ class MRect;
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: /*packed*/ class MapWindow (forward reference);
// VTABLE: COPTER_D 0x0058f8d8
class MapWindow : public GraphicWindow
{ // packed(0x118 bytes) TI: 0x4206
public:
	void MapWindow(/*packed*/ class MRect&, long, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual void ~MapWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual void InitializeCachedSettings(); // vtable+0xc4
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual void DestroyImage() /* override */;
	virtual int32_t ComposeSelf() /* override */;
	virtual void DrawButton(int32_t, int32_t); // vtable+0xc8
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual void CreateAutoMessageSelectionPopupWindow(int32_t, int32_t, /*packed*/ class MPoint&); // vtable+0xcc
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual int32_t GetStringIDForVehicleName(int32_t); // vtable+0xd0
	/*+0x74*/  /*unpacked*/ class CBackBuffer *myButtonImage;
	/*+0x78*/  int32_t bCurrentMissionFilter;
	/*+0x7c*/  int32_t bOtherMissionFilter;
	/*+0x80*/  int32_t nTrackingButton;
	/*+0x84*/  int32_t nCurrentAutoID;
	/*+0x88*/  long lCurrentMissionID;
	/*+0x8c*/  /*packed*/ class MFont fontText; // 0x1c bytes
	/*+0xa8*/  /*packed*/ class MRect rectButtons[6]; // 0x60 bytes
	/*+0x108*/ /*packed*/ class MRect rectMissionText; // 0x10 bytes
};

// Type: /*packed*/ struct MISSION_DATA (forward reference);
struct MISSION_DATA{ // packed(0xd4 bytes) TI: 0x31c4
	/*+0x0*/   char mtext[32]; // 0x20 bytes
	/*+0x20*/  long type_ctr;
	/*+0x24*/  long key;
	/*+0x28*/  /*packed*/ struct Point2d maploc; // 0x8 bytes
	/*+0x30*/  /*packed*/ struct Point2d destmaploc; // 0x8 bytes
	/*+0x38*/  /*packed*/ struct Point2d pickuploc; // 0x8 bytes
	/*+0x40*/  int32_t timer;
	/*+0x44*/  long money_bonus;
	/*+0x48*/  long points_bonus;
	/*+0x4c*/  long flags;
	/*+0x50*/  long type;
	/*+0x54*/  long state;
	/*+0x58*/  /*packed*/ struct __unnamed mdata; // 0x7c bytes
};

// Type: void * __ptr32;

// Type: /*packed*/ class MPoint (forward reference);
class MPoint : public SparkalPoint
{ // packed(0x8 bytes) TI: 0x159a
public:
	void MPoint(unsigned long);
	void MPoint(/*packed*/ struct SparkalSize);
	void MPoint(/*packed*/ struct SparkalPoint);
	void MPoint(long, long);
	void MPoint();
	void Offset(/*packed*/ struct SparkalSize);
	void Offset(/*packed*/ struct SparkalPoint);
	void Offset(long, long);
	int32_t operator==(/*packed*/ struct SparkalPoint);
	int32_t operator!=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MSize operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator-();
	/*packed*/ class MPoint operator-(/*packed*/ struct SparkalSize);
};

// Type: /*packed*/ class PopupMenuWindow (forward reference);
// VTABLE: COPTER_D 0x00592220
class PopupMenuWindow : public ListBoxWindow
{ // packed(0xcc bytes) TI: 0x215d
public:
	void PopupMenuWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual int32_t Initialize() /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
protected:
	virtual void ResizeWindowToFitMenuItems(); // vtable+0x158
	virtual int32_t RemoveStringAtIndex(long) /* override */;
	virtual int32_t InsertStringAtIndex(long, /*packed*/ class basic_string<char>&) /* override */;
};

// Type: /*packed*/ class EquipmentPanelWindow (forward reference);
// VTABLE: COPTER_D 0x0058f9b0
class EquipmentPanelWindow : public GraphicWindow
{ // packed(0xcc bytes) TI: 0x2a7e
public:
	void EquipmentPanelWindow(char *, /*packed*/ class MRect&, long, /*packed*/ struct CommandSystem*, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*);
	virtual void ~EquipmentPanelWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual void InitializeCachedSettings(); // vtable+0xc4
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual void DestroyImage() /* override */;
	virtual int32_t DrawSelf() /* override */;
	virtual void DrawButton(int32_t, int32_t); // vtable+0xc8
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	void CreateMegaphoneSelectionPopupWindow();
	virtual int32_t DoesWindowNeedUpdating() /* override */;
protected:
	void DoCurrentControlStart();
	void DoCurrentControlEnd();
	void DrawBucketWaterGuage();
	void DrawTeargasUsage();
	/*+0x74*/  /*packed*/ class MRect rectControls[4]; // 0x40 bytes
	/*+0xb4*/  long lCurrentSelectedControl;
	/*+0xb8*/  /*packed*/ struct CommandSystem *myCommandSystem;
	/*+0xbc*/  /*unpacked*/ class CBackBuffer *myBucketWaterGuageImage;
	/*+0xc0*/  /*unpacked*/ class CBackBuffer *myButtonImage;
	/*+0xc4*/  long lLastBucketWaterGuageLevel;
	/*+0xc8*/  long lLastTeargasCount;
};

// Type: uint32_t;

// Type: /*packed*/ class DialHand (forward reference);
class DialHand{ // packed(0x34 bytes) TI: 0x2733
	enum DialDirection {
		nDialDirectionClockwise = -1,
		nDialDirectionCounterClockwise = 1,
	};
public:
	void DialHand();
	int32_t SetCurrentValue(long);
	int32_t GetCurrentValue();
	int32_t SetPercent(long);
	void SetMaxValue(long);
	void SetAnglePerValue(float);
	void SetStartAngle(long);
	void SetDialPosition(long, long);
	void SetDialDirection(enum DialHand::DialDirection);
	void SetDialLength(long);
	void SetDialWidth(long);
	void DrawSelf(/*unpacked*/ class CBackBuffer*);
	void SetDialColor(int32_t);
	int32_t HasChangedSinceLastDraw();
	void GetBoundingRect(/*packed*/ class MRect&);
	void CalculateCurrentPosition();
	/*+0x0*/   int32_t bHasChangedSinceLastDraw;
	/*+0x4*/   long lCurrentValue;
	/*+0x8*/   enum DialHand::DialDirection nDialDirection;
	/*+0xc*/   long lMaxValue;
	/*+0x10*/  long lStartAngle;
	/*+0x14*/  long lDialLength;
	/*+0x18*/  long lDialWidth;
	/*+0x1c*/  float fAnglePerValue;
	/*+0x20*/  /*packed*/ class MPoint ptPosition; // 0x8 bytes
	/*+0x28*/  /*packed*/ class MPoint ptEndPosition; // 0x8 bytes
	/*+0x30*/  int32_t nColorDial;
};

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ struct SparkalPoint;
struct SparkalPoint{ // packed(0x8 bytes) TI: 0x1a54
	/*+0x0*/   long x;
	/*+0x4*/   long y;
	void SparkalPoint(long, long);
	void SparkalPoint();
};

// Type: /*packed*/ class ListBoxWindow;
// VTABLE: COPTER_D 0x005920c8
class ListBoxWindow : public GraphicWindow
{ // packed(0xcc bytes) TI: 0x17a0
public:
	void ListBoxWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	void ListBoxWindow();
	virtual int32_t Initialize() /* override */;
	virtual int32_t DrawSelf() /* override */;
	virtual int32_t RemoveString(long); // vtable+0xc4
	virtual int32_t RemoveString(/*packed*/ class basic_string<char>&); // vtable+0xc8
	virtual void RemoveAllStrings(); // vtable+0xcc
	virtual int32_t InsertString(long, long); // vtable+0xd0
	virtual int32_t InsertString(/*packed*/ class basic_string<char>&, long); // vtable+0xd4
	virtual int32_t ResizeWindowForExactLineHeights(); // vtable+0xd8
	virtual int32_t SetSelection(long); // vtable+0xdc
	virtual long GetSelection(); // vtable+0xe0
	virtual void SetShouldSort(); // vtable+0xe4
	virtual void Sort(); // vtable+0xe8
	virtual int32_t MoveLineUp(); // vtable+0xec
	virtual int32_t MoveLineDown(); // vtable+0xf0
	virtual int32_t ScrollToStart(); // vtable+0xf4
	virtual int32_t ScrollToEnd(); // vtable+0xf8
	virtual int32_t ScrollPageUp(); // vtable+0xfc
	virtual int32_t ScrollPageDown(); // vtable+0x100
	virtual int32_t IsIndexInView(long); // vtable+0x104
	virtual void PutIndexInView(long); // vtable+0x108
	virtual int32_t ScrollToFirstLetter(char); // vtable+0x10c
	virtual void SetIndexOfTopLine(long); // vtable+0x110
	virtual long GetLineCount(); // vtable+0x114
	virtual long GetIndexOfTopLine(); // vtable+0x118
	virtual long DoCharacter(long) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual void SetBackgroundDrawing(int32_t); // vtable+0x11c
	virtual void SetBackgroundPaletteIndex(int32_t, int32_t); // vtable+0x120
	virtual void SetTextColor(const /*packed*/ struct SparkalColor*, const /*packed*/ struct SparkalColor*); // vtable+0x124
	virtual void SetFontCharacteristics(long, long, long); // vtable+0x128
	virtual int32_t AddScrollBar(int32_t, int32_t, char *); // vtable+0x12c
	virtual void RemoveScrollBar(int32_t, int32_t); // vtable+0x130
protected:
	virtual void CalculateAllMetrics(); // vtable+0x134
	virtual int32_t GetStringAddressFromIndex(long, /*packed*/ class basic_string<char>*&); // vtable+0x138
	virtual int32_t GetStringFromIndex(long, /*packed*/ class basic_string<char>&); // vtable+0x13c
	virtual int32_t GetIndexFromString(long&, /*packed*/ class basic_string<char>&); // vtable+0x140
	virtual int32_t RemoveStringAtIndex(long); // vtable+0x144
	virtual int32_t InsertStringAtIndex(long, /*packed*/ class basic_string<char>&); // vtable+0x148
	virtual int32_t ModifyString(long, /*packed*/ class basic_string<char>&); // vtable+0x14c
	virtual void SetScrollBarValue(); // vtable+0x150
	virtual void SetScrollBarSizes(); // vtable+0x154
	/*+0x74*/  /*packed*/ class list<basic_string<char>> myStringList; // 0x8 bytes
	/*+0x7c*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x80*/  /*packed*/ struct SparkalColor colorFontHighlighted;
	/*+0x84*/  int32_t nBackgroundIndex;
	/*+0x88*/  int32_t nBackgroundIndexHighlighted;
	/*+0x8c*/  /*packed*/ class MFont fontText; // 0x1c bytes
	/*+0xa8*/  unsigned long nTextDrawStyle;
	/*+0xac*/  long lCurrentSelection;
	/*+0xb0*/  long lVisibleLines;
	/*+0xb4*/  long lFirstVisibleLine;
	/*+0xb8*/  long lLineHeight;
	/*+0xbc*/  int32_t bAlwaysSort;
	/*+0xc0*/  /*packed*/ class ScrollBarWindow *myVerticalScrollBarWindow;
	/*+0xc4*/  /*packed*/ class ScrollBarWindow *myHorizontalScrollBarWindow;
	/*+0xc8*/  int32_t bBusySettingSelection;
};



// Contribution: 1:00047270-0004ec1a Module: 47, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00448270
void RadioCompassWindow::RadioCompassWindow(/*packed*/ class MRect& rectNewWindow, long lNewID, /*unpacked*/ class GraphicWindow *windowNewParent, /*unpacked*/ class Radio *myNewRadio, /*packed*/ class GraphicWindowOwner *myNewOwner, int32_t bAddToParentList) {

	__asm        mov    eax, GraphicWindow::colorConstants.nPaletteIndexTransparent;
	__asm        push   eax;
	__asm        mov    eax, bAddToParentList;
	__asm        push   eax;
	__asm        mov    eax, myNewOwner;
	__asm        push   eax;
	__asm        mov    eax, windowNewParent;
	__asm        push   eax;
	__asm        mov    eax, lNewID;
	__asm        push   eax;
	__asm        mov    eax, rectNewWindow;
	__asm        push   eax;
	__asm        mov    eax, SZ_RADIO_COMPASS_WINDOW_IMAGE_FILE_NAME;
	__asm        push   eax;
	__asm        mov    ecx, this;
