// Module: Extrawin.obj
// Source: C:\Copter\source\sparkal\Extrawin.cpp
// autogenerated by simcopter_tool from PDB file

// Type: char *;

// Type: /*packed*/ struct SparkalColor;
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: void ();

// Type: void;

// Type: /*packed*/ class MPoint (forward reference);
class MPoint : public SparkalPoint
{ // packed(0x8 bytes) TI: 0x159a
public:
	void MPoint(unsigned long);
	void MPoint(/*packed*/ struct SparkalSize);
	void MPoint(/*packed*/ struct SparkalPoint);
	void MPoint(long, long);
	void MPoint();
	void Offset(/*packed*/ struct SparkalSize);
	void Offset(/*packed*/ struct SparkalPoint);
	void Offset(long, long);
	int32_t operator==(/*packed*/ struct SparkalPoint);
	int32_t operator!=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MSize operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator-();
	/*packed*/ class MPoint operator-(/*packed*/ struct SparkalSize);
};

// Type: unsigned long;

// Type: int32_t;

// Type: /*unpacked*/ class GraphicWindow (forward reference);
// GraphicWindow Class implementation not found

// Type: /*packed*/ class GraphicWindowOwner (forward reference);
// VTABLE: COPTER_D 0x00590f2c
class GraphicWindowOwner{ // packed(0x4 bytes) TI: 0x1647
public:
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32); // vtable+0x0
};

// Type: /*packed*/ class MessageBoxWindow (forward reference);
// VTABLE: COPTER_D 0x0058fa80
class MessageBoxWindow : public GraphicWindow
{ // packed(0xa4 bytes) TI: 0x2a45
public:
	void MessageBoxWindow(/*packed*/ class MPoint&, unsigned long, /*packed*/ class basic_string<char>&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, int32_t, char *, char *, char *);
	void MessageBoxWindow(/*packed*/ class MPoint&, unsigned long, unsigned long, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, int32_t, char *, char *, char *);
	virtual int32_t Initialize() /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual void SetTextColor(const /*packed*/ struct SparkalColor&); // vtable+0xc4
	virtual void SetButtonTextColor(const /*packed*/ struct SparkalColor*, const /*packed*/ struct SparkalColor*); // vtable+0xc8
protected:
	virtual int32_t ConvertTypeToStringID(long); // vtable+0xcc
	virtual void DrawTextOntoBox(); // vtable+0xd0
	/*+0x74*/  long lMessageID;
	/*+0x78*/  /*packed*/ class basic_string<char> sMessage; // 0x8 bytes
	/*+0x80*/  /*packed*/ class basic_string<char> sButtonImageFileName; // 0x8 bytes
	/*+0x88*/  /*packed*/ class basic_string<char> sAnimationImageFileName; // 0x8 bytes
	/*+0x90*/  long lType;
	/*+0x94*/  int32_t bSelfDeleting;
	/*+0x98*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x9c*/  /*packed*/ struct SparkalColor colorButtonFont;
	/*+0xa0*/  /*packed*/ struct SparkalColor colorButtonFontHighlighted;
};

// Type: /*packed*/ class basic_string<char> (forward reference);
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: /*packed*/ class ButtonWindow (forward reference);
// VTABLE: COPTER_D 0x00591b78
class ButtonWindow : public GraphicWindow
{ // packed(0x94 bytes) TI: 0x1a48
	enum ButtonState {
		nButtonStateDisabled = 0,
		nButtonStateOff = 1,
		nButtonStateOn = 2,
	};
public:
	void ButtonWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void ButtonWindow();
	virtual int32_t Initialize() /* override */;
	virtual int32_t GetImageCount(); // vtable+0xc4
	virtual void SetState(int32_t); // vtable+0xc8
	virtual int32_t GetState(); // vtable+0xcc
	virtual void Enable(); // vtable+0xd0
	virtual void Disable(); // vtable+0xd4
	virtual int32_t ComposeSelf() /* override */;
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
	virtual void SetTextColor(const /*packed*/ struct SparkalColor*, const /*packed*/ struct SparkalColor*); // vtable+0xd8
	virtual int32_t CanWeRespondToMessage() /* override */;
protected:
	/*+0x74*/  int32_t nButtonState;
	/*+0x78*/  int32_t bEnabled;
	/*+0x7c*/  int32_t nButtonTextHeight;
	/*+0x80*/  /*packed*/ class MSize sizeTextOffset; // 0x8 bytes
	/*+0x88*/  int32_t bBusySettingState;
	/*+0x8c*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x90*/  /*packed*/ struct SparkalColor colorFontHighlighted;
};

// Type: /*packed*/ class MRect (forward reference);
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: /*packed*/ class basic_string<char>;
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: /*packed*/ class AnimationWindow (forward reference);
// VTABLE: COPTER_D 0x0058fb58
class AnimationWindow : public GraphicWindow
{ // packed(0xa4 bytes) TI: 0x41ff
	enum AnimationLoopType {
		nAnimationLoopTypeOnce = 0,
		nAnimationLoopTypeCircular = 1,
		nAnimationLoopTypeBackAndForth = 2,
	};
	enum AnimationDirection {
		nAnimationDirectionForward = 1,
		nAnimationDirectionBackward = -1,
	};
public:
	void AnimationWindow(char *, /*packed*/ class MRect&, long, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, long, enum AnimationWindow::AnimationLoopType);
	void AnimationWindow();
	void Start();
	void Stop();
	int32_t IsRunning();
	void ResetFramePosition();
	void ReverseAnimationDirection();
	void SetAnimationFrameTime(long);
	void SetAnimationFrameRate(long);
	void SetAnimationDirection(enum AnimationWindow::AnimationDirection);
	void SetAnimationLoopType(enum AnimationWindow::AnimationLoopType);
	void GotoFirstFrame();
	void GotoNextFrame();
	void GotoPreviousFrame();
	void GotoNthFrame(int32_t);
	virtual int32_t ComposeSelf() /* override */;
	virtual int32_t DoesWindowNeedUpdating() /* override */;
protected:
	/*+0x74*/  long bRunning;
	/*+0x78*/  long bManualFrameIncrementing;
	/*+0x7c*/  long lMillisecondsBetweenFrames;
	/*+0x80*/  long lMillisecondsOfLastFrame;
	/*+0x84*/  long lMillisecondsSinceLastFrame;
	/*+0x88*/  enum AnimationWindow::AnimationLoopType nAnimationLoopType;
	/*+0x8c*/  enum AnimationWindow::AnimationDirection nAnimationDirection;
	/*+0x90*/  long lCurrentFrame;
	/*+0x94*/  long bPreserveTiming;
	/*+0x98*/  long lWidthOfSingleFrame;
	/*+0x9c*/  long lFrameCount;
	/*+0xa0*/  long lTransparentIndex;
};

// Type: long;

// Type: char;

// Type: void * __ptr32;

// Type: /*packed*/ class MRect;
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: /*packed*/ class MFont (forward reference);
// VTABLE: COPTER_D 0x00591640
class MFont{ // packed(0x1c bytes) TI: 0x1a6c
public:
	/*+0x4*/   /*packed*/ class basic_string<char> sName; // 0x8 bytes
	/*+0xc*/   unsigned long lHeight;
	/*+0x10*/  unsigned long lWidth;
	/*+0x14*/  unsigned long lAttributes;
	void MFont(char *, unsigned long, unsigned long, unsigned long, int32_t);
	void MFont(const /*packed*/ class MFont&);
	void MFont();
	void ~MFont();
	/*packed*/ class MFont& operator=(const /*packed*/ class MFont&);
	// calltype: NearC
	static int32_t IsFontAvailable(char *, unsigned long, unsigned long, unsigned long);
	// calltype: NearC
	static int32_t LoadFont(char *);
	// calltype: NearC
	static int32_t UnloadFont(char *);
	void SetFontCharacteristics(long, long, long);
	int32_t GetTextDimensions(char *, long&, long&);
	virtual int32_t CreateFontA(); // vtable+0x0
	virtual void DestroyFont(); // vtable+0x4
	void * __ptr32 operator void *();
protected:
	/*+0x18*/  void * __ptr32 hFont;
};

// Type: /*packed*/ struct SparkalColor (forward reference);
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: enum AnimationWindow::AnimationLoopType;
enum AnimationLoopType {
	nAnimationLoopTypeOnce = 0,
	nAnimationLoopTypeCircular = 1,
	nAnimationLoopTypeBackAndForth = 2,
};

// Type: /*packed*/ class RenderSettingsWindow (forward reference);
// VTABLE: COPTER_D 0x0058fc20
class RenderSettingsWindow : public GraphicWindow
{ // packed(0xb8 bytes) TI: 0x2add
public:
	void RenderSettingsWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual void ~RenderSettingsWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual void DestroyImage() /* override */;
	virtual int32_t DrawSelf() /* override */;
	int32_t SetCurrentSettings(long, long, long, long, long);
	void GetCurrentSettings(long&, long&, long&, long&, long&);
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	/*+0x74*/  long bShowBuildingTextures;
	/*+0x78*/  long bShowGroundTextures;
	/*+0x7c*/  long bShowSkyAndClouds;
	/*+0x80*/  long lQuadPixelType;
	/*+0x84*/  long lFogCloseness;
protected:
	void SetControlsBasedOnCurrentSettings();
	void DrawPreviewBasedOnCurrentSettings();
	void GetPreviewFileNames(/*packed*/ class basic_string<char>&, /*packed*/ class basic_string<char>&, /*packed*/ class basic_string<char>&);
	/*+0x88*/  /*packed*/ class CheckBoxWindow *myBuildingTexturesCheckBoxWindow;
	/*+0x8c*/  /*packed*/ class CheckBoxWindow *myObjectTexturesCheckBoxWindow;
	/*+0x90*/  /*packed*/ class CheckBoxWindow *mySkyDisplayCheckBoxWindow;
	/*+0x94*/  /*unpacked*/ class ButtonGroup *myDisplayResolutionButtonGroup;
	/*+0x98*/  /*packed*/ class SliderWindow *myFogSliderWindow;
	/*+0x9c*/  /*packed*/ class CBackBuffer *mySkyImage;
	/*+0xa0*/  /*packed*/ class CBackBuffer *myBuildingImage;
	/*+0xa4*/  /*packed*/ class MTimer mySkyTimer; // 0x10 bytes
	/*+0xb4*/  long lSkyImagePanX;
};

// Type: /*packed*/ class TextWindow (forward reference);
// VTABLE: COPTER_D 0x00591a90
class TextWindow : public GraphicWindow
{ // packed(0xa4 bytes) TI: 0x4411
public:
	void TextWindow(/*packed*/ class MRect&, int32_t, const /*packed*/ class basic_string<char>&, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	void TextWindow(/*packed*/ class MRect&, int32_t, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	void TextWindow();
	virtual int32_t DrawSelf() /* override */;
	virtual void SetWindowTitle(const /*packed*/ class basic_string<char>&); // vtable+0xc4
	virtual void SetWindowTitle(int32_t); // vtable+0xc8
	virtual void SetFontCharacteristics(long, long, long); // vtable+0xcc
	virtual void SetTextDrawStyle(unsigned long); // vtable+0xd0
	virtual void SetTextColor(const /*packed*/ struct SparkalColor&); // vtable+0xd4
	virtual void SetBackgroundDrawing(int32_t); // vtable+0xd8
	virtual void LoadStrings(); // vtable+0xdc
	virtual void FitWindowToText(); // vtable+0xe0
	virtual int32_t ResizeWindowForExactLineHeights(); // vtable+0xe4
protected:
	/*+0x74*/  int32_t bDrawOpaqueBackground;
	/*+0x78*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x7c*/  int32_t nBackgroundPaletteIndex;
	/*+0x80*/  int32_t nWindowTitleTextID;
	/*+0x84*/  /*packed*/ class MFont fontText; // 0x1c bytes
	/*+0xa0*/  unsigned long nTextDrawStyle;
};

// Type: /*packed*/ class RadioButtonWindow (forward reference);
// VTABLE: COPTER_D 0x00591d38
class RadioButtonWindow : public ButtonWindow
{ // packed(0x98 bytes) TI: 0x1554
public:
	void RadioButtonWindow(/*unpacked*/ class ButtonGroup*, /*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void RadioButtonWindow();
	virtual void ~RadioButtonWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual int32_t GetImageCount() /* override */;
	virtual int32_t ComposeSelf() /* override */;
	virtual void AddToGroup(/*unpacked*/ class ButtonGroup*); // vtable+0xdc
	virtual int32_t RemoveFromGroup(); // vtable+0xe0
	virtual void SetState(int32_t) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
protected:
	/*+0x94*/  /*unpacked*/ class ButtonGroup *myRadioButtonGroup;
};

// Type: /*unpacked*/ class CBackBuffer (forward reference);
// CBackBuffer Class implementation not found

// Type: /*packed*/ class SoundSettingsWindow (forward reference);
// VTABLE: COPTER_D 0x0058fce8
class SoundSettingsWindow : public GraphicWindow
{ // packed(0x88 bytes) TI: 0x2a87
public:
	void SoundSettingsWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual int32_t Initialize() /* override */;
	int32_t SetCurrentVolumeSettings(/*unpacked*/ struct SoundPreferences&);
	int32_t SetCurrentRadioSettings(/*packed*/ struct RadioPreferences&, long);
	void GetCurrentVolumeSettings(/*unpacked*/ struct SoundPreferences&);
	void GetCurrentRadioSettings(/*packed*/ struct RadioPreferences&);
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	// calltype: NearC
	static long ConvertSoundValueToSliderValue(long);
	// calltype: NearC
	static long ConvertSliderValueToSoundValue(long);
protected:
	/*+0x74*/  /*packed*/ class SliderWindow *myMasterVolumeSliderWindow;
	/*+0x78*/  /*packed*/ class SliderWindow *myRadioStationSliderWindow;
	/*+0x7c*/  /*packed*/ class SliderWindow *myRadioVolumeSliderWindow;
	/*+0x80*/  /*packed*/ class CheckBoxWindow *myDJCheckBoxWindow;
	/*+0x84*/  /*packed*/ class CheckBoxWindow *myCommercialCheckBoxWindow;
};

// Type: /*packed*/ struct SoundPreferences (forward reference);
struct SoundPreferences{ // packed(0x10 bytes) TI: 0x2845
	/*+0x0*/   long lMasterVolume;
	/*+0x4*/   long lDispatchVolume;
	/*+0x8*/   long lSoundEffectsVolume;
	/*+0xc*/   long lVehicleVolume;
};

// Type: /*packed*/ struct RadioPreferences (forward reference);
struct RadioPreferences{ // packed(0x1c bytes) TI: 0x2a39
	/*+0x0*/   long lVolume;
	/*+0x4*/   int32_t bPreferToBeOn;
	/*+0x8*/   long lCurrentStation;
	/*+0xc*/   int32_t bOptionDJ;
	/*+0x10*/  int32_t bOptionCommercials;
	/*+0x14*/  int32_t bAutoMute;
	/*+0x18*/  int32_t bOptionPlayEnglishIfDefaultLanguageNotFound;
};

// Type: /*packed*/ class CitySettingsWindow (forward reference);
// VTABLE: COPTER_D 0x0058fdd0
class CitySettingsWindow : public GraphicWindow
{ // packed(0x94 bytes) TI: 0x2a34
public:
	void CitySettingsWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual int32_t Initialize() /* override */;
	void SetCurrentCitySettings(/*packed*/ struct tagCitySettings*);
	void GetCurrentCitySettings(/*packed*/ struct tagCitySettings*);
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
protected:
	/*+0x74*/  /*packed*/ class SliderWindow *mySliderWindows[8]; // 0x20 bytes
};

// Type: /*packed*/ struct tagCitySettings (forward reference);
struct tagCitySettings{ // packed(0x24 bytes) TI: 0x26eb
	/*+0x0*/   long lDifficulty;
	/*+0x4*/   long lMissionFrequencyFire;
	/*+0x8*/   long lMissionFrequencyCrime;
	/*+0xc*/   long lMissionFrequencyRescue;
	/*+0x10*/  long lMissionFrequencyRiot;
	/*+0x14*/  long lMissionFrequencyTraffic;
	/*+0x18*/  long lMissionFrequencyMedEvac;
	/*+0x1c*/  long lMissionFrequencyTransport;
	/*+0x20*/  long lDaytime;
};

// Type: /*packed*/ class PopupMenuExtra (forward reference);
// VTABLE: COPTER_D 0x0058fe98
class PopupMenuExtra : public PopupMenuWindow
{ // packed(0xd8 bytes) TI: 0x2a3c
public:
	void PopupMenuExtra(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, char *);
	virtual void ~PopupMenuExtra() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual int32_t DrawSelf() /* override */;
	virtual int32_t CreateImage(); // vtable+0x15c
	virtual void DestroyImage() /* override */;
	virtual void CalculateAllMetrics() /* override */;
protected:
	virtual void ResizeWindowToFitMenuItems() /* override */;
	/*+0xcc*/  /*unpacked*/ class CBackBuffer *myBackgroundImage;
	/*+0xd0*/  /*packed*/ class basic_string<char> myBackgroundImageFileName; // 0x8 bytes
};

// Type: /*packed*/ class list<basic_string<char>>::iterator;
class list<basic_string<char>>::iterator : public bidirectional_iterator<basic_string<char>,int>
{ // packed(0x4 bytes) TI: 0x1cd3
protected:
	/*+0x0*/   /*packed*/ struct list<basic_string<char>>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<basic_string<char>>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<basic_string<char>>::iterator&);
	/*packed*/ class basic_string<char>& operator*();
	/*packed*/ class list<basic_string<char>>::iterator operator++(int32_t);
	/*packed*/ class list<basic_string<char>>::iterator& operator++();
	/*packed*/ class list<basic_string<char>>::iterator operator--(int32_t);
	/*packed*/ class list<basic_string<char>>::iterator& operator--();
};

// Type: /*packed*/ class MPoint;
class MPoint : public SparkalPoint
{ // packed(0x8 bytes) TI: 0x159a
public:
	void MPoint(unsigned long);
	void MPoint(/*packed*/ struct SparkalSize);
	void MPoint(/*packed*/ struct SparkalPoint);
	void MPoint(long, long);
	void MPoint();
	void Offset(/*packed*/ struct SparkalSize);
	void Offset(/*packed*/ struct SparkalPoint);
	void Offset(long, long);
	int32_t operator==(/*packed*/ struct SparkalPoint);
	int32_t operator!=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MSize operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator-();
	/*packed*/ class MPoint operator-(/*packed*/ struct SparkalSize);
};

// Type: /*packed*/ class TooltipWindow (forward reference);
// VTABLE: COPTER_D 0x0058fff8
class TooltipWindow : public TextWindow
{ // packed(0xb0 bytes) TI: 0x4449
public:
	void TooltipWindow(/*packed*/ class MRect&, int32_t, /*packed*/ class basic_string<char>&, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, char *);
	void TooltipWindow(/*packed*/ class MRect&, int32_t, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, char *);
	virtual void ~TooltipWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual void SetWindowTitle(/*packed*/ class basic_string<char>&) /* override */;
	virtual void SetWindowTitle(int32_t) /* override */;
	virtual int32_t DrawSelf() /* override */;
	virtual int32_t CreateImage(); // vtable+0xe8
	virtual void DestroyImage() /* override */;
	virtual void SetTextAndShow(/*packed*/ class MPoint&, int32_t); // vtable+0xec
	virtual void SetTextAndShow(/*packed*/ class MPoint&, /*packed*/ class basic_string<char>&); // vtable+0xf0
protected:
	/*+0xa4*/  /*unpacked*/ class CBackBuffer *myBackgroundImage;
	/*+0xa8*/  /*packed*/ class basic_string<char> myBackgroundImageFileName; // 0x8 bytes
};

// Type: /*packed*/ class BoneheadTextEditWindow (forward reference);
// VTABLE: COPTER_D 0x005900f0
class BoneheadTextEditWindow : public TextWindow
{ // packed(0xc4 bytes) TI: 0x444b
public:
	void BoneheadTextEditWindow(/*packed*/ class MRect&, int32_t, const /*packed*/ class basic_string<char>&, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, char *);
	void BoneheadTextEditWindow(/*packed*/ class MRect&, int32_t, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, char *);
	void BoneheadTextEditWindow();
	virtual void ~BoneheadTextEditWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual int32_t CreateImage(); // vtable+0xe8
	virtual void DestroyImage() /* override */;
	virtual int32_t DrawSelf() /* override */;
	virtual int32_t SetCaretPeriod(unsigned long); // vtable+0xec
	virtual long DoCharacter(long) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual void SetCharacterCountLimit(unsigned long); // vtable+0xf0
	virtual void GetEditText(char *, unsigned long); // vtable+0xf4
	virtual void GetEditText(/*packed*/ class basic_string<char>&); // vtable+0xf8
protected:
	virtual int32_t DoesWindowNeedUpdating() /* override */;
	virtual int32_t ProcessBackspace(); // vtable+0xfc
	virtual int32_t ProcessReturn(); // vtable+0x100
	/*+0xa4*/  /*unpacked*/ class CBackBuffer *mySecondImage;
	/*+0xa8*/  /*packed*/ class MTimer myCaretTimer; // 0x10 bytes
	/*+0xb8*/  unsigned long lCaretTimerPeriod;
	/*+0xbc*/  int32_t bCaretTimerExpired;
	/*+0xc0*/  unsigned long lCharacterCountLimit;
};

// Type: unsigned char *;

// Type: /*packed*/ class MessageBoxWindowEdit (forward reference);
// VTABLE: COPTER_D 0x005901f8
class MessageBoxWindowEdit : public MessageBoxWindow
{ // packed(0xa8 bytes) TI: 0x442a
public:
	void MessageBoxWindowEdit(/*packed*/ class MPoint&, unsigned long, /*packed*/ class basic_string<char>&, const /*packed*/ class basic_string<char>&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, int32_t, char *, char *, char *, char *);
	void MessageBoxWindowEdit(/*packed*/ class MPoint&, unsigned long, unsigned long, const /*packed*/ class basic_string<char>&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, int32_t, char *, char *, char *, char *);
	virtual int32_t Initialize() /* override */;
	virtual void GetEditText(char *, unsigned long); // vtable+0xd4
	virtual void GetEditText(/*packed*/ class basic_string<char>&); // vtable+0xd8
protected:
	/*+0xa4*/  /*packed*/ class BoneheadTextEditWindow *myTextEditWindow;
};

// Type: /*packed*/ class ScrollingCreditWindow (forward reference);
// VTABLE: COPTER_D 0x005902d8
class ScrollingCreditWindow : public GraphicWindow
{ // packed(0xcc bytes) TI: 0x4445
public:
	void ScrollingCreditWindow(int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual void ~ScrollingCreditWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual int32_t DrawSelf() /* override */;
	void RestartCreditDisplay();
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	int32_t ReadPalette(/*packed*/ struct SparkalColor*);
protected:
	virtual int32_t DoesWindowNeedUpdating() /* override */;
	int32_t LoadCreditStringArray();
	int32_t Scroll();
	/*+0x74*/  /*packed*/ class vector<basic_string<char>> myCreditStringArray; // 0xc bytes
	/*+0x80*/  long lFirstStringToDraw;
	/*+0x84*/  long lTopOfVisibleTextArea;
	/*+0x88*/  /*packed*/ class MRect rectVisibleTextArea; // 0x10 bytes
	/*+0x98*/  /*packed*/ class MFont fontCreditText; // 0x1c bytes
	/*+0xb4*/  /*packed*/ class MTimer myScrollTimer; // 0x10 bytes
	/*+0xc4*/  unsigned long lScrollTimerPeriod;
	/*+0xc8*/  int32_t bScrollTimerExpired;
};

// Type: /*packed*/ class CheckupWindow (forward reference);
// VTABLE: COPTER_D 0x005903a0
class CheckupWindow : public GraphicWindow
{ // packed(0x94 bytes) TI: 0x486b
public:
	void CheckupWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual int32_t Initialize() /* override */;
	void SetCurrentSettings(long *);
	void GetCurrentSettings(long *);
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	void SetTextControlsBasedOnCurrentSliderValues();
	void SetAllControlValuesToDefaults();
	// calltype: NearC
	static int32_t ShouldWeDisplayCheckupWindow();
	int32_t CanUserAffordCurrentSliderValues();
protected:
	/*+0x74*/  /*packed*/ class SliderWindow *mySliderWindows[3]; // 0xc bytes
	/*+0x80*/  /*packed*/ class TextWindow *myTextWindows[5]; // 0x14 bytes
};

// Type: long *;

// Type: uint32_t;

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ struct SparkalPoint;
struct SparkalPoint{ // packed(0x8 bytes) TI: 0x1a54
	/*+0x0*/   long x;
	/*+0x4*/   long y;
	void SparkalPoint(long, long);
	void SparkalPoint();
};

// Type: /*packed*/ class MessageBoxWindow;
// VTABLE: COPTER_D 0x0058fa80
class MessageBoxWindow : public GraphicWindow
{ // packed(0xa4 bytes) TI: 0x2a45
public:
	void MessageBoxWindow(/*packed*/ class MPoint&, unsigned long, /*packed*/ class basic_string<char>&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, int32_t, char *, char *, char *);
	void MessageBoxWindow(/*packed*/ class MPoint&, unsigned long, unsigned long, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, int32_t, char *, char *, char *);
	virtual int32_t Initialize() /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual void SetTextColor(const /*packed*/ struct SparkalColor&); // vtable+0xc4
	virtual void SetButtonTextColor(const /*packed*/ struct SparkalColor*, const /*packed*/ struct SparkalColor*); // vtable+0xc8
protected:
	virtual int32_t ConvertTypeToStringID(long); // vtable+0xcc
	virtual void DrawTextOntoBox(); // vtable+0xd0
	/*+0x74*/  long lMessageID;
	/*+0x78*/  /*packed*/ class basic_string<char> sMessage; // 0x8 bytes
	/*+0x80*/  /*packed*/ class basic_string<char> sButtonImageFileName; // 0x8 bytes
	/*+0x88*/  /*packed*/ class basic_string<char> sAnimationImageFileName; // 0x8 bytes
	/*+0x90*/  long lType;
	/*+0x94*/  int32_t bSelfDeleting;
	/*+0x98*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x9c*/  /*packed*/ struct SparkalColor colorButtonFont;
	/*+0xa0*/  /*packed*/ struct SparkalColor colorButtonFontHighlighted;
};

// Type: /*packed*/ class PopupMenuWindow;
// VTABLE: COPTER_D 0x00592220
class PopupMenuWindow : public ListBoxWindow
{ // packed(0xcc bytes) TI: 0x215d
public:
	void PopupMenuWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual int32_t Initialize() /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
protected:
	virtual void ResizeWindowToFitMenuItems(); // vtable+0x158
	virtual int32_t RemoveStringAtIndex(long) /* override */;
	virtual int32_t InsertStringAtIndex(long, /*packed*/ class basic_string<char>&) /* override */;
};

// Type: /*packed*/ class TextWindow;
// VTABLE: COPTER_D 0x00591a90
class TextWindow : public GraphicWindow
{ // packed(0xa4 bytes) TI: 0x4411
public:
	void TextWindow(/*packed*/ class MRect&, int32_t, const /*packed*/ class basic_string<char>&, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	void TextWindow(/*packed*/ class MRect&, int32_t, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	void TextWindow();
	virtual int32_t DrawSelf() /* override */;
	virtual void SetWindowTitle(const /*packed*/ class basic_string<char>&); // vtable+0xc4
	virtual void SetWindowTitle(int32_t); // vtable+0xc8
	virtual void SetFontCharacteristics(long, long, long); // vtable+0xcc
	virtual void SetTextDrawStyle(unsigned long); // vtable+0xd0
	virtual void SetTextColor(const /*packed*/ struct SparkalColor&); // vtable+0xd4
	virtual void SetBackgroundDrawing(int32_t); // vtable+0xd8
	virtual void LoadStrings(); // vtable+0xdc
	virtual void FitWindowToText(); // vtable+0xe0
	virtual int32_t ResizeWindowForExactLineHeights(); // vtable+0xe4
protected:
	/*+0x74*/  int32_t bDrawOpaqueBackground;
	/*+0x78*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x7c*/  int32_t nBackgroundPaletteIndex;
	/*+0x80*/  int32_t nWindowTitleTextID;
	/*+0x84*/  /*packed*/ class MFont fontText; // 0x1c bytes
	/*+0xa0*/  unsigned long nTextDrawStyle;
};

// Type: /*packed*/ class ButtonWindow;
// VTABLE: COPTER_D 0x00591b78
class ButtonWindow : public GraphicWindow
{ // packed(0x94 bytes) TI: 0x1a48
	enum ButtonState {
		nButtonStateDisabled = 0,
		nButtonStateOff = 1,
		nButtonStateOn = 2,
	};
public:
	void ButtonWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void ButtonWindow();
	virtual int32_t Initialize() /* override */;
	virtual int32_t GetImageCount(); // vtable+0xc4
	virtual void SetState(int32_t); // vtable+0xc8
	virtual int32_t GetState(); // vtable+0xcc
	virtual void Enable(); // vtable+0xd0
	virtual void Disable(); // vtable+0xd4
	virtual int32_t ComposeSelf() /* override */;
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
	virtual void SetTextColor(const /*packed*/ struct SparkalColor*, const /*packed*/ struct SparkalColor*); // vtable+0xd8
	virtual int32_t CanWeRespondToMessage() /* override */;
protected:
	/*+0x74*/  int32_t nButtonState;
	/*+0x78*/  int32_t bEnabled;
	/*+0x7c*/  int32_t nButtonTextHeight;
	/*+0x80*/  /*packed*/ class MSize sizeTextOffset; // 0x8 bytes
	/*+0x88*/  int32_t bBusySettingState;
	/*+0x8c*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x90*/  /*packed*/ struct SparkalColor colorFontHighlighted;
};

// Type: /*packed*/ struct bidirectional_iterator<basic_string<char>,int>;
struct bidirectional_iterator<basic_string<char>,int>{ // packed(0x1 bytes) TI: 0x1847
};

// Type: /*packed*/ class ListBoxWindow;
// VTABLE: COPTER_D 0x005920c8
class ListBoxWindow : public GraphicWindow
{ // packed(0xcc bytes) TI: 0x17a0
public:
	void ListBoxWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	void ListBoxWindow();
	virtual int32_t Initialize() /* override */;
	virtual int32_t DrawSelf() /* override */;
	virtual int32_t RemoveString(long); // vtable+0xc4
	virtual int32_t RemoveString(/*packed*/ class basic_string<char>&); // vtable+0xc8
	virtual void RemoveAllStrings(); // vtable+0xcc
	virtual int32_t InsertString(long, long); // vtable+0xd0
	virtual int32_t InsertString(/*packed*/ class basic_string<char>&, long); // vtable+0xd4
	virtual int32_t ResizeWindowForExactLineHeights(); // vtable+0xd8
	virtual int32_t SetSelection(long); // vtable+0xdc
	virtual long GetSelection(); // vtable+0xe0
	virtual void SetShouldSort(); // vtable+0xe4
	virtual void Sort(); // vtable+0xe8
	virtual int32_t MoveLineUp(); // vtable+0xec
	virtual int32_t MoveLineDown(); // vtable+0xf0
	virtual int32_t ScrollToStart(); // vtable+0xf4
	virtual int32_t ScrollToEnd(); // vtable+0xf8
	virtual int32_t ScrollPageUp(); // vtable+0xfc
	virtual int32_t ScrollPageDown(); // vtable+0x100
	virtual int32_t IsIndexInView(long); // vtable+0x104
	virtual void PutIndexInView(long); // vtable+0x108
	virtual int32_t ScrollToFirstLetter(char); // vtable+0x10c
	virtual void SetIndexOfTopLine(long); // vtable+0x110
	virtual long GetLineCount(); // vtable+0x114
	virtual long GetIndexOfTopLine(); // vtable+0x118
	virtual long DoCharacter(long) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual void SetBackgroundDrawing(int32_t); // vtable+0x11c
	virtual void SetBackgroundPaletteIndex(int32_t, int32_t); // vtable+0x120
	virtual void SetTextColor(const /*packed*/ struct SparkalColor*, const /*packed*/ struct SparkalColor*); // vtable+0x124
	virtual void SetFontCharacteristics(long, long, long); // vtable+0x128
	virtual int32_t AddScrollBar(int32_t, int32_t, char *); // vtable+0x12c
	virtual void RemoveScrollBar(int32_t, int32_t); // vtable+0x130
protected:
	virtual void CalculateAllMetrics(); // vtable+0x134
	virtual int32_t GetStringAddressFromIndex(long, /*packed*/ class basic_string<char>*&); // vtable+0x138
	virtual int32_t GetStringFromIndex(long, /*packed*/ class basic_string<char>&); // vtable+0x13c
	virtual int32_t GetIndexFromString(long&, /*packed*/ class basic_string<char>&); // vtable+0x140
	virtual int32_t RemoveStringAtIndex(long); // vtable+0x144
	virtual int32_t InsertStringAtIndex(long, /*packed*/ class basic_string<char>&); // vtable+0x148
	virtual int32_t ModifyString(long, /*packed*/ class basic_string<char>&); // vtable+0x14c
	virtual void SetScrollBarValue(); // vtable+0x150
	virtual void SetScrollBarSizes(); // vtable+0x154
	/*+0x74*/  /*packed*/ class list<basic_string<char>> myStringList; // 0x8 bytes
	/*+0x7c*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x80*/  /*packed*/ struct SparkalColor colorFontHighlighted;
	/*+0x84*/  int32_t nBackgroundIndex;
	/*+0x88*/  int32_t nBackgroundIndexHighlighted;
	/*+0x8c*/  /*packed*/ class MFont fontText; // 0x1c bytes
	/*+0xa8*/  unsigned long nTextDrawStyle;
	/*+0xac*/  long lCurrentSelection;
	/*+0xb0*/  long lVisibleLines;
	/*+0xb4*/  long lFirstVisibleLine;
	/*+0xb8*/  long lLineHeight;
	/*+0xbc*/  int32_t bAlwaysSort;
	/*+0xc0*/  /*packed*/ class ScrollBarWindow *myVerticalScrollBarWindow;
	/*+0xc4*/  /*packed*/ class ScrollBarWindow *myHorizontalScrollBarWindow;
	/*+0xc8*/  int32_t bBusySettingSelection;
};



// Contribution: 1:0004f050-0005f979 Module: 45, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00450050
static void $E66() {

	__asm        call   $E65;
	__asm        jmp    near ptr 0x00450060;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00450065
static void $E65() {

	__asm        mov    colorTextGamePaletteNormal.Blue, 0xA;
	__asm        mov    colorTextGamePaletteNormal.Green, 0x85;
	__asm        mov    colorTextGamePaletteNormal.Red, 0xDA;
	__asm        jmp    near ptr 0x00450085;

	__asm        jmp    near ptr 0x0045008A;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x0045008f
static void $E69() {

	__asm        call   $E68;
	__asm        jmp    near ptr 0x0045009F;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x004500a4
static void $E68() {

	__asm        mov    colorTextGamePaletteHighlighted.Blue, 0x6F;
	__asm        mov    colorTextGamePaletteHighlighted.Green, 0xDA;
