// Module: flatimg.obj
// Source: C:\Copter\source\sparkal\flatimg.cpp
// autogenerated by simcopter_tool from PDB file

// Type: unsigned long;

// Type: void;

// Type: /*packed*/ class IFlatImage (forward reference);
// VTABLE: COPTER_D 0x00591050
class IFlatImage{ // packed(0x18 bytes) TI: 0x13a1
public:
	void IFlatImage();
	virtual unsigned long Lock(); // vtable+0x0
	virtual unsigned long Unlock(); // vtable+0x4
	unsigned long GetLockCount();
	virtual void SetTransparentColor(int32_t, long); // vtable+0x8
	long GetHeight();
	long GetWidth();
	void * __ptr32 GetBitsPointer();
	long GetStride();
	virtual unsigned long Compose(/*packed*/ class IFlatImage*, long, long, long, long, long, long); // vtable+0xc
	unsigned long Compose(/*packed*/ class IFlatImage*, long, long);
	virtual unsigned long StretchCompose(/*packed*/ class IFlatImage*, long, long, long, long, long, long, long, long); // vtable+0x10
	virtual unsigned long StretchCompose(/*packed*/ class IFlatImage*, /*packed*/ struct SparkalRect, /*packed*/ struct SparkalRect); // vtable+0x14
	virtual unsigned long FillRect(long, /*packed*/ struct SparkalRect*); // vtable+0x18
	void DrawPixel(unsigned char, long, long);
	unsigned char GetPixel(long, long);
	static unsigned long lTotalMemoryUsage;
	static unsigned long lTotalLockCount;
protected:
	/*+0x4*/   unsigned long mLockCount;
	/*+0x8*/   long mWidth;
	/*+0xc*/   long mHeight;
	/*+0x10*/  void * __ptr32 mpBits;
	/*+0x14*/  long mStride;
};

// Type: long;

// Type: unsigned char *;

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ struct SparkalRect (forward reference);
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: int32_t;

// Type: unsigned char;

// Type: /*packed*/ class CFlatImage (forward reference);
// VTABLE: COPTER_D 0x00591070
class CFlatImage : public IFlatImage
{ // packed(0x1c bytes) TI: 0x20e3
public:
	void CFlatImage(/*unpacked*/ class IFlatImage*, long, long, long, long);
	void CFlatImage(long, long, unsigned char);
	void CFlatImage();
	virtual void ~CFlatImage(); // vtable+0x1c
	virtual unsigned long Lock() /* override */;
	virtual unsigned long Unlock() /* override */;
protected:
	/*+0x18*/  void * __ptr32 mBitsHandle;
};

// Type: uint32_t;

// Type: /*unpacked*/ class IFlatImage (forward reference);
// IFlatImage Class implementation not found



// Contribution: 1:0008e120-0008ee82 Module: 24, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x0048f120
void IFlatImage::IFlatImage() {

	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+4], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+8], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+0xC], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+0x10], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+0x14], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax], 0x591050;
// LINE 27:
	return;

	__asm        mov    eax, this;
}

// FUNCTION: COPTER_D 0x0048f174
