// Module: Gamemode.obj
// Source: C:\Copter\source\sparkal\Gamemode.cpp
// autogenerated by simcopter_tool from PDB file

// Type: char *;

// Type: /*packed*/ class CopterGameMode (forward reference);
class CopterGameMode{ // packed(0x4 bytes) TI: 0x170f
public:
	/*+0x0*/   int32_t nModeID;
	void CopterGameMode(const /*packed*/ class CopterGameMode&);
	void CopterGameMode(int32_t);
	void CopterGameMode();
	/*packed*/ class CopterGameMode& operator=(const /*packed*/ class CopterGameMode&);
};

// Type: void;

// Type: int32_t;

// Type: /*packed*/ class GameModeCoreData (forward reference);
// VTABLE: COPTER_D 0x005923c0
class GameModeCoreData{ // packed(0x14 bytes) TI: 0x1853
public:
	void GameModeCoreData();
	virtual void ~GameModeCoreData(); // vtable+0x0
	/*+0x4*/   long lPauseCount;
	/*+0x8*/   /*packed*/ struct SparkalColor *pColorTable;
	/*+0xc*/   /*unpacked*/ class CGameApp *pGameApp;
	/*+0x10*/  /*packed*/ class ScreenWindow *pScreenWindow;
};

// Type: /*packed*/ class GameModeMainMenuData (forward reference);
// VTABLE: COPTER_D 0x005923c4
class GameModeMainMenuData : public GameModeCoreData
{ // packed(0x18 bytes) TI: 0x41e1
public:
	void GameModeMainMenuData();
	void CreatePalette();
	void UsePalette();
	int32_t CreateAllSurfaces();
	int32_t DestroyAllSurfaces();
	void Shutdown();
	/*+0x14*/  /*unpacked*/ class SmackerBackBuffer *myVideoBuffer;
};

// Type: char;

// Type: /*packed*/ struct UserMenuWindowDescription;
struct UserMenuWindowDescription{ // packed(0x54 bytes) TI: 0x101b
	/*+0x0*/   /*packed*/ class basic_string<char> sImageFileName; // 0x8 bytes
	/*+0x8*/   int32_t nTransparentIndex;
	/*+0xc*/   /*packed*/ class MRect rectPosition; // 0x10 bytes
	/*+0x1c*/  long lMenuStringResourceIndex;
	/*+0x20*/  long lMenuStringResourceCount;
	/*+0x24*/  long lSelectionBase;
	/*+0x28*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x2c*/  /*packed*/ struct SparkalColor colorFontHighlighted;
	/*+0x30*/  /*packed*/ class MPoint ptPositionFirstItem; // 0x8 bytes
	/*+0x38*/  int32_t nSizeItemFont;
	/*+0x3c*/  int32_t nLineHeight;
	/*+0x40*/  long lTitleStringResourceIndex;
	/*+0x44*/  int32_t bTitleCentered;
	/*+0x48*/  /*packed*/ class MPoint ptTitlePosition; // 0x8 bytes
	/*+0x50*/  int32_t nSizeTitleFont;
};

// Type: /*packed*/ class UserMenuWindow (forward reference);
// VTABLE: COPTER_D 0x005912f8
class UserMenuWindow : public GraphicWindow
{ // packed(0x152 bytes) TI: 0x45d0
public:
	void UserMenuWindow(/*packed*/ struct UserMenuWindowDescription&, int32_t, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t);
	void UserMenuWindow();
	virtual void ~UserMenuWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual int32_t DrawSelf() /* override */;
	virtual int32_t SetSelectionIndex(int32_t); // vtable+0xc4
	virtual int32_t SetSelectionValue(int32_t); // vtable+0xc8
	virtual int32_t GetSelectionIndex(); // vtable+0xcc
	virtual int32_t GetSelectionValue(); // vtable+0xd0
	virtual int32_t GetLineCount(); // vtable+0xd4
	virtual long DoCharacter(long) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
	virtual int32_t ExecuteSelection(int32_t); // vtable+0xd8
protected:
	virtual void DrawSelectionIndicators(); // vtable+0xdc
	virtual int32_t DoCursorHitTest(int32_t&, long, long); // vtable+0xe0
	virtual int32_t GetPositionOfNthItem(int32_t, /*packed*/ class MPoint&); // vtable+0xe4
	/*+0x74*/  /*packed*/ struct UserMenuWindowDescription myUserMenuWindowDescription; // 0x54 bytes
	/*+0xc8*/  /*packed*/ class vector<TextWindow *> myTextWindowPtrArray; // 0xc bytes
	/*+0xd4*/  int32_t nCurrentSelection;
	/*+0xd8*/  /*packed*/ class DigitalSound soundSelectionChange; // 0x7a bytes
};

// Type: /*packed*/ class GameModePickCareerCityData (forward reference);
// VTABLE: COPTER_D 0x005923c8
class GameModePickCareerCityData : public GameModeCoreData
{ // packed(0x30 bytes) TI: 0x45d6
	enum PickCareerCitySubMode {
		nPickCareerCitySubModeSelect = 0,
		nPickCareerCitySubModeVideo = 1,
	};
public:
	void GameModePickCareerCityData();
	void Initialize();
	void CreatePalette();
	void UsePalette();
	int32_t CreateAllSurfaces();
	int32_t DestroyAllSurfaces();
	void Shutdown();
	/*+0x14*/  /*unpacked*/ class SmackerBackBuffer *myVideoBuffer;
	/*+0x18*/  int32_t nSubMode;
	/*+0x1c*/  /*packed*/ class MRect rectVideo; // 0x10 bytes
	/*+0x2c*/  int32_t bFirstCareerCityData;
};

// Type: /*packed*/ class CareerWindow (forward reference);
// VTABLE: COPTER_D 0x00590ef4
class CareerWindow : public GraphicWindow
{ // packed(0x840 bytes) TI: 0x47a5
public:
	void CareerWindow(/*packed*/ class MRect&, int32_t, void * __ptr32, long *, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, int32_t);
	virtual void ~CareerWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual int32_t DrawSelf() /* override */;
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual void DestroyImage() /* override */;
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32) /* override */;
	virtual long DoKeyDown(long, char) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
	long SetCurrentCitySelection(long);
	long GetCurrentCitySelection();
	class CareerWindow::CitySelectionFrame{ // packed(0x50 bytes) TI: 0x12ad
	public:
		void CitySelectionFrame(int32_t, int32_t, int32_t);
		virtual void ~CitySelectionFrame(); // vtable+0x0
		void FillDestinationPoints(/*packed*/ class MPoint*);
		void FillSourceRects(/*packed*/ class MRect*);
		/*+0x4*/   int32_t bLeft;
		/*+0x8*/   int32_t bTop;
		/*+0xc*/   int32_t bSelected;
		/*+0x10*/  /*packed*/ class MRect rectFrame[4]; // 0x40 bytes
	};
protected:
	void DrawCitySelection();
	void GetCoordinatesForCitySelections(/*packed*/ class MPoint[4]*, /*packed*/ class MRect[4]*);
	/*+0x74*/  long lCurrentCitySelection;
	/*+0x78*/  /*packed*/ class MRect rectCities[3]; // 0x30 bytes
	/*+0xa8*/  long lCities[3]; // 0xc bytes
	/*+0xb4*/  int32_t nCityCount;
	/*+0xb8*/  int32_t bAllowCancel;
	/*+0xbc*/  /*packed*/ class SmackerBackBuffer mySmackerBackBuffers[3]; // 0x774 bytes
	/*+0x830*/ void * __ptr32 myPlatformWindow;
	/*+0x834*/ /*unpacked*/ class TextWindow *cityNameTextWindow;
	/*+0x838*/ /*unpacked*/ class TextWindow *cityLevelTextWindow;
	/*+0x83c*/ /*unpacked*/ class CBackBuffer *mySelectionImage;
};

// Type: long *;

// Type: /*packed*/ class GameModePlayData (forward reference);
// VTABLE: COPTER_D 0x005923cc
class GameModePlayData : public GameModeCoreData
{ // packed(0xb18 bytes) TI: 0x47a7
	enum ExceptionState {
		nExceptionStateNone = 0,
		nExceptionStateVRAppInit = 1,
		nExceptionStateGamePlay = 2,
	};
public:
	void GameModePlayData();
	void Initialize();
	void CreatePalette();
	void UsePalette();
	void SetCommandsToDefaults();
	int32_t CreateAllSurfaces();
	void DestroyAllSurfaces();
	int32_t CreateIndependentSurfaces();
	void DestroyIndependentSurfaces();
	void HidePanels();
	void ShowPanels();
	void HideEquipment();
	void ShowEquipment();
	void TogglePanelDisplay();
	void ToggleEquipmentDisplay();
	int32_t CreatePanels();
	int32_t DestroyPanels();
	void Shutdown();
	void Sleep();
	void Awake();
	long TestForUserInHelicopter();
	int32_t IsUserInHelicopterNow();
	int32_t IsUserAloneNow();
	long ProcessUserJustJumpedIntoHelicopter();
	long ProcessUserJustJumpedOutOfHelicopter();
	void MakeSureHeliHasProperFlaps();
	void SetUpRenderWindowSizes();
	void ReadUserConfigurableCommands();
	void RemoveUserConfigurableCommands();
	void SetUserConfigurableCommandsToDefaults();
	void SetNonUserConfigurableCommandsToDefaults();
	/*+0x14*/  enum GameModePlayData::ExceptionState nExceptionState;
	/*+0x18*/  int32_t nRenderWindowWidth;
	/*+0x1c*/  int32_t nRenderWindowHeight;
	/*+0x20*/  int32_t nShortenedRenderWindowWidth;
	/*+0x24*/  int32_t nShortenedRenderWindowHeight;
	/*+0x28*/  int32_t bPanelsVisibleWhenInCopter;
	/*+0x2c*/  int32_t bShowingPanels;
	/*+0x30*/  int32_t bShowingEquipment;
	/*+0x34*/  int32_t bUserWasInHelicopterOnLastCheck;
	/*+0x38*/  /*unpacked*/ class CBackBuffer *pStretchBuffer;
	/*+0x3c*/  /*unpacked*/ class SkyImage *pSkyImage;
	/*+0x40*/  /*unpacked*/ class GraphicWindow *pPanel0;
	/*+0x44*/  /*unpacked*/ class GraphicWindow *pPanel1;
	/*+0x48*/  /*unpacked*/ class GraphicWindow *pPanel2;
	/*+0x4c*/  /*unpacked*/ class GraphicWindow *pPanel3;
	/*+0x50*/  /*packed*/ class RadioCompassWindow *pPanel4;
	/*+0x54*/  /*packed*/ class MapWindow *pPanel5;
	/*+0x58*/  /*packed*/ class DialWindow *pPanel6;
	/*+0x5c*/  /*unpacked*/ class GraphicWindow *pFlap0;
	/*+0x60*/  /*unpacked*/ class GraphicWindow *pFlap1;
	/*+0x64*/  /*unpacked*/ class GraphicWindow *pFlap2;
	/*+0x68*/  /*unpacked*/ class GraphicWindow *pFlap3;
	/*+0x6c*/  /*packed*/ class PassengerWindow *pPassengerWindow;
	/*+0x70*/  /*packed*/ struct CommandSystem commandSystem; // 0xaa8 bytes
};

// Type: /*packed*/ class MRect;
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: /*packed*/ struct tagUserPersonalInfo (forward reference);
struct tagUserPersonalInfo{ // packed(0x58 bytes) TI: 0x1a2a
	/*+0x0*/   char szUserName[64]; // 0x40 bytes
	/*+0x40*/  long lMoney;
	/*+0x44*/  long lHelicopters;
	/*+0x48*/  long lEquipment;
	/*+0x4c*/  long lTrophies;
	/*+0x50*/  long lPoints;
	/*+0x54*/  long lTeargasCount;
};

// Type: long;

// Type: /*packed*/ class list<Shortcut>::iterator;
class list<Shortcut>::iterator : public bidirectional_iterator<Shortcut,int>
{ // packed(0x4 bytes) TI: 0x1081
protected:
	/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<Shortcut>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<Shortcut>::iterator&);
	/*packed*/ struct Shortcut& operator*();
	/*packed*/ class list<Shortcut>::iterator operator++(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator++();
	/*packed*/ class list<Shortcut>::iterator operator--(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator--();
};

// Type: /*packed*/ struct Shortcut;
struct Shortcut{ // packed(0x18 bytes) TI: 0x1083
	/*+0x0*/   long lDeviceID;
	/*+0x4*/   long lCommand;
	/*+0x8*/   long lKey;
	/*+0xc*/   long lModifiers;
	/*+0x10*/  long lPush;
	/*+0x14*/  long lIgnoreModifiers;
};

// Type: /*packed*/ class GameModeHangarData (forward reference);
// VTABLE: COPTER_D 0x005923d0
class GameModeHangarData : public GameModeCoreData
{ // packed(0xac0 bytes) TI: 0x2b10
public:
	void GameModeHangarData();
	int32_t CreateAllSurfaces();
	void DestroyAllSurfaces();
	void Shutdown();
	void SetCommandsToDefaults();
	void Sleep();
	void Awake();
	void CreatePalette();
	void UsePalette();
	/*+0x14*/  /*unpacked*/ class HangarWindow *pHangarWindow;
	/*+0x18*/  /*packed*/ struct CommandSystem commandSystem; // 0xaa8 bytes
};

// Type: /*packed*/ class GameModeCatalogData (forward reference);
// VTABLE: COPTER_D 0x005923d4
class GameModeCatalogData : public GameModeCoreData
{ // packed(0xac0 bytes) TI: 0x2b12
public:
	void GameModeCatalogData();
	void SetCommandsToDefaults();
	int32_t CreateAllSurfaces();
	void DestroyAllSurfaces();
	void Shutdown();
	void Sleep();
	void Awake();
	void CreatePalette();
	void UsePalette();
	/*+0x14*/  /*unpacked*/ class CatalogWindow *pCatalogWindow;
	/*+0x18*/  /*packed*/ struct CommandSystem commandSystem; // 0xaa8 bytes
};

// Type: /*packed*/ class GameModeMissionLogData (forward reference);
// VTABLE: COPTER_D 0x005923d8
class GameModeMissionLogData : public GameModeCoreData
{ // packed(0xac0 bytes) TI: 0x2b0e
public:
	void GameModeMissionLogData();
	void SetCommandsToDefaults();
	int32_t CreateAllSurfaces();
	void DestroyAllSurfaces();
	void Shutdown();
	void Sleep();
	void Awake();
	void CreatePalette();
	void UsePalette();
	/*+0x14*/  /*unpacked*/ class MissionLogWindow *pMissionLogWindow;
	/*+0x18*/  /*packed*/ struct CommandSystem commandSystem; // 0xaa8 bytes
};

// Type: /*packed*/ class GameModeInventoryData (forward reference);
// VTABLE: COPTER_D 0x005923dc
class GameModeInventoryData : public GameModeCoreData
{ // packed(0xac0 bytes) TI: 0x28d1
public:
	void GameModeInventoryData();
	void SetCommandsToDefaults();
	int32_t CreateAllSurfaces();
	void DestroyAllSurfaces();
	void Shutdown();
	void Sleep();
	void Awake();
	void CreatePalette();
	void UsePalette();
	/*+0x14*/  /*unpacked*/ class InventoryWindow *pInventoryWindow;
	/*+0x18*/  /*packed*/ struct CommandSystem commandSystem; // 0xaa8 bytes
};

// Type: uint32_t;

// Type: /*packed*/ struct bidirectional_iterator<Shortcut,int>;
struct bidirectional_iterator<Shortcut,int>{ // packed(0x1 bytes) TI: 0x1ee7
};

// Type: /*packed*/ class GameModeCoreData;
// VTABLE: COPTER_D 0x005923c0
class GameModeCoreData{ // packed(0x14 bytes) TI: 0x1853
public:
	void GameModeCoreData();
	virtual void ~GameModeCoreData(); // vtable+0x0
	/*+0x4*/   long lPauseCount;
	/*+0x8*/   /*packed*/ struct SparkalColor *pColorTable;
	/*+0xc*/   /*unpacked*/ class CGameApp *pGameApp;
	/*+0x10*/  /*packed*/ class ScreenWindow *pScreenWindow;
};

// Type: /*unpacked*/ class GraphicWindow (forward reference);
// GraphicWindow Class implementation not found

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};



// Contribution: 1:000bc670-000c27dd Module: 1, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004bd670
void CopterGameMode::CopterGameMode() {
// LINE 51:
	this->nModeID = 0x0;
// LINE 52:
	return;

	__asm        mov    eax, this;
}

// FUNCTION: COPTER_D 0x004bd692
void CopterGameMode::CopterGameMode(int32_t nNewModeID) {

	this->nModeID = nNewModeID;
// LINE 57:
	return;

	__asm        mov    eax, this;
}

// FUNCTION: COPTER_D 0x004bd6b5
void CopterGameMode::CopterGameMode(const /*packed*/ class CopterGameMode& newGameMode) {
// LINE 61:
	this->CopterGameMode::operator=(newGameMode);
// LINE 62:
	return;

	__asm        mov    eax, this;
}

// FUNCTION: COPTER_D 0x004bd6dc
/*packed*/ class CopterGameMode& CopterGameMode::operator=(const /*packed*/ class CopterGameMode& newGameMode) {
// LINE 65:
	this->nModeID = newGameMode.nModeID;
// LINE 66:
	return this;
// LINE 67:
