// Module: Gameapp8.obj
// Source: C:\Copter\source\sparkal\Gameapp8.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct list<DirectoryEntry>::list_node_buffer (forward reference);
struct list<DirectoryEntry>::list_node_buffer{ // packed(0x8 bytes) TI: 0x2390
	/*+0x0*/   void * __ptr32 next_buffer;
	/*+0x4*/   /*packed*/ struct list<DirectoryEntry>::list_node *buffer;
};

// Type: /*packed*/ struct list<DirectoryEntry>::list_node (forward reference);
struct list<DirectoryEntry>::list_node{ // packed(0x18 bytes) TI: 0x2392
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*packed*/ class DirectoryEntry data; // 0x10 bytes
};

// Type: uint32_t;

// Type: char *;

// Type: long;

// Type: char;

// Type: /*packed*/ struct tagUserCityInfo;
struct tagUserCityInfo{ // packed(0x80 bytes) TI: 0x2b80
	/*+0x0*/   /*packed*/ struct tagCitySettings citySettings; // 0x24 bytes
	/*+0x24*/  long bUserHasSavedGame;
	/*+0x28*/  /*packed*/ struct tagUserPersonalInfo userPersonalInfo; // 0x58 bytes
};

// Type: unsigned long;

// Type: int32_t;

// Type: /*packed*/ struct tagCitySettings;
struct tagCitySettings{ // packed(0x24 bytes) TI: 0x26eb
	/*+0x0*/   long lDifficulty;
	/*+0x4*/   long lMissionFrequencyFire;
	/*+0x8*/   long lMissionFrequencyCrime;
	/*+0xc*/   long lMissionFrequencyRescue;
	/*+0x10*/  long lMissionFrequencyRiot;
	/*+0x14*/  long lMissionFrequencyTraffic;
	/*+0x18*/  long lMissionFrequencyMedEvac;
	/*+0x1c*/  long lMissionFrequencyTransport;
	/*+0x20*/  long lDaytime;
};

// Type: /*packed*/ struct tagCurrentCareerCityInfo;
struct tagCurrentCareerCityInfo{ // packed(0x6c bytes) TI: 0x26e5
	/*+0x0*/   long lCurrentCities[3]; // 0xc bytes
	/*+0xc*/   long lCurrentCityIndex;
	/*+0x10*/  long bUserHasSavedGame;
	/*+0x14*/  /*packed*/ struct tagUserPersonalInfo userPersonalInfo; // 0x58 bytes
};

// Type: /*packed*/ class MIFF;
// VTABLE: COPTER_D 0x00591950
class MIFF : public PFile
{ // packed(0x148 bytes) TI: 0x428e
public:
	void MIFF(char *);
	void MIFF();
	virtual void ~MIFF() /* override */;
	virtual long OpenForReading(); // vtable+0x4
	virtual long OpenForWriting(long, long, long); // vtable+0x8
	virtual long OpenForAppending(); // vtable+0xc
	virtual long Close(); // vtable+0x10
	virtual long GetPresentRecordType(); // vtable+0x14
	virtual long GetPresentRecordSize(); // vtable+0x18
	virtual long GetPresentRecordDataSize(); // vtable+0x1c
	virtual long GetPresentRecordIndex(); // vtable+0x20
	virtual long VerifyFile(); // vtable+0x24
	virtual long ReadMIFFHeader(); // vtable+0x28
	virtual long ReadRecordHeader(); // vtable+0x2c
	virtual long ReadFileCreator(); // vtable+0x30
	virtual long ReadFileType(); // vtable+0x34
	virtual long ReadFileVersion(); // vtable+0x38
	virtual long ReadPresentRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x3c
	virtual long ReadPresentRecordData(char *, long); // vtable+0x40
	virtual long GoToFirstRecord(); // vtable+0x44
	virtual long GoToNextRecord(); // vtable+0x48
	virtual long GoToPreviousRecord(); // vtable+0x4c
	virtual long GoToFirstRecordOfGivenType(long); // vtable+0x50
	virtual long GoToNextRecordOfGivenType(long); // vtable+0x54
	virtual long GoToNthRecord(long); // vtable+0x58
	virtual long CountRecords(); // vtable+0x5c
	virtual long WriteMIFFRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x60
	virtual long WriteDataRecord(long, char *, long); // vtable+0x64
	virtual long WriteFileHeader(long, long, long); // vtable+0x68
	virtual long WriteEnd(); // vtable+0x6c
	/*+0x110*/ long lPresentRecordStart;
	/*+0x114*/ long lPresentRecordType;
	/*+0x118*/ long lPresentRecordLength;
	/*+0x11c*/ long lPresentRecordIndex;
	/*+0x120*/ long lReadWriteMode;
	/*+0x124*/ long bFileEndWritten;
	/*+0x128*/ long bFileAppearsCorrupt;
	/*+0x12c*/ /*packed*/ struct MIFFHeader myMIFFHeader; // 0x1c bytes
};

// Type: void;

// Type: /*packed*/ class list<DirectoryEntry> (forward reference);
class list<DirectoryEntry>{ // packed(0x8 bytes) TI: 0x236c
	using void_pointer = void * __ptr32;
	struct list<DirectoryEntry>::list_node{ // packed(0x18 bytes) TI: 0x2392
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*packed*/ class DirectoryEntry data; // 0x10 bytes
	};
protected:
	static /*packed*/ class allocator<list<DirectoryEntry>::list_node> list_node_allocator;
	static /*packed*/ class allocator<DirectoryEntry> value_allocator;
	using value_type = /*packed*/ class DirectoryEntry;
	using value_allocator_type = /*packed*/ class allocator<DirectoryEntry>;
	using pointer = /*packed*/ class DirectoryEntry*;
	using reference = /*packed*/ class DirectoryEntry&;
	using const_reference = const /*packed*/ class DirectoryEntry&;
	using list_node_allocator_type = /*packed*/ class allocator<list<DirectoryEntry>::list_node>;
	using link_type = /*packed*/ struct list<DirectoryEntry>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<DirectoryEntry>::list_node_buffer{ // packed(0x8 bytes) TI: 0x2390
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<DirectoryEntry>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<DirectoryEntry>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<DirectoryEntry>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<DirectoryEntry>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<DirectoryEntry>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<DirectoryEntry>::list_node *free_list;
	static /*packed*/ struct list<DirectoryEntry>::list_node *next_avail;
	static /*packed*/ struct list<DirectoryEntry>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<DirectoryEntry>::list_node* get_node();
	void put_node(/*packed*/ struct list<DirectoryEntry>::list_node*);
	/*+0x0*/   /*packed*/ struct list<DirectoryEntry>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<DirectoryEntry>::iterator : public bidirectional_iterator<DirectoryEntry,int>
	{ // packed(0x4 bytes) TI: 0x238e
	protected:
		/*+0x0*/   /*packed*/ struct list<DirectoryEntry>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<DirectoryEntry>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<DirectoryEntry>::iterator&);
		/*packed*/ class DirectoryEntry& operator*();
		/*packed*/ class list<DirectoryEntry>::iterator operator++(int32_t);
		/*packed*/ class list<DirectoryEntry>::iterator& operator++();
		/*packed*/ class list<DirectoryEntry>::iterator operator--(int32_t);
		/*packed*/ class list<DirectoryEntry>::iterator& operator--();
	};
	class list<DirectoryEntry>::const_iterator : public bidirectional_iterator<DirectoryEntry,int>
	{ // packed(0x4 bytes) TI: 0x2381
	protected:
		/*+0x0*/   /*packed*/ struct list<DirectoryEntry>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<DirectoryEntry>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<DirectoryEntry>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<DirectoryEntry>::const_iterator&);
		const /*packed*/ class DirectoryEntry& operator*();
		/*packed*/ class list<DirectoryEntry>::const_iterator operator++(int32_t);
		/*packed*/ class list<DirectoryEntry>::const_iterator& operator++();
		/*packed*/ class list<DirectoryEntry>::const_iterator operator--(int32_t);
		/*packed*/ class list<DirectoryEntry>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<DirectoryEntry>::const_iterator,DirectoryEntry,DirectoryEntry const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<DirectoryEntry>::iterator,DirectoryEntry,DirectoryEntry &,int>;
public:
	void list<DirectoryEntry>(const /*packed*/ class list<DirectoryEntry>&);
	void list<DirectoryEntry>(const /*packed*/ class DirectoryEntry*, const /*packed*/ class DirectoryEntry*);
	void list<DirectoryEntry>(uint32_t, const /*packed*/ class DirectoryEntry&);
	void list<DirectoryEntry>();
	/*packed*/ class list<DirectoryEntry>::const_iterator begin();
	/*packed*/ class list<DirectoryEntry>::iterator begin();
	/*packed*/ class list<DirectoryEntry>::const_iterator end();
	/*packed*/ class list<DirectoryEntry>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<DirectoryEntry>::const_iterator,DirectoryEntry,DirectoryEntry const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<DirectoryEntry>::iterator,DirectoryEntry,DirectoryEntry &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<DirectoryEntry>::const_iterator,DirectoryEntry,DirectoryEntry const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<DirectoryEntry>::iterator,DirectoryEntry,DirectoryEntry &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*packed*/ class DirectoryEntry& front();
	/*packed*/ class DirectoryEntry& front();
	const /*packed*/ class DirectoryEntry& back();
	/*packed*/ class DirectoryEntry& back();
	void swap(/*packed*/ class list<DirectoryEntry>&);
	void insert(/*packed*/ class list<DirectoryEntry>::iterator, uint32_t, const /*packed*/ class DirectoryEntry&);
	void insert(/*packed*/ class list<DirectoryEntry>::iterator, /*packed*/ class list<DirectoryEntry>::const_iterator, /*packed*/ class list<DirectoryEntry>::const_iterator);
	void insert(/*packed*/ class list<DirectoryEntry>::iterator, const /*packed*/ class DirectoryEntry*, const /*packed*/ class DirectoryEntry*);
	/*packed*/ class list<DirectoryEntry>::iterator insert(/*packed*/ class list<DirectoryEntry>::iterator, const /*packed*/ class DirectoryEntry&);
	void push_front(const /*packed*/ class DirectoryEntry&);
	void push_back(const /*packed*/ class DirectoryEntry&);
	void erase(/*packed*/ class list<DirectoryEntry>::iterator, /*packed*/ class list<DirectoryEntry>::iterator);
	void erase(/*packed*/ class list<DirectoryEntry>::iterator);
	void pop_front();
	void pop_back();
	void ~list<DirectoryEntry>();
	/*packed*/ class list<DirectoryEntry>& operator=(const /*packed*/ class list<DirectoryEntry>&);
protected:
	void transfer(/*packed*/ class list<DirectoryEntry>::iterator, /*packed*/ class list<DirectoryEntry>::iterator, /*packed*/ class list<DirectoryEntry>::iterator);
public:
	void splice(/*packed*/ class list<DirectoryEntry>::iterator, /*packed*/ class list<DirectoryEntry>&, /*packed*/ class list<DirectoryEntry>::iterator, /*packed*/ class list<DirectoryEntry>::iterator);
	void splice(/*packed*/ class list<DirectoryEntry>::iterator, /*packed*/ class list<DirectoryEntry>&, /*packed*/ class list<DirectoryEntry>::iterator);
	void splice(/*packed*/ class list<DirectoryEntry>::iterator, /*packed*/ class list<DirectoryEntry>&);
	void remove(const /*packed*/ class DirectoryEntry&);
	void unique();
	void merge(/*packed*/ class list<DirectoryEntry>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ class PFile;
// VTABLE: COPTER_D 0x00590468
class PFile{ // packed(0x110 bytes) TI: 0x453c
	enum /* __unnamed */ {
		FileNull = -1,
	};
	enum SeekTypes {
		N_SEEK_FROM_FILE_START = 0,
		N_SEEK_FROM_FILE_CURRENT = 1,
		N_SEEK_FROM_FILE_END = 2,
	};
	enum AccessTypes {
		ReadOnly = 0,
		ReadWrite = 2,
		WriteOnly = 1,
		Create = 768,
		CreateExcl = 1280,
		Append = 8,
		Binary = 32768,
		Compat = 0,
		DenyNone = 64,
		DenyRead = 48,
		DenyWrite = 32,
		DenyRdWr = 16,
		NoInherit = 128,
	};
	enum PermissionTypes {
		PermRead = 256,
		PermWrite = 128,
		PermRdWr = 384,
	};
	enum seek_dir {
		beg = 0,
		cur = 1,
		end = 2,
	};
public:
	void PFile(char *);
	void PFile(const /*packed*/ class PFile&);
	void PFile(int32_t);
	void PFile();
	virtual void ~PFile(); // vtable+0x0
	int32_t Open(char *, unsigned short, unsigned short, int32_t);
	int32_t Close();
	int32_t GetHandle();
	long Position();
	void Length(long);
	long Length();
	long Seek(long, int32_t);
	long SeekToBegin();
	long SeekToEnd();
	int32_t IsOpen();
	int32_t Read(void * __ptr32, int32_t);
	int32_t Write(void * __ptr32, int32_t);
	void Flush();
	// calltype: NearC
	static void Remove(char *);
	// calltype: NearC
	static void Rename(char *, char *);
	// calltype: NearC
	static unsigned long Checksum(char *);
	long SetPath(char *);
	long FileCreate(char *, int32_t);
	long FileExists(char *);
	/*+0x4*/   char szFilePath[260]; // 0x104 bytes
	/*+0x108*/ int32_t Handle;
private:
	/*+0x10c*/ int32_t ShouldClose;
};



// Contribution: 1:00026550-00027c67 Module: 68, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00427550
unsigned long  CGameApp::GetLoadFileType(char * szFilePath, long& lFileType) {
// LINE 63:
	__asm        mov    eax, szFilePath;
	__asm        push   eax;
	__asm        call   S2CityValidate;
	__asm        add    esp, 4;
	__asm        test   eax, eax;
	__asm        je     _T35;
// LINE 64:
	lFileType. = 0x1;
// LINE 65:
	__asm        xor    eax, eax;
	__asm        jmp    _T8c;
// LINE 67:
	__asm        jmp    _T82;
_T35:
	__asm        mov    eax, szFilePath;
	__asm        push   eax;
	__asm        call   ValidateSCXSaveGameFile;
	__asm        add    esp, 4;
	__asm        test   eax, eax;
	__asm        je     _T5e;
// LINE 68:
	lFileType. = 0x5;
// LINE 69:
	__asm        xor    eax, eax;
	__asm        jmp    _T8c;
// LINE 71:
	__asm        jmp    _T82;
// LINE 72:
_T5e:
	__asm        mov    eax, szFilePath;
