// Module: gamewin.obj
// Source: C:\Copter\source\sparkal\gamewin.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class GameWindow (forward reference);
// VTABLE: COPTER_D 0x00590470
class GameWindow : public CSparkalWindow
{ // packed(0x9c bytes) TI: 0x2460
public:
	void GameWindow(unsigned long, unsigned long, unsigned long, const /*packed*/ struct SparkalColor*, char *);
	virtual void ~GameWindow() /* override */;
	virtual int32_t Initialize(); // vtable+0x34
	virtual unsigned long CreateSparkalWindow(); // vtable+0x38
	virtual unsigned long SwapBuffer() /* override */;
	virtual unsigned long Draw() /* override */;
	virtual unsigned long MakePalette(const /*packed*/ struct SparkalColor*); // vtable+0x3c
	virtual void UpdatePalette(long, long, /*packed*/ struct SparkalColor*) /* override */;
	virtual void ProcessWindowMove(); // vtable+0x40
	virtual void CenterWindow(); // vtable+0x44
	virtual void PlaceWindowRect(/*packed*/ class MRect*); // vtable+0x48
	virtual int32_t PrepareForSwitchToWindowedMode(); // vtable+0x4c
	virtual int32_t CompleteSwitchToWindowedMode(); // vtable+0x50
	virtual int32_t PrepareForSwitchToFullScreenMode(); // vtable+0x54
	virtual int32_t CompleteSwitchToFullScreenMode(); // vtable+0x58
	// calltype: NearStd
	virtual long MySparkalWindowProc(void * __ptr32, uint32_t, uint32_t, long) /* override */;
protected:
	/*+0x68*/  /*packed*/ class MRect rectWindowDesired; // 0x10 bytes
	/*+0x78*/  /*packed*/ class MRect rectWindow; // 0x10 bytes
	/*+0x88*/  /*packed*/ class MRect rectWindowClient; // 0x10 bytes
	/*+0x98*/  char * szCaption;
};

// Type: unsigned long;

// Type: /*packed*/ struct SparkalColor (forward reference);
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: char *;

// Type: /*packed*/ struct tagWNDCLASSA;
struct tagWNDCLASSA{ // packed(0x28 bytes) TI: 0x26d3
	/*+0x0*/   uint32_t style;
	/*+0x4*/   long (*lpfnWndProc)(void * __ptr32, uint32_t, uint32_t, long);
	/*+0x8*/   int32_t cbClsExtra;
	/*+0xc*/   int32_t cbWndExtra;
	/*+0x10*/  void * __ptr32 hInstance;
	/*+0x14*/  void * __ptr32 hIcon;
	/*+0x18*/  void * __ptr32 hCursor;
	/*+0x1c*/  void * __ptr32 hbrBackground;
	/*+0x20*/  char * lpszMenuName;
	/*+0x24*/  char * lpszClassName;
};

// Type: void;

// Type: /*packed*/ struct tagRECT;
struct tagRECT{ // packed(0x10 bytes) TI: 0x13c4
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
};

// Type: int32_t;

// Type: /*packed*/ struct GameWindow::MakePalette::__unnamed;
struct GameWindow::MakePalette::__unnamed{ // packed(0x404 bytes) TI: 0x283b
	/*+0x0*/   unsigned short Version; // 0x2 bytes
	/*+0x2*/   unsigned short NumberOfEntries; // 0x2 bytes
	/*+0x4*/   /*packed*/ struct tagPALETTEENTRY aEntries[256]; // 0x400 bytes
};

// Type: void * __ptr32;

// Type: uint32_t;

// Type: long;

// Type: /*packed*/ class MRect (forward reference);
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: /*packed*/ struct tagMINMAXINFO (forward reference);
struct tagMINMAXINFO{ // packed(0x28 bytes) TI: 0x2841
	/*+0x0*/   /*packed*/ struct tagPOINT ptReserved; // 0x8 bytes
	/*+0x8*/   /*packed*/ struct tagPOINT ptMaxSize; // 0x8 bytes
	/*+0x10*/  /*packed*/ struct tagPOINT ptMaxPosition; // 0x8 bytes
	/*+0x18*/  /*packed*/ struct tagPOINT ptMinTrackSize; // 0x8 bytes
	/*+0x20*/  /*packed*/ struct tagPOINT ptMaxTrackSize; // 0x8 bytes
};

// Type: /*packed*/ class CSparkalWindow (forward reference);
// VTABLE: COPTER_D 0x00590ef8
class CSparkalWindow{ // packed(0x68 bytes) TI: 0x20d9
public:
	void CSparkalWindow(unsigned long, unsigned long, unsigned long, const /*packed*/ struct SparkalColor*, char *);
	void CSparkalWindow();
	virtual void ~CSparkalWindow(); // vtable+0x0
	void * __ptr32 GetPlatformData();
	long GetWidth();
	long GetHeight();
	virtual unsigned long GetClientSize(long *, long *); // vtable+0x4
	/*unpacked*/ class ScreenBuffer* GetBackBuffer();
	/*unpacked*/ class ScreenBuffer* SetBackBuffer(/*unpacked*/ class ScreenBuffer*);
	/*unpacked*/ class ICommander* GetCommander();
	/*unpacked*/ class ICommander* SetCommander(/*unpacked*/ class ICommander*);
	virtual unsigned long Draw(); // vtable+0x8
	virtual unsigned long SetCursor(unsigned long); // vtable+0xc
	virtual unsigned long SetCursorFromIndex(int32_t); // vtable+0x10
	virtual unsigned long LoadGameCursors(); // vtable+0x14
	virtual void FreeGameCursors(); // vtable+0x18
	unsigned long DrawBufferText(const const char*, unsigned long, long, long, long *, long *, long *, long *);
	virtual unsigned long Sleep(); // vtable+0x1c
	virtual unsigned long WakeUp(); // vtable+0x20
	unsigned long ScreenScroll(long, long, long, long, long, long);
	unsigned long RectSlideUp(long, long, long, long);
	virtual unsigned long SwapBuffer(long, long, long, long); // vtable+0x24
	virtual unsigned long SwapBuffer(); // vtable+0x28
	virtual void UpdatePalette(long, long, /*packed*/ struct SparkalColor*); // vtable+0x2c
protected:
	/*+0x4*/   long mHeight;
	/*+0x8*/   long mWidth;
	/*+0xc*/   unsigned long mStyle;
	/*+0x10*/  /*unpacked*/ class ICommander *mpCommander;
	/*+0x14*/  /*unpacked*/ class ScreenBuffer *mpBackBuffer;
	/*+0x18*/  void * __ptr32 mWindow;
	// calltype: NearStd
	virtual long MySparkalWindowProc(void * __ptr32, uint32_t, uint32_t, long); // vtable+0x30
	/*+0x1c*/  void * __ptr32 mPalette;
	/*+0x20*/  void * __ptr32 mhCurrentCursor;
	/*+0x24*/  void * __ptr32 mhCustomCursor;
	/*+0x28*/  void * __ptr32 mCursors[16]; // 0x40 bytes
};

// Type: /*packed*/ class CSparkalWindow;
// VTABLE: COPTER_D 0x00590ef8
class CSparkalWindow{ // packed(0x68 bytes) TI: 0x20d9
public:
	void CSparkalWindow(unsigned long, unsigned long, unsigned long, const /*packed*/ struct SparkalColor*, char *);
	void CSparkalWindow();
	virtual void ~CSparkalWindow(); // vtable+0x0
	void * __ptr32 GetPlatformData();
	long GetWidth();
	long GetHeight();
	virtual unsigned long GetClientSize(long *, long *); // vtable+0x4
	/*unpacked*/ class ScreenBuffer* GetBackBuffer();
	/*unpacked*/ class ScreenBuffer* SetBackBuffer(/*unpacked*/ class ScreenBuffer*);
	/*unpacked*/ class ICommander* GetCommander();
	/*unpacked*/ class ICommander* SetCommander(/*unpacked*/ class ICommander*);
	virtual unsigned long Draw(); // vtable+0x8
	virtual unsigned long SetCursor(unsigned long); // vtable+0xc
	virtual unsigned long SetCursorFromIndex(int32_t); // vtable+0x10
	virtual unsigned long LoadGameCursors(); // vtable+0x14
	virtual void FreeGameCursors(); // vtable+0x18
	unsigned long DrawBufferText(const const char*, unsigned long, long, long, long *, long *, long *, long *);
	virtual unsigned long Sleep(); // vtable+0x1c
	virtual unsigned long WakeUp(); // vtable+0x20
	unsigned long ScreenScroll(long, long, long, long, long, long);
	unsigned long RectSlideUp(long, long, long, long);
	virtual unsigned long SwapBuffer(long, long, long, long); // vtable+0x24
	virtual unsigned long SwapBuffer(); // vtable+0x28
	virtual void UpdatePalette(long, long, /*packed*/ struct SparkalColor*); // vtable+0x2c
protected:
	/*+0x4*/   long mHeight;
	/*+0x8*/   long mWidth;
	/*+0xc*/   unsigned long mStyle;
	/*+0x10*/  /*unpacked*/ class ICommander *mpCommander;
	/*+0x14*/  /*unpacked*/ class ScreenBuffer *mpBackBuffer;
	/*+0x18*/  void * __ptr32 mWindow;
	// calltype: NearStd
	virtual long MySparkalWindowProc(void * __ptr32, uint32_t, uint32_t, long); // vtable+0x30
	/*+0x1c*/  void * __ptr32 mPalette;
	/*+0x20*/  void * __ptr32 mhCurrentCursor;
	/*+0x24*/  void * __ptr32 mhCustomCursor;
	/*+0x28*/  void * __ptr32 mCursors[16]; // 0x40 bytes
};

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};



// Contribution: 1:00065f70-00067019 Module: 43, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00466f70
void GameWindow::GameWindow(unsigned long Width, unsigned long Height, unsigned long Style, const /*packed*/ struct SparkalColor *pColors, char * Caption) {
	/*bp-0x28*/  /*packed*/ struct tagWNDCLASSA ClassInfo; // 0x28 bytes


	this->CSparkalWindow::CSparkalWindow();
	__asm        jmp    _T19;
_T19:
	__asm        jmp    _T1e;
_T1e:
	__asm        jmp    _T23;
_T23:
	__asm        jmp    _T28;
_T28:
	__asm        jmp    _T2d;
_T2d:
	__asm        jmp    _T32;
_T32:
	this->szCaption = 0x0;
	this-><GameWindow+0x00> = 0x590470;
// LINE 40:
	this->mWidth = Width;
// LINE 41:
	this->mHeight = Height;
// LINE 42:
	this->mStyle = Style;
// LINE 44:
	__asm        cmp    Caption, 0;
	__asm        je     _Ta7;
// LINE 45:
	__asm        mov    eax, Caption;
	__asm        push   eax;
