// Module: gameapp2.obj
// Source: C:\Copter\source\sparkal\gameapp2.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct list<CopterGameMode>::list_node_buffer (forward reference);
struct list<CopterGameMode>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1a1a
	/*+0x0*/   void * __ptr32 next_buffer;
	/*+0x4*/   /*packed*/ struct list<CopterGameMode>::list_node *buffer;
};

// Type: /*packed*/ struct list<CopterGameMode>::list_node (forward reference);
struct list<CopterGameMode>::list_node{ // packed(0xc bytes) TI: 0x1a1c
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*packed*/ class CopterGameMode data;
};

// Type: char *;

// Type: void;

// Type: /*unpacked*/ class MTime (forward reference);
// MTime Class implementation not found

// Type: int32_t;

// Type: char;

// Type: /*packed*/ struct SoundPreferences;
struct SoundPreferences{ // packed(0x10 bytes) TI: 0x2845
	/*+0x0*/   long lMasterVolume;
	/*+0x4*/   long lDispatchVolume;
	/*+0x8*/   long lSoundEffectsVolume;
	/*+0xc*/   long lVehicleVolume;
};

// Type: /*packed*/ struct SoundPreferences (forward reference);
struct SoundPreferences{ // packed(0x10 bytes) TI: 0x2845
	/*+0x0*/   long lMasterVolume;
	/*+0x4*/   long lDispatchVolume;
	/*+0x8*/   long lSoundEffectsVolume;
	/*+0xc*/   long lVehicleVolume;
};

// Type: long;

// Type: /*packed*/ class list<CopterGameMode>::iterator;
class list<CopterGameMode>::iterator : public bidirectional_iterator<CopterGameMode,int>
{ // packed(0x4 bytes) TI: 0x1a18
protected:
	/*+0x0*/   /*packed*/ struct list<CopterGameMode>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<CopterGameMode>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<CopterGameMode>::iterator&);
	/*packed*/ class CopterGameMode& operator*();
	/*packed*/ class list<CopterGameMode>::iterator operator++(int32_t);
	/*packed*/ class list<CopterGameMode>::iterator& operator++();
	/*packed*/ class list<CopterGameMode>::iterator operator--(int32_t);
	/*packed*/ class list<CopterGameMode>::iterator& operator--();
};

// Type: /*packed*/ class DigitalSound (forward reference);
// VTABLE: COPTER_D 0x0058f488
class DigitalSound : public Sound
{ // packed(0x7a bytes) TI: 0x45d4
protected:
	/*+0x34*/  int32_t nStreamingType;
	/*+0x38*/  int32_t nCompletionEstimationTimerSet;
	static /*packed*/ struct IDirectSound *lpDirectSound;
	/*+0x3c*/  uint32_t cbSize;
	/*+0x40*/  /*packed*/ struct tWAVEFORMATEX waveFormatEx; // 0x12 bytes
	/*+0x52*/  /*packed*/ struct IDirectSoundBuffer *lpSound[8]; // 0x20 bytes
	/*+0x72*/  /*packed*/ struct _STREAMBUFINFO *lpStreamBufferInfo;
	/*+0x76*/  unsigned long dwDesiredBufferDescFlags;
public:
	void DigitalSound(long);
	void DigitalSound(const /*packed*/ class basic_string<char>&, int32_t);
	void DigitalSound();
	virtual void ~DigitalSound() /* override */;
	/*packed*/ class DigitalSound& operator=(/*packed*/ class DigitalSound&);
	virtual void SetSoundFile(const /*packed*/ class basic_string<char>&, int32_t); // vtable+0x2c
	virtual int32_t Load(); // vtable+0x30
	virtual int32_t LoadFromResource(); // vtable+0x34
	virtual int32_t LoadFromFile(); // vtable+0x38
	virtual void Unload(); // vtable+0x3c
	virtual long Play(long, int32_t) /* override */;
	virtual long Stop() /* override */;
	virtual long ShouldWeStream(); // vtable+0x40
	virtual long PlayStream(); // vtable+0x44
	virtual long StopStream(); // vtable+0x48
protected:
	virtual long IsPlaying(/*packed*/ struct IDirectSoundBuffer**); // vtable+0x4c
public:
	virtual long IsPlaying() /* override */;
	virtual int32_t GetVolume(long *) /* override */;
	virtual int32_t SetVolume(long) /* override */;
	virtual int32_t GetPan(long *); // vtable+0x50
	virtual int32_t SetPan(long); // vtable+0x54
	virtual int32_t SetPosition(long, long, long); // vtable+0x58
	virtual long GetOriginalFrequency(); // vtable+0x5c
	virtual int32_t GetFrequency(long *); // vtable+0x60
	virtual int32_t SetFrequency(long); // vtable+0x64
	virtual int32_t GetSoundType() /* override */;
	virtual int32_t SetCompletionNotification(void (*)(long), long) /* override */;
	virtual void StopCompletionNotification() /* override */;
	virtual long EstimateRemainingPlayTime() /* override */;
protected:
	virtual int32_t GetSoundAliasToPlay(/*packed*/ struct IDirectSoundBuffer**); // vtable+0x68
	virtual int32_t CreateSoundBuffer(/*packed*/ struct _DSBUFFERDESC*); // vtable+0x6c
	virtual int32_t CreatePrimarySoundBuffer(); // vtable+0x70
	virtual int32_t ReleaseSoundBuffer(); // vtable+0x74
	virtual long InitializeStreamBuffer(long); // vtable+0x78
	virtual void ProcessStreamingBufferTimerCallback(); // vtable+0x7c
	virtual void ProcessCompletionEstimationTimerCallback(); // vtable+0x80
	virtual void StopCompletionNotificationEstimationTimer(); // vtable+0x84
	virtual int32_t StartCompletionNotificationEstimationTimer(); // vtable+0x88
};

// Type: /*unpacked*/ class GraphicWindow (forward reference);
// GraphicWindow Class implementation not found

// Type: void * __ptr32;

// Type: unsigned long;

// Type: /*packed*/ class basic_string<char>;
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: float;

// Type: uint32_t;

// Type: /*packed*/ class list<CopterGameMode> (forward reference);
class list<CopterGameMode>{ // packed(0x8 bytes) TI: 0x19f6
	using void_pointer = void * __ptr32;
	struct list<CopterGameMode>::list_node{ // packed(0xc bytes) TI: 0x1a1c
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*packed*/ class CopterGameMode data;
	};
protected:
	static /*packed*/ class allocator<list<CopterGameMode>::list_node> list_node_allocator;
	static /*packed*/ class allocator<CopterGameMode> value_allocator;
	using value_type = /*packed*/ class CopterGameMode;
	using value_allocator_type = /*packed*/ class allocator<CopterGameMode>;
	using pointer = /*packed*/ class CopterGameMode*;
	using reference = /*packed*/ class CopterGameMode&;
	using const_reference = const /*packed*/ class CopterGameMode&;
	using list_node_allocator_type = /*packed*/ class allocator<list<CopterGameMode>::list_node>;
	using link_type = /*packed*/ struct list<CopterGameMode>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<CopterGameMode>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1a1a
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<CopterGameMode>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<CopterGameMode>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<CopterGameMode>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<CopterGameMode>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<CopterGameMode>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<CopterGameMode>::list_node *free_list;
	static /*packed*/ struct list<CopterGameMode>::list_node *next_avail;
	static /*packed*/ struct list<CopterGameMode>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<CopterGameMode>::list_node* get_node();
	void put_node(/*packed*/ struct list<CopterGameMode>::list_node*);
	/*+0x0*/   /*packed*/ struct list<CopterGameMode>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<CopterGameMode>::iterator : public bidirectional_iterator<CopterGameMode,int>
	{ // packed(0x4 bytes) TI: 0x1a18
	protected:
		/*+0x0*/   /*packed*/ struct list<CopterGameMode>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<CopterGameMode>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<CopterGameMode>::iterator&);
		/*packed*/ class CopterGameMode& operator*();
		/*packed*/ class list<CopterGameMode>::iterator operator++(int32_t);
		/*packed*/ class list<CopterGameMode>::iterator& operator++();
		/*packed*/ class list<CopterGameMode>::iterator operator--(int32_t);
		/*packed*/ class list<CopterGameMode>::iterator& operator--();
	};
	class list<CopterGameMode>::const_iterator : public bidirectional_iterator<CopterGameMode,int>
	{ // packed(0x4 bytes) TI: 0x1a0b
	protected:
		/*+0x0*/   /*packed*/ struct list<CopterGameMode>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<CopterGameMode>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<CopterGameMode>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<CopterGameMode>::const_iterator&);
		const /*packed*/ class CopterGameMode& operator*();
		/*packed*/ class list<CopterGameMode>::const_iterator operator++(int32_t);
		/*packed*/ class list<CopterGameMode>::const_iterator& operator++();
		/*packed*/ class list<CopterGameMode>::const_iterator operator--(int32_t);
		/*packed*/ class list<CopterGameMode>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::const_iterator,CopterGameMode,CopterGameMode const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::iterator,CopterGameMode,CopterGameMode &,int>;
public:
	void list<CopterGameMode>(const /*packed*/ class list<CopterGameMode>&);
	void list<CopterGameMode>(const /*packed*/ class CopterGameMode*, const /*packed*/ class CopterGameMode*);
	void list<CopterGameMode>(uint32_t, const /*packed*/ class CopterGameMode&);
	void list<CopterGameMode>();
	/*packed*/ class list<CopterGameMode>::const_iterator begin();
	/*packed*/ class list<CopterGameMode>::iterator begin();
	/*packed*/ class list<CopterGameMode>::const_iterator end();
	/*packed*/ class list<CopterGameMode>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::const_iterator,CopterGameMode,CopterGameMode const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::iterator,CopterGameMode,CopterGameMode &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::const_iterator,CopterGameMode,CopterGameMode const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::iterator,CopterGameMode,CopterGameMode &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*packed*/ class CopterGameMode& front();
	/*packed*/ class CopterGameMode& front();
	const /*packed*/ class CopterGameMode& back();
	/*packed*/ class CopterGameMode& back();
	void swap(/*packed*/ class list<CopterGameMode>&);
	void insert(/*packed*/ class list<CopterGameMode>::iterator, uint32_t, const /*packed*/ class CopterGameMode&);
	void insert(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::const_iterator, /*packed*/ class list<CopterGameMode>::const_iterator);
	void insert(/*packed*/ class list<CopterGameMode>::iterator, const /*packed*/ class CopterGameMode*, const /*packed*/ class CopterGameMode*);
	/*packed*/ class list<CopterGameMode>::iterator insert(/*packed*/ class list<CopterGameMode>::iterator, const /*packed*/ class CopterGameMode&);
	void push_front(const /*packed*/ class CopterGameMode&);
	void push_back(const /*packed*/ class CopterGameMode&);
	void erase(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::iterator);
	void erase(/*packed*/ class list<CopterGameMode>::iterator);
	void pop_front();
	void pop_back();
	void ~list<CopterGameMode>();
	/*packed*/ class list<CopterGameMode>& operator=(const /*packed*/ class list<CopterGameMode>&);
protected:
	void transfer(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::iterator);
public:
	void splice(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>&, /*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::iterator);
	void splice(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>&, /*packed*/ class list<CopterGameMode>::iterator);
	void splice(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>&);
	void remove(const /*packed*/ class CopterGameMode&);
	void unique();
	void merge(/*packed*/ class list<CopterGameMode>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ class CopterGameMode (forward reference);
class CopterGameMode{ // packed(0x4 bytes) TI: 0x170f
public:
	/*+0x0*/   int32_t nModeID;
	void CopterGameMode(const /*packed*/ class CopterGameMode&);
	void CopterGameMode(int32_t);
	void CopterGameMode();
	/*packed*/ class CopterGameMode& operator=(const /*packed*/ class CopterGameMode&);
};

// Type: /*packed*/ class Sound;
// VTABLE: COPTER_D 0x0058f458
class Sound{ // packed(0x34 bytes) TI: 0x4335
	enum SoundSourceType {
		nSoundSourceTypeResource = 0,
		nSoundSourceTypeFile = 1,
	};
public:
	/*+0x4*/   enum Sound::SoundSourceType nSoundSourceType;
	enum SoundDuplicateType {
		nSoundDuplicateDefault = 0,
		nSoundDuplicateInterrupt = 1,
		nSoundDuplicateContinue = 2,
		nSoundDuplicateOverlap = 3,
	};
public:
	/*+0x8*/   enum Sound::SoundDuplicateType nSoundDuplicateType;
	/*+0xc*/   long lID;
	/*+0x10*/  long lResID;
	/*+0x14*/  /*packed*/ class basic_string<char> sSoundFile; // 0x8 bytes
	/*+0x1c*/  long bLooping;
	/*+0x20*/  long bStreaming;
	/*+0x24*/  long lVolume;
	/*+0x28*/  void (*soundCompletionFunction)(long);
	/*+0x2c*/  long lSoundCompletionData;
	/*+0x30*/  int32_t bUnloadBeforeNextPlay;
	void Sound();
	virtual void ~Sound(); // vtable+0x0
	/*packed*/ class Sound& operator=(const /*packed*/ class Sound&);
	virtual void SetSoundFile(const /*packed*/ class basic_string<char>&); // vtable+0x4
	virtual long Play(long, int32_t); // vtable+0x8
	virtual long Stop(); // vtable+0xc
	virtual long IsPlaying(); // vtable+0x10
	virtual int32_t SetCompletionNotification(void (*)(long), long); // vtable+0x14
	virtual void StopCompletionNotification(); // vtable+0x18
	virtual long EstimateRemainingPlayTime(); // vtable+0x1c
	virtual int32_t GetVolume(long *); // vtable+0x20
	virtual int32_t SetVolume(long); // vtable+0x24
	virtual int32_t GetSoundType(); // vtable+0x28
	// calltype: NearC
	static unsigned long GetTotalMemoryUsage();
	static unsigned long lTotalMemoryUsage;
};

// Type: /*packed*/ struct bidirectional_iterator<CopterGameMode,int>;
struct bidirectional_iterator<CopterGameMode,int>{ // packed(0x1 bytes) TI: 0x184c
};



