// Module: gameapp1.obj
// Source: C:\Copter\source\sparkal\gameapp1.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*unpacked*/ class Radio (forward reference);
// Radio Class implementation not found

// Type: /*packed*/ class CopterSparkalPalette;
// VTABLE: COPTER_D 0x00591118
class CopterSparkalPalette : public SparkalPalette
{ // packed(0x10 bytes) TI: 0x47bb
public:
	void CopterSparkalPalette(/*packed*/ struct SparkalColor*, int32_t);
	void CopterSparkalPalette();
	int32_t GetNextDarkerColorIndex(int32_t);
	int32_t GetNextLighterColorIndex(int32_t);
};

// Type: /*packed*/ class CopterSparkalPalette;
// VTABLE: COPTER_D 0x00591118
class CopterSparkalPalette : public SparkalPalette
{ // packed(0x10 bytes) TI: 0x47ce
public:
	void CopterSparkalPalette(/*packed*/ struct SparkalColor*, int32_t);
	void CopterSparkalPalette();
	int32_t GetNextDarkerColorIndex(int32_t);
	int32_t GetNextLighterColorIndex(int32_t);
	virtual void ~CopterSparkalPalette() /* override */; // synthetic
};

// Type: uint32_t;

// Type: /*unpacked*/ class CGameApp (forward reference);
// CGameApp Class implementation not found

// Type: /*packed*/ class CGameCommander (forward reference);
// VTABLE: COPTER_D 0x00590ff8
class CGameCommander : public CDefaultCommander
{ // packed(0xc bytes) TI: 0x1d27
public:
	void CGameCommander();
	virtual void ~CGameCommander() /* override */;
	virtual unsigned long Idle() /* override */;
	virtual void ProcessSetFocus(); // vtable+0x24
	virtual void ProcessKeyDown(long, /*packed*/ struct CommandSystem&, int32_t&, int32_t&); // vtable+0x28
	virtual void ProcessKeyDown(long); // vtable+0x2c
	virtual void ProcessKeyUp(long, /*packed*/ struct CommandSystem&); // vtable+0x30
	virtual void ProcessKeyUp(long); // vtable+0x34
	virtual unsigned long OnCharacter(long); // vtable+0x38
	virtual unsigned long OnLMouseDown(int32_t, int32_t); // vtable+0x3c
	virtual unsigned long OnLMouseUp(int32_t, int32_t); // vtable+0x40
	virtual unsigned long OnRMouseDown(int32_t, int32_t); // vtable+0x44
	virtual unsigned long OnRMouseUp(int32_t, int32_t); // vtable+0x48
	virtual unsigned long OnMouseMove(int32_t, int32_t) /* override */;
	virtual unsigned long OnWindowActivate() /* override */;
	virtual unsigned long OnWindowDeactivate() /* override */;
	virtual void ProcessSystemCloseRequest(); // vtable+0x4c
	virtual void SetNewGameApp(/*unpacked*/ class CGameApp*); // vtable+0x50
	/*+0x8*/   /*unpacked*/ class CGameApp *myGameApp;
};

// Type: /*packed*/ class NotificationPreferenceManager (forward reference);
// VTABLE: COPTER_D 0x00590de8
class NotificationPreferenceManager : public PreferenceManager
{ // packed(0x30 bytes) TI: 0x2539
public:
	/*+0x28*/  /*packed*/ class list<NotificationItem> myNotifications; // 0x8 bytes
	void NotificationPreferenceManager(long, long, long, int32_t);
	virtual long SetPref(/*packed*/ class PreferenceItem*) /* override */;
	virtual long SetPref(long, char *, long) /* override */;
	virtual int32_t AddNotification(/*packed*/ class NotificationItem&); // vtable+0x34
	virtual int32_t AddNotification(long, /*packed*/ class NotificationSink*); // vtable+0x38
	virtual int32_t RemoveNotification(/*packed*/ class NotificationSink*, long); // vtable+0x3c
	virtual void DoNotification(long); // vtable+0x40
};

// Type: void ();

// Type: /*packed*/ class SoundSystem;
// VTABLE: COPTER_D 0x0058f440
class SoundSystem{ // packed(0x74 bytes) TI: 0x1a78
public:
	void SoundSystem();
	void ~SoundSystem();
	int32_t Initialize(void * __ptr32);
	void DeInitialize();
	virtual int32_t GetVolume(long *); // vtable+0x0
	virtual int32_t SetVolume(long); // vtable+0x4
	void EnableSound();
	void DisableSound();
	long IsSoundEnabled();
	/*+0x4*/   long bSoundEnabled;
	static unsigned long dwMaxWaveFormatExSize;
protected:
	/*+0x8*/   /*packed*/ class DigitalSound *primarySound;
	/*+0xc*/   /*packed*/ struct IDirectSoundBuffer *lpPrimarySound;
	/*+0x10*/  /*packed*/ struct IDirectSound *lpDirectSound;
	/*+0x14*/  /*packed*/ struct _DSCAPS dsCapabilities; // 0x60 bytes
};

// Type: /*packed*/ class SoundManager;
// VTABLE: COPTER_D 0x0058f448
class SoundManager{ // packed(0x204 bytes) TI: 0x1997
public:
	/*+0x4*/   /*packed*/ class Sound *sound[128]; // 0x200 bytes
	void AddSound(/*packed*/ class Sound*, int32_t);
	void AddDigitalSound(const /*packed*/ class basic_string<char>&, int32_t, int32_t);
	void AddDigitalSound(long, int32_t);
	virtual long PlaySoundA(int32_t, long, int32_t); // vtable+0x0
	virtual void StopSound(int32_t); // vtable+0x4
	virtual void StopAllSounds(); // vtable+0x8
	/*packed*/ class Sound* GetSound(int32_t);
	void SoundManager();
	void ~SoundManager();
	virtual void DeleteAllSounds(); // vtable+0xc
};

// Type: /*unpacked*/ class SoundManager;
// VTABLE: COPTER_D 0x0058f448
class SoundManager{ // not packed(0x204 bytes) TI: 0x4673
public:
	/*+0x4*/   /*unpacked*/ class Sound *sound[128]; // 0x200 bytes
	void AddSound(/*unpacked*/ class Sound*, int32_t);
	void AddDigitalSound(const /*unpacked*/ class basic_string<char>&, int32_t, int32_t);
	void AddDigitalSound(long, int32_t);
	virtual long PlaySoundA(int32_t, long, int32_t); // vtable+0x0
	virtual void StopSound(int32_t); // vtable+0x4
	virtual void StopAllSounds(); // vtable+0x8
	/*unpacked*/ class Sound* GetSound(int32_t);
	void SoundManager();
	void ~SoundManager();
	virtual void DeleteAllSounds(); // vtable+0xc
};

// Type: /*packed*/ class SoundQueue (forward reference);
// VTABLE: COPTER_D 0x0058f3f0
class SoundQueue{ // packed(0x18 bytes) TI: 0x24ef
public:
	void SoundQueue();
	void ~SoundQueue();
	virtual int32_t Initialize(); // vtable+0x0
	virtual void DeInitialize(int32_t); // vtable+0x4
	virtual void ClearQueue(int32_t); // vtable+0x8
	/*packed*/ class SoundQueue& operator+=(/*packed*/ struct SoundQueueItem*);
	/*packed*/ class SoundQueue& operator+=(/*packed*/ class Sound*);
	virtual int32_t StartPauseCallback(long); // vtable+0xc
	virtual void EndPauseCallback(); // vtable+0x10
	virtual void PlayNextSoundInQueue(); // vtable+0x14
	virtual void RemoveNextSoundInQueue(); // vtable+0x18
	virtual void SoundQueueCompletionCallback(); // vtable+0x1c
	// calltype: NearC
	static void StaticSoundQueueCompletionCallback(long);
	virtual void SoundQueueWaitTimeCallback(); // vtable+0x20
	// calltype: NearC
	static void StaticSoundQueueWaitTimeCallback(long);
	virtual int32_t GetMutex(unsigned long); // vtable+0x24
	virtual void ReleaseMutex(); // vtable+0x28
protected:
	/*+0x4*/   /*packed*/ class list<SoundQueueItem *> mySoundQueueItemList; // 0x8 bytes
	/*+0xc*/   int32_t bOK;
	/*+0x10*/  long bMutex;
	/*+0x14*/  int32_t nWaitTimerSet;
	// calltype: NearStd
	static void WindowsStaticSoundQueueCompletionCallback(uint32_t, uint32_t, unsigned long, unsigned long, unsigned long);
	// calltype: NearStd
	static void WindowsStaticSoundQueueWaitTimeCallback(uint32_t, uint32_t, unsigned long, unsigned long, unsigned long);
};

// Type: /*packed*/ class MessageDisplayManager;
// VTABLE: COPTER_D 0x005907d0
class MessageDisplayManager{ // packed(0x54 bytes) TI: 0x10c3
public:
	void MessageDisplayManager();
	void ~MessageDisplayManager();
	virtual int32_t Initialize(); // vtable+0x0
	virtual void DisplayCurrentMessages(/*packed*/ class CBackBuffer*); // vtable+0x4
	virtual void AddNewMessage(/*packed*/ class basic_string<char>&); // vtable+0x8
	virtual void AddNewMessage(char *); // vtable+0xc
	/*+0x4*/   /*packed*/ class MPoint ptFirstMessage; // 0x8 bytes
	/*+0xc*/   long lMaximumMessageCount;
protected:
	/*+0x10*/  /*packed*/ class basic_string<char> *sMessages;
	/*+0x14*/  /*packed*/ class MTimer timerMessageDisplay; // 0x10 bytes
	/*+0x24*/  /*packed*/ class MFont fontMessages; // 0x1c bytes
	/*+0x40*/  long lVerticalSpaceBetweenMessages;
	/*+0x44*/  unsigned long lDisplayTime;
	/*+0x48*/  long lCurrentDisplayedMessageCount;
	/*+0x4c*/  int32_t bDisplayMessages;
	/*+0x50*/  /*packed*/ struct SparkalColor colorMessage;
};

// Type: char *;

// Type: void;

// Type: /*packed*/ struct GamePreferences (forward reference);
struct GamePreferences{ // packed(0x20 bytes) TI: 0x2652
	/*+0x0*/   long lQuadPixelType;
	/*+0x4*/   long bShowingPalette;
	/*+0x8*/   long bShowingDebugWindow;
	/*+0xc*/   long bPlayingSoundTrack;
	/*+0x10*/  long lStartupMode;
	/*+0x14*/  long lProcessPriority;
	/*+0x18*/  long lThreadPriority;
	/*+0x1c*/  long lLanguage;
	void GamePreferences();
};

// Type: /*packed*/ struct RenderPreferences (forward reference);
struct RenderPreferences{ // packed(0x10 bytes) TI: 0x24b3
	/*+0x0*/   long bShowObjectTexture;
	/*+0x4*/   long bShowGroundTexture;
	/*+0x8*/   long bShowSky;
	/*+0xc*/   long bShowPanelsWhenInHelicopter;
	void RenderPreferences();
};

// Type: long;

// Type: /*packed*/ class basic_string<char>;
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: char;

// Type: int32_t;

// Type: unsigned long;

// Type: /*packed*/ struct SparkalColor (forward reference);
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: short;

// Type: /*packed*/ class Version;
// VTABLE: COPTER_D 0x0058f5b8
class Version{ // packed(0xc bytes) TI: 0x241c
public:
	void Version();
	virtual void ~Version(); // vtable+0x0
	int32_t GetApplicationName(char *&);
	long GetApplicationVersion(int32_t);
	int32_t GetApplicationVersion(char *&);
	int32_t GetApplicationCopyright(char *&);
	int32_t GetApplicationDebugVersion(char *&);
	// calltype: NearC
	static int32_t GetSystemType();
	// calltype: NearC
	static long GetSystemVersion(int32_t);
	// calltype: NearC
	static int32_t GetSystemVersion(char *);
	// calltype: NearC
	static long GetCPUVersion();
	// calltype: NearC
	static long GetCPUSpeed();
protected:
	/*+0x4*/   unsigned char * lpTransBlock;
	/*+0x8*/   void * __ptr32 lpFVData;
};

// Type: /*packed*/ struct _MEMORYSTATUS;
struct _MEMORYSTATUS{ // packed(0x20 bytes) TI: 0x241e
	/*+0x0*/   unsigned long dwLength;
	/*+0x4*/   unsigned long dwMemoryLoad;
	/*+0x8*/   unsigned long dwTotalPhys;
	/*+0xc*/   unsigned long dwAvailPhys;
	/*+0x10*/  unsigned long dwTotalPageFile;
	/*+0x14*/  unsigned long dwAvailPageFile;
	/*+0x18*/  unsigned long dwTotalVirtual;
	/*+0x1c*/  unsigned long dwAvailVirtual;
};

// Type: void * __ptr32;

// Type: /*packed*/ struct Shortcut;
struct Shortcut{ // packed(0x18 bytes) TI: 0x1083
	/*+0x0*/   long lDeviceID;
	/*+0x4*/   long lCommand;
	/*+0x8*/   long lKey;
	/*+0xc*/   long lModifiers;
	/*+0x10*/  long lPush;
	/*+0x14*/  long lIgnoreModifiers;
};

// Type: /*packed*/ class list<Shortcut>::iterator (forward reference);
class list<Shortcut>::iterator : public bidirectional_iterator<Shortcut,int>
{ // packed(0x4 bytes) TI: 0x1081
protected:
	/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<Shortcut>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<Shortcut>::iterator&);
	/*packed*/ struct Shortcut& operator*();
	/*packed*/ class list<Shortcut>::iterator operator++(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator++();
	/*packed*/ class list<Shortcut>::iterator operator--(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator--();
};

// Type: /*packed*/ class list<Shortcut> (forward reference);
class list<Shortcut>{ // packed(0x8 bytes) TI: 0x1b79
	using void_pointer = void * __ptr32;
	struct list<Shortcut>::list_node{ // packed(0x20 bytes) TI: 0x1b8e
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*packed*/ struct Shortcut data; // 0x18 bytes
	};
protected:
	static /*packed*/ class allocator<list<Shortcut>::list_node> list_node_allocator;
	static /*packed*/ class allocator<Shortcut> value_allocator;
	using value_type = /*packed*/ struct Shortcut;
	using value_allocator_type = /*packed*/ class allocator<Shortcut>;
	using pointer = /*packed*/ struct Shortcut*;
	using reference = /*packed*/ struct Shortcut&;
	using const_reference = const /*packed*/ struct Shortcut&;
	using list_node_allocator_type = /*packed*/ class allocator<list<Shortcut>::list_node>;
	using link_type = /*packed*/ struct list<Shortcut>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<Shortcut>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1b8c
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<Shortcut>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<Shortcut>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<Shortcut>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<Shortcut>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<Shortcut>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<Shortcut>::list_node *free_list;
	static /*packed*/ struct list<Shortcut>::list_node *next_avail;
	static /*packed*/ struct list<Shortcut>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<Shortcut>::list_node* get_node();
	void put_node(/*packed*/ struct list<Shortcut>::list_node*);
	/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<Shortcut>::iterator : public bidirectional_iterator<Shortcut,int>
	{ // packed(0x4 bytes) TI: 0x1081
	protected:
		/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<Shortcut>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<Shortcut>::iterator&);
		/*packed*/ struct Shortcut& operator*();
		/*packed*/ class list<Shortcut>::iterator operator++(int32_t);
		/*packed*/ class list<Shortcut>::iterator& operator++();
		/*packed*/ class list<Shortcut>::iterator operator--(int32_t);
		/*packed*/ class list<Shortcut>::iterator& operator--();
	};
	class list<Shortcut>::const_iterator : public bidirectional_iterator<Shortcut,int>
	{ // packed(0x4 bytes) TI: 0x1b8a
	protected:
		/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<Shortcut>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<Shortcut>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<Shortcut>::const_iterator&);
		const /*packed*/ struct Shortcut& operator*();
		/*packed*/ class list<Shortcut>::const_iterator operator++(int32_t);
		/*packed*/ class list<Shortcut>::const_iterator& operator++();
		/*packed*/ class list<Shortcut>::const_iterator operator--(int32_t);
		/*packed*/ class list<Shortcut>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::const_iterator,Shortcut,Shortcut const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::iterator,Shortcut,Shortcut &,int>;
public:
	void list<Shortcut>(const /*packed*/ class list<Shortcut>&);
	void list<Shortcut>(const /*packed*/ struct Shortcut*, const /*packed*/ struct Shortcut*);
	void list<Shortcut>(uint32_t, const /*packed*/ struct Shortcut&);
	void list<Shortcut>();
	/*packed*/ class list<Shortcut>::const_iterator begin();
	/*packed*/ class list<Shortcut>::iterator begin();
	/*packed*/ class list<Shortcut>::const_iterator end();
	/*packed*/ class list<Shortcut>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::const_iterator,Shortcut,Shortcut const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::iterator,Shortcut,Shortcut &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::const_iterator,Shortcut,Shortcut const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::iterator,Shortcut,Shortcut &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*packed*/ struct Shortcut& front();
	/*packed*/ struct Shortcut& front();
	const /*packed*/ struct Shortcut& back();
	/*packed*/ struct Shortcut& back();
	void swap(/*packed*/ class list<Shortcut>&);
	void insert(/*packed*/ class list<Shortcut>::iterator, uint32_t, const /*packed*/ struct Shortcut&);
	void insert(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::const_iterator, /*packed*/ class list<Shortcut>::const_iterator);
	void insert(/*packed*/ class list<Shortcut>::iterator, const /*packed*/ struct Shortcut*, const /*packed*/ struct Shortcut*);
	/*packed*/ class list<Shortcut>::iterator insert(/*packed*/ class list<Shortcut>::iterator, const /*packed*/ struct Shortcut&);
	void push_front(const /*packed*/ struct Shortcut&);
	void push_back(const /*packed*/ struct Shortcut&);
	void erase(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::iterator);
	void erase(/*packed*/ class list<Shortcut>::iterator);
	void pop_front();
	void pop_back();
	void ~list<Shortcut>();
	/*packed*/ class list<Shortcut>& operator=(const /*packed*/ class list<Shortcut>&);
protected:
	void transfer(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::iterator);
public:
	void splice(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>&, /*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::iterator);
	void splice(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>&, /*packed*/ class list<Shortcut>::iterator);
	void splice(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>&);
	void remove(const /*packed*/ struct Shortcut&);
	void unique();
	void merge(/*packed*/ class list<Shortcut>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ struct list<Shortcut>::list_node (forward reference);
struct list<Shortcut>::list_node{ // packed(0x20 bytes) TI: 0x1b8e
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*packed*/ struct Shortcut data; // 0x18 bytes
};

// Type: /*packed*/ class list<Shortcut>::iterator;
class list<Shortcut>::iterator : public bidirectional_iterator<Shortcut,int>
{ // packed(0x4 bytes) TI: 0x1081
protected:
	/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<Shortcut>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<Shortcut>::iterator&);
	/*packed*/ struct Shortcut& operator*();
	/*packed*/ class list<Shortcut>::iterator operator++(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator++();
	/*packed*/ class list<Shortcut>::iterator operator--(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator--();
};

// Type: /*packed*/ struct list<CopterGameMode>::list_node_buffer (forward reference);
struct list<CopterGameMode>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1a1a
	/*+0x0*/   void * __ptr32 next_buffer;
	/*+0x4*/   /*packed*/ struct list<CopterGameMode>::list_node *buffer;
};

// Type: /*packed*/ class list<CopterGameMode> (forward reference);
class list<CopterGameMode>{ // packed(0x8 bytes) TI: 0x19f6
	using void_pointer = void * __ptr32;
	struct list<CopterGameMode>::list_node{ // packed(0xc bytes) TI: 0x1a1c
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*packed*/ class CopterGameMode data;
	};
protected:
	static /*packed*/ class allocator<list<CopterGameMode>::list_node> list_node_allocator;
	static /*packed*/ class allocator<CopterGameMode> value_allocator;
	using value_type = /*packed*/ class CopterGameMode;
	using value_allocator_type = /*packed*/ class allocator<CopterGameMode>;
	using pointer = /*packed*/ class CopterGameMode*;
	using reference = /*packed*/ class CopterGameMode&;
	using const_reference = const /*packed*/ class CopterGameMode&;
	using list_node_allocator_type = /*packed*/ class allocator<list<CopterGameMode>::list_node>;
	using link_type = /*packed*/ struct list<CopterGameMode>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<CopterGameMode>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1a1a
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<CopterGameMode>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<CopterGameMode>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<CopterGameMode>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<CopterGameMode>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<CopterGameMode>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<CopterGameMode>::list_node *free_list;
	static /*packed*/ struct list<CopterGameMode>::list_node *next_avail;
	static /*packed*/ struct list<CopterGameMode>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<CopterGameMode>::list_node* get_node();
	void put_node(/*packed*/ struct list<CopterGameMode>::list_node*);
	/*+0x0*/   /*packed*/ struct list<CopterGameMode>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<CopterGameMode>::iterator : public bidirectional_iterator<CopterGameMode,int>
	{ // packed(0x4 bytes) TI: 0x1a18
	protected:
		/*+0x0*/   /*packed*/ struct list<CopterGameMode>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<CopterGameMode>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<CopterGameMode>::iterator&);
		/*packed*/ class CopterGameMode& operator*();
		/*packed*/ class list<CopterGameMode>::iterator operator++(int32_t);
		/*packed*/ class list<CopterGameMode>::iterator& operator++();
		/*packed*/ class list<CopterGameMode>::iterator operator--(int32_t);
		/*packed*/ class list<CopterGameMode>::iterator& operator--();
	};
	class list<CopterGameMode>::const_iterator : public bidirectional_iterator<CopterGameMode,int>
	{ // packed(0x4 bytes) TI: 0x1a0b
	protected:
		/*+0x0*/   /*packed*/ struct list<CopterGameMode>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<CopterGameMode>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<CopterGameMode>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<CopterGameMode>::const_iterator&);
		const /*packed*/ class CopterGameMode& operator*();
		/*packed*/ class list<CopterGameMode>::const_iterator operator++(int32_t);
		/*packed*/ class list<CopterGameMode>::const_iterator& operator++();
		/*packed*/ class list<CopterGameMode>::const_iterator operator--(int32_t);
		/*packed*/ class list<CopterGameMode>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::const_iterator,CopterGameMode,CopterGameMode const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::iterator,CopterGameMode,CopterGameMode &,int>;
public:
	void list<CopterGameMode>(const /*packed*/ class list<CopterGameMode>&);
	void list<CopterGameMode>(const /*packed*/ class CopterGameMode*, const /*packed*/ class CopterGameMode*);
	void list<CopterGameMode>(uint32_t, const /*packed*/ class CopterGameMode&);
	void list<CopterGameMode>();
	/*packed*/ class list<CopterGameMode>::const_iterator begin();
	/*packed*/ class list<CopterGameMode>::iterator begin();
	/*packed*/ class list<CopterGameMode>::const_iterator end();
	/*packed*/ class list<CopterGameMode>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::const_iterator,CopterGameMode,CopterGameMode const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::iterator,CopterGameMode,CopterGameMode &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::const_iterator,CopterGameMode,CopterGameMode const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<CopterGameMode>::iterator,CopterGameMode,CopterGameMode &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*packed*/ class CopterGameMode& front();
	/*packed*/ class CopterGameMode& front();
	const /*packed*/ class CopterGameMode& back();
	/*packed*/ class CopterGameMode& back();
	void swap(/*packed*/ class list<CopterGameMode>&);
	void insert(/*packed*/ class list<CopterGameMode>::iterator, uint32_t, const /*packed*/ class CopterGameMode&);
	void insert(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::const_iterator, /*packed*/ class list<CopterGameMode>::const_iterator);
	void insert(/*packed*/ class list<CopterGameMode>::iterator, const /*packed*/ class CopterGameMode*, const /*packed*/ class CopterGameMode*);
	/*packed*/ class list<CopterGameMode>::iterator insert(/*packed*/ class list<CopterGameMode>::iterator, const /*packed*/ class CopterGameMode&);
	void push_front(const /*packed*/ class CopterGameMode&);
	void push_back(const /*packed*/ class CopterGameMode&);
	void erase(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::iterator);
	void erase(/*packed*/ class list<CopterGameMode>::iterator);
	void pop_front();
	void pop_back();
	void ~list<CopterGameMode>();
	/*packed*/ class list<CopterGameMode>& operator=(const /*packed*/ class list<CopterGameMode>&);
protected:
	void transfer(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::iterator);
public:
	void splice(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>&, /*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>::iterator);
	void splice(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>&, /*packed*/ class list<CopterGameMode>::iterator);
	void splice(/*packed*/ class list<CopterGameMode>::iterator, /*packed*/ class list<CopterGameMode>&);
	void remove(const /*packed*/ class CopterGameMode&);
	void unique();
	void merge(/*packed*/ class list<CopterGameMode>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ class list<CopterGameMode>::iterator;
class list<CopterGameMode>::iterator : public bidirectional_iterator<CopterGameMode,int>
{ // packed(0x4 bytes) TI: 0x1a18
protected:
	/*+0x0*/   /*packed*/ struct list<CopterGameMode>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<CopterGameMode>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<CopterGameMode>::iterator&);
	/*packed*/ class CopterGameMode& operator*();
	/*packed*/ class list<CopterGameMode>::iterator operator++(int32_t);
	/*packed*/ class list<CopterGameMode>::iterator& operator++();
	/*packed*/ class list<CopterGameMode>::iterator operator--(int32_t);
	/*packed*/ class list<CopterGameMode>::iterator& operator--();
};

// Type: /*packed*/ struct bidirectional_iterator<Shortcut,int>;
struct bidirectional_iterator<Shortcut,int>{ // packed(0x1 bytes) TI: 0x1ee7
};

// Type: /*packed*/ class CDefaultCommander;
// VTABLE: COPTER_D 0x005912d0
class CDefaultCommander : public ICommander
{ // packed(0x8 bytes) TI: 0x20ed
public:
	void CDefaultCommander();
	virtual void ~CDefaultCommander() /* override */;
	virtual unsigned long Idle() /* override */;
	virtual unsigned long OnCharacter(char, int32_t) /* override */;
	virtual unsigned long OnMouseDown(int32_t, int32_t) /* override */;
	virtual unsigned long OnMouseUp(int32_t, int32_t) /* override */;
	virtual unsigned long OnMouseMove(int32_t, int32_t) /* override */;
	virtual unsigned long OnWindowActivate() /* override */;
	virtual unsigned long OnWindowDeactivate() /* override */;
};

// Type: /*packed*/ struct bidirectional_iterator<CopterGameMode,int>;
struct bidirectional_iterator<CopterGameMode,int>{ // packed(0x1 bytes) TI: 0x184c
};

// Type: /*packed*/ class PreferenceManager;
// VTABLE: COPTER_D 0x00590db0
class PreferenceManager{ // packed(0x28 bytes) TI: 0x26c8
protected:
	/*+0x4*/   int32_t bSaveFileAtAllChanges;
	/*+0x8*/   /*packed*/ class list<PreferenceItem> myPreferences; // 0x8 bytes
	/*+0x10*/  /*packed*/ class MIFF *miffPrefsFile;
	/*+0x14*/  long lFileCreator;
	/*+0x18*/  long lFileType;
	/*+0x1c*/  long lFileVersion;
	/*+0x20*/  int32_t bPrefsDirty;
	/*+0x24*/  int32_t bPrefsLocked;
public:
	void PreferenceManager(long, long, long, int32_t);
	int32_t IPreferenceManager(char *);
	virtual void ~PreferenceManager(); // vtable+0x0
	virtual long SaveAllPrefs(); // vtable+0x4
	virtual long LoadAllPrefs(); // vtable+0x8
	virtual long ClearPrefsMemory(); // vtable+0xc
	virtual void EnumeratePrefs(); // vtable+0x10
	virtual /*packed*/ class PreferenceItem* GetPrefPointer(long); // vtable+0x14
	virtual /*packed*/ class PreferenceItem* GetPrefCopy(long); // vtable+0x18
	virtual char * GetPrefDataPointer(long); // vtable+0x1c
	virtual char * GetPrefDataCopy(long); // vtable+0x20
	virtual long GetPrefDataLength(long); // vtable+0x24
	virtual long SetPref(/*packed*/ class PreferenceItem*); // vtable+0x28
	virtual long SetPref(long, char *, long); // vtable+0x2c
	virtual long RemovePref(long); // vtable+0x30
};

// Type: /*packed*/ class SparkalPalette;
// VTABLE: COPTER_D 0x005910f8
class SparkalPalette{ // packed(0x10 bytes) TI: 0x47c7
public:
	/*+0x4*/   /*packed*/ struct SparkalColor *pColors;
	/*+0x8*/   long lColors;
	/*+0xc*/   int32_t bOwnColors;
	void SparkalPalette(/*packed*/ struct SparkalColor*, int32_t, unsigned long);
	void SparkalPalette();
	virtual void ~SparkalPalette(); // vtable+0x0
	virtual void GetRGBValue(int32_t, /*packed*/ struct SparkalColor&); // vtable+0x4
	virtual void GetNearestIndex(/*packed*/ struct SparkalColor&, int32_t&); // vtable+0x8
	virtual void FadeToWhite(long); // vtable+0xc
	virtual void FadeToBlack(long); // vtable+0x10
	virtual void FadeToPalette(/*packed*/ struct SparkalColor, long, long); // vtable+0x14
	// calltype: NearC
	static void FadeToPalette(/*packed*/ struct SparkalColor, /*packed*/ struct SparkalColor*, long, long);
	void FadeToRGB(/*packed*/ struct SparkalColor&, long);
	// calltype: NearC
	static void SetSystemPaletteEntriesToRGB(/*packed*/ struct SparkalColor&);
	virtual void ImplementNewPalette(/*packed*/ struct SparkalColor*); // vtable+0x18
};

// Type: /*unpacked*/ class ICommander (forward reference);
