// Module: Gamecomm.obj
// Source: C:\Copter\source\sparkal\Gamecomm.cpp
// autogenerated by simcopter_tool from PDB file

// Type: char *;

// Type: /*packed*/ struct CommandSystem (forward reference);
struct CommandSystem{ // packed(0xaa8 bytes) TI: 0x12e4
	/*+0x0*/   /*packed*/ struct Command keyboardCommands[100]; // 0xc8 bytes
	/*+0xc8*/  /*packed*/ class CharList keyboardCommandList; // 0x10 bytes
	/*+0xd8*/  /*packed*/ class list<Shortcut> commandShortcuts; // 0x8 bytes
	/*+0xe0*/  unsigned char chCommandKeyboardArray[2048]; // 0x800 bytes
	/*+0x8e0*/ unsigned char chCommandJoystickArray[4][14]; // 0x38 bytes
	/*+0x918*/ long joystickCommands[100]; // 0x190 bytes
	void CommandSystem();
	void Initialize();
	void ClearAllCommands();
	void ClearAllCommandsDevice(long);
	void TurnOnCommand(int32_t);
	void TurnOffCommand(int32_t);
	void TurnOnCommandDevice(int32_t, long);
	void TurnOffCommandDevice(int32_t, long);
	int32_t IsCommandSet(int32_t);
	int32_t IsCommandPush(int32_t);
	void SetUpCommandArraysFromShortcuts();
	// calltype: NearC
	static int32_t GetKeystateIndexForChar(long, char);
	long GetJoystickCommandValue(int32_t);
	void PollJoysticksForCommands();
};

// Type: void;

// Type: int32_t;

// Type: long;

// Type: unsigned char;

// Type: /*packed*/ class list<Shortcut>::iterator;
class list<Shortcut>::iterator : public bidirectional_iterator<Shortcut,int>
{ // packed(0x4 bytes) TI: 0x1081
protected:
	/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<Shortcut>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<Shortcut>::iterator&);
	/*packed*/ struct Shortcut& operator*();
	/*packed*/ class list<Shortcut>::iterator operator++(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator++();
	/*packed*/ class list<Shortcut>::iterator operator--(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator--();
};

// Type: /*packed*/ class CGameCommander (forward reference);
// VTABLE: COPTER_D 0x00590ff8
class CGameCommander : public CDefaultCommander
{ // packed(0xc bytes) TI: 0x1d27
public:
	void CGameCommander();
	virtual void ~CGameCommander() /* override */;
	virtual unsigned long Idle() /* override */;
	virtual void ProcessSetFocus(); // vtable+0x24
	virtual void ProcessKeyDown(long, /*packed*/ struct CommandSystem&, int32_t&, int32_t&); // vtable+0x28
	virtual void ProcessKeyDown(long); // vtable+0x2c
	virtual void ProcessKeyUp(long, /*packed*/ struct CommandSystem&); // vtable+0x30
	virtual void ProcessKeyUp(long); // vtable+0x34
	virtual unsigned long OnCharacter(long); // vtable+0x38
	virtual unsigned long OnLMouseDown(int32_t, int32_t); // vtable+0x3c
	virtual unsigned long OnLMouseUp(int32_t, int32_t); // vtable+0x40
	virtual unsigned long OnRMouseDown(int32_t, int32_t); // vtable+0x44
	virtual unsigned long OnRMouseUp(int32_t, int32_t); // vtable+0x48
	virtual unsigned long OnMouseMove(int32_t, int32_t) /* override */;
	virtual unsigned long OnWindowActivate() /* override */;
	virtual unsigned long OnWindowDeactivate() /* override */;
	virtual void ProcessSystemCloseRequest(); // vtable+0x4c
	virtual void SetNewGameApp(/*unpacked*/ class CGameApp*); // vtable+0x50
	/*+0x8*/   /*unpacked*/ class CGameApp *myGameApp;
};

// Type: unsigned long;

// Type: /*packed*/ class CharData (forward reference);
class CharData{ // packed(0x9 bytes) TI: 0x4578
public:
	/*+0x0*/   unsigned char chValue; // 0x1 bytes
	/*+0x1*/   /*packed*/ class CharData *previousCharData;
	/*+0x5*/   /*packed*/ class CharData *nextCharData;
	void CharData(unsigned char);
	void CharData();
};

// Type: /*packed*/ class list<Shortcut> (forward reference);
class list<Shortcut>{ // packed(0x8 bytes) TI: 0x1b79
	using void_pointer = void * __ptr32;
	struct list<Shortcut>::list_node{ // packed(0x20 bytes) TI: 0x1b8e
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*packed*/ struct Shortcut data; // 0x18 bytes
	};
protected:
	static /*packed*/ class allocator<list<Shortcut>::list_node> list_node_allocator;
	static /*packed*/ class allocator<Shortcut> value_allocator;
	using value_type = /*packed*/ struct Shortcut;
	using value_allocator_type = /*packed*/ class allocator<Shortcut>;
	using pointer = /*packed*/ struct Shortcut*;
	using reference = /*packed*/ struct Shortcut&;
	using const_reference = const /*packed*/ struct Shortcut&;
	using list_node_allocator_type = /*packed*/ class allocator<list<Shortcut>::list_node>;
	using link_type = /*packed*/ struct list<Shortcut>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<Shortcut>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1b8c
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<Shortcut>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<Shortcut>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<Shortcut>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<Shortcut>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<Shortcut>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<Shortcut>::list_node *free_list;
	static /*packed*/ struct list<Shortcut>::list_node *next_avail;
	static /*packed*/ struct list<Shortcut>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<Shortcut>::list_node* get_node();
	void put_node(/*packed*/ struct list<Shortcut>::list_node*);
	/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<Shortcut>::iterator : public bidirectional_iterator<Shortcut,int>
	{ // packed(0x4 bytes) TI: 0x1081
	protected:
		/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<Shortcut>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<Shortcut>::iterator&);
		/*packed*/ struct Shortcut& operator*();
		/*packed*/ class list<Shortcut>::iterator operator++(int32_t);
		/*packed*/ class list<Shortcut>::iterator& operator++();
		/*packed*/ class list<Shortcut>::iterator operator--(int32_t);
		/*packed*/ class list<Shortcut>::iterator& operator--();
	};
	class list<Shortcut>::const_iterator : public bidirectional_iterator<Shortcut,int>
	{ // packed(0x4 bytes) TI: 0x1b8a
	protected:
		/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<Shortcut>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<Shortcut>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<Shortcut>::const_iterator&);
		const /*packed*/ struct Shortcut& operator*();
		/*packed*/ class list<Shortcut>::const_iterator operator++(int32_t);
		/*packed*/ class list<Shortcut>::const_iterator& operator++();
		/*packed*/ class list<Shortcut>::const_iterator operator--(int32_t);
		/*packed*/ class list<Shortcut>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::const_iterator,Shortcut,Shortcut const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::iterator,Shortcut,Shortcut &,int>;
public:
	void list<Shortcut>(const /*packed*/ class list<Shortcut>&);
	void list<Shortcut>(const /*packed*/ struct Shortcut*, const /*packed*/ struct Shortcut*);
	void list<Shortcut>(uint32_t, const /*packed*/ struct Shortcut&);
	void list<Shortcut>();
	/*packed*/ class list<Shortcut>::const_iterator begin();
	/*packed*/ class list<Shortcut>::iterator begin();
	/*packed*/ class list<Shortcut>::const_iterator end();
	/*packed*/ class list<Shortcut>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::const_iterator,Shortcut,Shortcut const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::iterator,Shortcut,Shortcut &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::const_iterator,Shortcut,Shortcut const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<Shortcut>::iterator,Shortcut,Shortcut &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*packed*/ struct Shortcut& front();
	/*packed*/ struct Shortcut& front();
	const /*packed*/ struct Shortcut& back();
	/*packed*/ struct Shortcut& back();
	void swap(/*packed*/ class list<Shortcut>&);
	void insert(/*packed*/ class list<Shortcut>::iterator, uint32_t, const /*packed*/ struct Shortcut&);
	void insert(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::const_iterator, /*packed*/ class list<Shortcut>::const_iterator);
	void insert(/*packed*/ class list<Shortcut>::iterator, const /*packed*/ struct Shortcut*, const /*packed*/ struct Shortcut*);
	/*packed*/ class list<Shortcut>::iterator insert(/*packed*/ class list<Shortcut>::iterator, const /*packed*/ struct Shortcut&);
	void push_front(const /*packed*/ struct Shortcut&);
	void push_back(const /*packed*/ struct Shortcut&);
	void erase(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::iterator);
	void erase(/*packed*/ class list<Shortcut>::iterator);
	void pop_front();
	void pop_back();
	void ~list<Shortcut>();
	/*packed*/ class list<Shortcut>& operator=(const /*packed*/ class list<Shortcut>&);
protected:
	void transfer(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::iterator);
public:
	void splice(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>&, /*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>::iterator);
	void splice(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>&, /*packed*/ class list<Shortcut>::iterator);
	void splice(/*packed*/ class list<Shortcut>::iterator, /*packed*/ class list<Shortcut>&);
	void remove(const /*packed*/ struct Shortcut&);
	void unique();
	void merge(/*packed*/ class list<Shortcut>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ class MIFF;
// VTABLE: COPTER_D 0x00591950
class MIFF : public PFile
{ // packed(0x148 bytes) TI: 0x428e
public:
	void MIFF(char *);
	void MIFF();
	virtual void ~MIFF() /* override */;
	virtual long OpenForReading(); // vtable+0x4
	virtual long OpenForWriting(long, long, long); // vtable+0x8
	virtual long OpenForAppending(); // vtable+0xc
	virtual long Close(); // vtable+0x10
	virtual long GetPresentRecordType(); // vtable+0x14
	virtual long GetPresentRecordSize(); // vtable+0x18
	virtual long GetPresentRecordDataSize(); // vtable+0x1c
	virtual long GetPresentRecordIndex(); // vtable+0x20
	virtual long VerifyFile(); // vtable+0x24
	virtual long ReadMIFFHeader(); // vtable+0x28
	virtual long ReadRecordHeader(); // vtable+0x2c
	virtual long ReadFileCreator(); // vtable+0x30
	virtual long ReadFileType(); // vtable+0x34
	virtual long ReadFileVersion(); // vtable+0x38
	virtual long ReadPresentRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x3c
	virtual long ReadPresentRecordData(char *, long); // vtable+0x40
	virtual long GoToFirstRecord(); // vtable+0x44
	virtual long GoToNextRecord(); // vtable+0x48
	virtual long GoToPreviousRecord(); // vtable+0x4c
	virtual long GoToFirstRecordOfGivenType(long); // vtable+0x50
	virtual long GoToNextRecordOfGivenType(long); // vtable+0x54
	virtual long GoToNthRecord(long); // vtable+0x58
	virtual long CountRecords(); // vtable+0x5c
	virtual long WriteMIFFRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x60
	virtual long WriteDataRecord(long, char *, long); // vtable+0x64
	virtual long WriteFileHeader(long, long, long); // vtable+0x68
	virtual long WriteEnd(); // vtable+0x6c
	/*+0x110*/ long lPresentRecordStart;
	/*+0x114*/ long lPresentRecordType;
	/*+0x118*/ long lPresentRecordLength;
	/*+0x11c*/ long lPresentRecordIndex;
	/*+0x120*/ long lReadWriteMode;
	/*+0x124*/ long bFileEndWritten;
	/*+0x128*/ long bFileAppearsCorrupt;
	/*+0x12c*/ /*packed*/ struct MIFFHeader myMIFFHeader; // 0x1c bytes
};

// Type: /*packed*/ struct Shortcut;
struct Shortcut{ // packed(0x18 bytes) TI: 0x1083
	/*+0x0*/   long lDeviceID;
	/*+0x4*/   long lCommand;
	/*+0x8*/   long lKey;
	/*+0xc*/   long lModifiers;
	/*+0x10*/  long lPush;
	/*+0x14*/  long lIgnoreModifiers;
};

// Type: char;

// Type: /*packed*/ struct Shortcut (forward reference);
struct Shortcut{ // packed(0x18 bytes) TI: 0x1083
	/*+0x0*/   long lDeviceID;
	/*+0x4*/   long lCommand;
	/*+0x8*/   long lKey;
	/*+0xc*/   long lModifiers;
	/*+0x10*/  long lPush;
	/*+0x14*/  long lIgnoreModifiers;
};

// Type: long *;

// Type: /*unpacked*/ class CGameApp (forward reference);
// CGameApp Class implementation not found

// Type: uint32_t;

// Type: /*packed*/ struct list<Shortcut>::list_node (forward reference);
struct list<Shortcut>::list_node{ // packed(0x20 bytes) TI: 0x1b8e
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*packed*/ struct Shortcut data; // 0x18 bytes
};

// Type: /*packed*/ class list<Shortcut>::iterator (forward reference);
class list<Shortcut>::iterator : public bidirectional_iterator<Shortcut,int>
{ // packed(0x4 bytes) TI: 0x1081
protected:
	/*+0x0*/   /*packed*/ struct list<Shortcut>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<Shortcut>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<Shortcut>::iterator&);
	/*packed*/ struct Shortcut& operator*();
	/*packed*/ class list<Shortcut>::iterator operator++(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator++();
	/*packed*/ class list<Shortcut>::iterator operator--(int32_t);
	/*packed*/ class list<Shortcut>::iterator& operator--();
};

// Type: /*packed*/ struct bidirectional_iterator<Shortcut,int>;
struct bidirectional_iterator<Shortcut,int>{ // packed(0x1 bytes) TI: 0x1ee7
};

// Type: /*packed*/ class PFile;
// VTABLE: COPTER_D 0x00590468
class PFile{ // packed(0x110 bytes) TI: 0x453c
	enum /* __unnamed */ {
		FileNull = -1,
	};
	enum SeekTypes {
		N_SEEK_FROM_FILE_START = 0,
		N_SEEK_FROM_FILE_CURRENT = 1,
		N_SEEK_FROM_FILE_END = 2,
	};
	enum AccessTypes {
		ReadOnly = 0,
		ReadWrite = 2,
		WriteOnly = 1,
		Create = 768,
		CreateExcl = 1280,
		Append = 8,
		Binary = 32768,
		Compat = 0,
		DenyNone = 64,
		DenyRead = 48,
		DenyWrite = 32,
		DenyRdWr = 16,
		NoInherit = 128,
	};
	enum PermissionTypes {
		PermRead = 256,
		PermWrite = 128,
		PermRdWr = 384,
	};
	enum seek_dir {
		beg = 0,
		cur = 1,
		end = 2,
	};
public:
	void PFile(char *);
	void PFile(const /*packed*/ class PFile&);
	void PFile(int32_t);
	void PFile();
	virtual void ~PFile(); // vtable+0x0
	int32_t Open(char *, unsigned short, unsigned short, int32_t);
	int32_t Close();
	int32_t GetHandle();
	long Position();
	void Length(long);
	long Length();
	long Seek(long, int32_t);
	long SeekToBegin();
	long SeekToEnd();
	int32_t IsOpen();
	int32_t Read(void * __ptr32, int32_t);
	int32_t Write(void * __ptr32, int32_t);
	void Flush();
	// calltype: NearC
	static void Remove(char *);
	// calltype: NearC
	static void Rename(char *, char *);
	// calltype: NearC
	static unsigned long Checksum(char *);
	long SetPath(char *);
	long FileCreate(char *, int32_t);
	long FileExists(char *);
	/*+0x4*/   char szFilePath[260]; // 0x104 bytes
	/*+0x108*/ int32_t Handle;
private:
	/*+0x10c*/ int32_t ShouldClose;
};

// Type: /*packed*/ class CDefaultCommander;
// VTABLE: COPTER_D 0x005912d0
class CDefaultCommander : public ICommander
{ // packed(0x8 bytes) TI: 0x20ed
public:
	void CDefaultCommander();
	virtual void ~CDefaultCommander() /* override */;
	virtual unsigned long Idle() /* override */;
	virtual unsigned long OnCharacter(char, int32_t) /* override */;
	virtual unsigned long OnMouseDown(int32_t, int32_t) /* override */;
	virtual unsigned long OnMouseUp(int32_t, int32_t) /* override */;
	virtual unsigned long OnMouseMove(int32_t, int32_t) /* override */;
	virtual unsigned long OnWindowActivate() /* override */;
	virtual unsigned long OnWindowDeactivate() /* override */;
};

// Type: /*unpacked*/ class ICommander (forward reference);
// ICommander Class implementation not found



// Contribution: 1:0008a2b0-0008d894 Module: 26, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x0048b2b0
void CommandSystem::CommandSystem() {

