// Module: Graphwin.obj
// Source: C:\Copter\source\sparkal\Graphwin.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct GraphicWindowColorConstants;
struct GraphicWindowColorConstants{ // packed(0x24 bytes) TI: 0x10f2
	/*+0x0*/   int32_t nPaletteIndexBlack;
	/*+0x4*/   int32_t nPaletteIndexDarkGray;
	/*+0x8*/   int32_t nPaletteIndexLightGray;
	/*+0xc*/   int32_t nPaletteIndexWhite;
	/*+0x10*/  int32_t nPaletteIndexRed;
	/*+0x14*/  int32_t nPaletteIndexBlue;
	/*+0x18*/  int32_t nPaletteIndexGreen;
	/*+0x1c*/  int32_t nPaletteIndexBlueGreen;
	/*+0x20*/  int32_t nPaletteIndexTransparent;
	void GraphicWindowColorConstants();
};

// Type: /*unpacked*/ class GraphicWindow (forward reference);
// GraphicWindow Class implementation not found

// Type: /*packed*/ class list<GraphicWindow *>;
class list<GraphicWindow *>{ // packed(0x8 bytes) TI: 0x1ec0
	using void_pointer = void * __ptr32;
	struct list<GraphicWindow *>::list_node{ // packed(0xc bytes) TI: 0x1ee6
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*unpacked*/ class GraphicWindow *data;
	};
protected:
	static /*packed*/ class allocator<list<GraphicWindow *>::list_node> list_node_allocator;
	static /*packed*/ class allocator<GraphicWindow *> value_allocator;
	using value_type = /*unpacked*/ class GraphicWindow*;
	using value_allocator_type = /*packed*/ class allocator<GraphicWindow *>;
	using pointer = /*unpacked*/ class GraphicWindow**;
	using reference = /*unpacked*/ class GraphicWindow*&;
	using const_reference = const /*unpacked*/ class GraphicWindow*&;
	using list_node_allocator_type = /*packed*/ class allocator<list<GraphicWindow *>::list_node>;
	using link_type = /*packed*/ struct list<GraphicWindow *>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<GraphicWindow *>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1ee4
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<GraphicWindow *>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<GraphicWindow *>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<GraphicWindow *>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<GraphicWindow *>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<GraphicWindow *>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<GraphicWindow *>::list_node *free_list;
	static /*packed*/ struct list<GraphicWindow *>::list_node *next_avail;
	static /*packed*/ struct list<GraphicWindow *>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<GraphicWindow *>::list_node* get_node();
	void put_node(/*packed*/ struct list<GraphicWindow *>::list_node*);
	/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<GraphicWindow *>::iterator : public bidirectional_iterator<GraphicWindow *,int>
	{ // packed(0x4 bytes) TI: 0x1ee2
	protected:
		/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<GraphicWindow *>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<GraphicWindow *>::iterator&);
		/*unpacked*/ class GraphicWindow*& operator*();
		/*packed*/ class list<GraphicWindow *>::iterator operator++(int32_t);
		/*packed*/ class list<GraphicWindow *>::iterator& operator++();
		/*packed*/ class list<GraphicWindow *>::iterator operator--(int32_t);
		/*packed*/ class list<GraphicWindow *>::iterator& operator--();
	};
	class list<GraphicWindow *>::const_iterator : public bidirectional_iterator<GraphicWindow *,int>
	{ // packed(0x4 bytes) TI: 0x1ed5
	protected:
		/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<GraphicWindow *>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<GraphicWindow *>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<GraphicWindow *>::const_iterator&);
		const /*unpacked*/ class GraphicWindow*& operator*();
		/*packed*/ class list<GraphicWindow *>::const_iterator operator++(int32_t);
		/*packed*/ class list<GraphicWindow *>::const_iterator& operator++();
		/*packed*/ class list<GraphicWindow *>::const_iterator operator--(int32_t);
		/*packed*/ class list<GraphicWindow *>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::const_iterator,GraphicWindow *,GraphicWindow * const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::iterator,GraphicWindow *,GraphicWindow * &,int>;
public:
	void list<GraphicWindow *>(const /*packed*/ class list<GraphicWindow *>&);
	void list<GraphicWindow *>(const /*unpacked*/ class GraphicWindow**, const /*unpacked*/ class GraphicWindow**);
	void list<GraphicWindow *>(uint32_t, const /*unpacked*/ class GraphicWindow*&);
	void list<GraphicWindow *>();
	/*packed*/ class list<GraphicWindow *>::const_iterator begin();
	/*packed*/ class list<GraphicWindow *>::iterator begin();
	/*packed*/ class list<GraphicWindow *>::const_iterator end();
	/*packed*/ class list<GraphicWindow *>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::const_iterator,GraphicWindow *,GraphicWindow * const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::iterator,GraphicWindow *,GraphicWindow * &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::const_iterator,GraphicWindow *,GraphicWindow * const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::iterator,GraphicWindow *,GraphicWindow * &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*unpacked*/ class GraphicWindow*& front();
	/*unpacked*/ class GraphicWindow*& front();
	const /*unpacked*/ class GraphicWindow*& back();
	/*unpacked*/ class GraphicWindow*& back();
	void swap(/*packed*/ class list<GraphicWindow *>&);
	void insert(/*packed*/ class list<GraphicWindow *>::iterator, uint32_t, const /*unpacked*/ class GraphicWindow*&);
	void insert(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::const_iterator, /*packed*/ class list<GraphicWindow *>::const_iterator);
	void insert(/*packed*/ class list<GraphicWindow *>::iterator, const /*unpacked*/ class GraphicWindow**, const /*unpacked*/ class GraphicWindow**);
	/*packed*/ class list<GraphicWindow *>::iterator insert(/*packed*/ class list<GraphicWindow *>::iterator, const /*unpacked*/ class GraphicWindow*&);
	void push_front(const /*unpacked*/ class GraphicWindow*&);
	void push_back(const /*unpacked*/ class GraphicWindow*&);
	void erase(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::iterator);
	void erase(/*packed*/ class list<GraphicWindow *>::iterator);
	void pop_front();
	void pop_back();
	void ~list<GraphicWindow *>();
	/*packed*/ class list<GraphicWindow *>& operator=(const /*packed*/ class list<GraphicWindow *>&);
protected:
	void transfer(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::iterator);
public:
	void splice(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>&, /*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::iterator);
	void splice(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>&, /*packed*/ class list<GraphicWindow *>::iterator);
	void splice(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>&);
	void remove(const /*unpacked*/ class GraphicWindow*&);
	void unique();
	void merge(/*packed*/ class list<GraphicWindow *>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ class GraphicWindowManager (forward reference);
// VTABLE: COPTER_D 0x00591648
class GraphicWindowManager{ // packed(0x14 bytes) TI: 0x41e5
public:
	void GraphicWindowManager(/*unpacked*/ class GraphicWindow*);
	void ~GraphicWindowManager();
	virtual void SetNewBaseWindow(/*unpacked*/ class GraphicWindow*); // vtable+0x0
	virtual int32_t DeleteWindow(/*unpacked*/ class GraphicWindow*); // vtable+0x4
	virtual long DoCharacter(long); // vtable+0x8
	virtual long DoKeyDown(long, char); // vtable+0xc
	virtual long DoKeyUp(long, char); // vtable+0x10
	virtual long DoCursorDown(long, long, unsigned long); // vtable+0x14
	virtual long DoCursorUp(long, long, unsigned long); // vtable+0x18
	virtual long DoCursorMove(long, long); // vtable+0x1c
	virtual int32_t SendCursorMessageToChildWindow(/*unpacked*/ class GraphicWindow*, int32_t, long, long, unsigned long); // vtable+0x20
	virtual int32_t ComposeAllWindows(); // vtable+0x24
	virtual int32_t IsWindowValid(/*unpacked*/ class GraphicWindow*); // vtable+0x28
	virtual int32_t IsWindowOrParentInDeletionList(/*unpacked*/ class GraphicWindow*); // vtable+0x2c
	virtual int32_t IncrementBusyCount(); // vtable+0x30
	virtual int32_t DecrementBusyCount(); // vtable+0x34
protected:
	int32_t DeleteWindowAndRemoveItsTraces(/*unpacked*/ class GraphicWindow*);
	int32_t DeleteAllWindowsInDeletionList();
	/*+0x4*/   int32_t nBusyIteratingCount;
	/*+0x8*/   /*unpacked*/ class GraphicWindow *baseWindow;
	/*+0xc*/   /*packed*/ class list<GraphicWindow *> listWindowsToDelete; // 0x8 bytes
};

// Type: void ();

// Type: /*packed*/ struct list<GraphicWindow *>::list_node_buffer (forward reference);
struct list<GraphicWindow *>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1ee4
	/*+0x0*/   void * __ptr32 next_buffer;
	/*+0x4*/   /*packed*/ struct list<GraphicWindow *>::list_node *buffer;
};

// Type: /*packed*/ struct list<GraphicWindow *>::list_node (forward reference);
struct list<GraphicWindow *>::list_node{ // packed(0xc bytes) TI: 0x1ee6
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*unpacked*/ class GraphicWindow *data;
};

// Type: uint32_t;

// Type: void;

// Type: /*packed*/ struct GraphicWindowColorConstants (forward reference);
struct GraphicWindowColorConstants{ // packed(0x24 bytes) TI: 0x10f2
	/*+0x0*/   int32_t nPaletteIndexBlack;
	/*+0x4*/   int32_t nPaletteIndexDarkGray;
	/*+0x8*/   int32_t nPaletteIndexLightGray;
	/*+0xc*/   int32_t nPaletteIndexWhite;
	/*+0x10*/  int32_t nPaletteIndexRed;
	/*+0x14*/  int32_t nPaletteIndexBlue;
	/*+0x18*/  int32_t nPaletteIndexGreen;
	/*+0x1c*/  int32_t nPaletteIndexBlueGreen;
	/*+0x20*/  int32_t nPaletteIndexTransparent;
	void GraphicWindowColorConstants();
};

// Type: /*packed*/ class GraphicWindowOwner (forward reference);
// VTABLE: COPTER_D 0x00590f2c
class GraphicWindowOwner{ // packed(0x4 bytes) TI: 0x1647
public:
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32); // vtable+0x0
};

// Type: long;

// Type: void * __ptr32;

// Type: int32_t;

// Type: /*packed*/ class list<GraphicWindow *>::iterator;
class list<GraphicWindow *>::iterator : public bidirectional_iterator<GraphicWindow *,int>
{ // packed(0x4 bytes) TI: 0x1ee2
protected:
	/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<GraphicWindow *>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<GraphicWindow *>::iterator&);
	/*unpacked*/ class GraphicWindow*& operator*();
	/*packed*/ class list<GraphicWindow *>::iterator operator++(int32_t);
	/*packed*/ class list<GraphicWindow *>::iterator& operator++();
	/*packed*/ class list<GraphicWindow *>::iterator operator--(int32_t);
	/*packed*/ class list<GraphicWindow *>::iterator& operator--();
};

// Type: char;

// Type: unsigned long;

// Type: /*packed*/ class MRect (forward reference);
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: char *;

// Type: /*packed*/ class MRect;
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: /*packed*/ class basic_string<char> (forward reference);
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: /*unpacked*/ class CBackBuffer (forward reference);
// CBackBuffer Class implementation not found

// Type: /*packed*/ struct SparkalColor (forward reference);
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: /*packed*/ class ScreenWindow (forward reference);
// VTABLE: COPTER_D 0x00591748
class ScreenWindow : public GraphicWindow
{ // packed(0x78 bytes) TI: 0x2149
public:
	void ScreenWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class CBackBuffer*, /*packed*/ class GraphicWindowOwner*, int32_t);
	void ScreenWindow(const /*packed*/ class ScreenWindow&);
	void ScreenWindow();
	virtual void ~ScreenWindow() /* override */;
	/*packed*/ class ScreenWindow& operator=(const /*packed*/ class ScreenWindow&);
	virtual int32_t ComposeSelf() /* override */;
	virtual int32_t DrawSelf() /* override */;
	void SetParentBuffer(/*unpacked*/ class CBackBuffer*);
protected:
	/*+0x74*/  /*unpacked*/ class CBackBuffer *bufferParent;
};

// Type: /*packed*/ class list<GraphicWindow *> (forward reference);
class list<GraphicWindow *>{ // packed(0x8 bytes) TI: 0x1ec0
	using void_pointer = void * __ptr32;
	struct list<GraphicWindow *>::list_node{ // packed(0xc bytes) TI: 0x1ee6
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*unpacked*/ class GraphicWindow *data;
	};
protected:
	static /*packed*/ class allocator<list<GraphicWindow *>::list_node> list_node_allocator;
	static /*packed*/ class allocator<GraphicWindow *> value_allocator;
	using value_type = /*unpacked*/ class GraphicWindow*;
	using value_allocator_type = /*packed*/ class allocator<GraphicWindow *>;
	using pointer = /*unpacked*/ class GraphicWindow**;
	using reference = /*unpacked*/ class GraphicWindow*&;
	using const_reference = const /*unpacked*/ class GraphicWindow*&;
	using list_node_allocator_type = /*packed*/ class allocator<list<GraphicWindow *>::list_node>;
	using link_type = /*packed*/ struct list<GraphicWindow *>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<GraphicWindow *>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1ee4
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<GraphicWindow *>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<GraphicWindow *>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<GraphicWindow *>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<GraphicWindow *>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<GraphicWindow *>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<GraphicWindow *>::list_node *free_list;
	static /*packed*/ struct list<GraphicWindow *>::list_node *next_avail;
	static /*packed*/ struct list<GraphicWindow *>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<GraphicWindow *>::list_node* get_node();
	void put_node(/*packed*/ struct list<GraphicWindow *>::list_node*);
	/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<GraphicWindow *>::iterator : public bidirectional_iterator<GraphicWindow *,int>
	{ // packed(0x4 bytes) TI: 0x1ee2
	protected:
		/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<GraphicWindow *>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<GraphicWindow *>::iterator&);
		/*unpacked*/ class GraphicWindow*& operator*();
		/*packed*/ class list<GraphicWindow *>::iterator operator++(int32_t);
		/*packed*/ class list<GraphicWindow *>::iterator& operator++();
		/*packed*/ class list<GraphicWindow *>::iterator operator--(int32_t);
		/*packed*/ class list<GraphicWindow *>::iterator& operator--();
	};
	class list<GraphicWindow *>::const_iterator : public bidirectional_iterator<GraphicWindow *,int>
	{ // packed(0x4 bytes) TI: 0x1ed5
	protected:
		/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<GraphicWindow *>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<GraphicWindow *>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<GraphicWindow *>::const_iterator&);
		const /*unpacked*/ class GraphicWindow*& operator*();
		/*packed*/ class list<GraphicWindow *>::const_iterator operator++(int32_t);
		/*packed*/ class list<GraphicWindow *>::const_iterator& operator++();
		/*packed*/ class list<GraphicWindow *>::const_iterator operator--(int32_t);
		/*packed*/ class list<GraphicWindow *>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::const_iterator,GraphicWindow *,GraphicWindow * const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::iterator,GraphicWindow *,GraphicWindow * &,int>;
public:
	void list<GraphicWindow *>(const /*packed*/ class list<GraphicWindow *>&);
	void list<GraphicWindow *>(const /*unpacked*/ class GraphicWindow**, const /*unpacked*/ class GraphicWindow**);
	void list<GraphicWindow *>(uint32_t, const /*unpacked*/ class GraphicWindow*&);
	void list<GraphicWindow *>();
	/*packed*/ class list<GraphicWindow *>::const_iterator begin();
	/*packed*/ class list<GraphicWindow *>::iterator begin();
	/*packed*/ class list<GraphicWindow *>::const_iterator end();
	/*packed*/ class list<GraphicWindow *>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::const_iterator,GraphicWindow *,GraphicWindow * const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::iterator,GraphicWindow *,GraphicWindow * &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::const_iterator,GraphicWindow *,GraphicWindow * const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<GraphicWindow *>::iterator,GraphicWindow *,GraphicWindow * &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*unpacked*/ class GraphicWindow*& front();
	/*unpacked*/ class GraphicWindow*& front();
	const /*unpacked*/ class GraphicWindow*& back();
	/*unpacked*/ class GraphicWindow*& back();
	void swap(/*packed*/ class list<GraphicWindow *>&);
	void insert(/*packed*/ class list<GraphicWindow *>::iterator, uint32_t, const /*unpacked*/ class GraphicWindow*&);
	void insert(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::const_iterator, /*packed*/ class list<GraphicWindow *>::const_iterator);
	void insert(/*packed*/ class list<GraphicWindow *>::iterator, const /*unpacked*/ class GraphicWindow**, const /*unpacked*/ class GraphicWindow**);
	/*packed*/ class list<GraphicWindow *>::iterator insert(/*packed*/ class list<GraphicWindow *>::iterator, const /*unpacked*/ class GraphicWindow*&);
	void push_front(const /*unpacked*/ class GraphicWindow*&);
	void push_back(const /*unpacked*/ class GraphicWindow*&);
	void erase(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::iterator);
	void erase(/*packed*/ class list<GraphicWindow *>::iterator);
	void pop_front();
	void pop_back();
	void ~list<GraphicWindow *>();
	/*packed*/ class list<GraphicWindow *>& operator=(const /*packed*/ class list<GraphicWindow *>&);
protected:
	void transfer(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::iterator);
public:
	void splice(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>&, /*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>::iterator);
	void splice(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>&, /*packed*/ class list<GraphicWindow *>::iterator);
	void splice(/*packed*/ class list<GraphicWindow *>::iterator, /*packed*/ class list<GraphicWindow *>&);
	void remove(const /*unpacked*/ class GraphicWindow*&);
	void unique();
	void merge(/*packed*/ class list<GraphicWindow *>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ class list<GraphicWindow *>::iterator (forward reference);
class list<GraphicWindow *>::iterator : public bidirectional_iterator<GraphicWindow *,int>
{ // packed(0x4 bytes) TI: 0x1ee2
protected:
	/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<GraphicWindow *>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<GraphicWindow *>::iterator&);
	/*unpacked*/ class GraphicWindow*& operator*();
	/*packed*/ class list<GraphicWindow *>::iterator operator++(int32_t);
	/*packed*/ class list<GraphicWindow *>::iterator& operator++();
	/*packed*/ class list<GraphicWindow *>::iterator operator--(int32_t);
	/*packed*/ class list<GraphicWindow *>::iterator& operator--();
};

// Type: /*packed*/ class list<GraphicWindow *>::const_iterator (forward reference);
class list<GraphicWindow *>::const_iterator : public bidirectional_iterator<GraphicWindow *,int>
{ // packed(0x4 bytes) TI: 0x1ed5
protected:
	/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
public:
	void const_iterator(const /*packed*/ class list<GraphicWindow *>::iterator&);
	void const_iterator();
protected:
	void const_iterator(/*packed*/ struct list<GraphicWindow *>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<GraphicWindow *>::const_iterator&);
	const /*unpacked*/ class GraphicWindow*& operator*();
	/*packed*/ class list<GraphicWindow *>::const_iterator operator++(int32_t);
	/*packed*/ class list<GraphicWindow *>::const_iterator& operator++();
	/*packed*/ class list<GraphicWindow *>::const_iterator operator--(int32_t);
	/*packed*/ class list<GraphicWindow *>::const_iterator& operator--();
};

// Type: /*packed*/ class list<GraphicWindow *>::const_iterator;
class list<GraphicWindow *>::const_iterator : public bidirectional_iterator<GraphicWindow *,int>
{ // packed(0x4 bytes) TI: 0x1ed5
protected:
	/*+0x0*/   /*packed*/ struct list<GraphicWindow *>::list_node *node;
public:
	void const_iterator(const /*packed*/ class list<GraphicWindow *>::iterator&);
	void const_iterator();
protected:
	void const_iterator(/*packed*/ struct list<GraphicWindow *>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<GraphicWindow *>::const_iterator&);
	const /*unpacked*/ class GraphicWindow*& operator*();
	/*packed*/ class list<GraphicWindow *>::const_iterator operator++(int32_t);
	/*packed*/ class list<GraphicWindow *>::const_iterator& operator++();
	/*packed*/ class list<GraphicWindow *>::const_iterator operator--(int32_t);
	/*packed*/ class list<GraphicWindow *>::const_iterator& operator--();
};

// Type: /*packed*/ struct bidirectional_iterator<GraphicWindow *,int>;
struct bidirectional_iterator<GraphicWindow *,int>{ // packed(0x1 bytes) TI: 0x1dad
};

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};



// Contribution: 1:0009fa00-000a6b52 Module: 9, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x004a0a00
static void $E48() {

	$E44();
	$E47();
	__asm        jmp    __RETURN;
__RETURN:
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x004a0a1a
static void $E44() {

	__asm        mov    GraphicWindow::listModalWindows.length, 0;
	__asm        inc    list<GraphicWindow *>::number_of_lists;
	__asm        mov    eax, list<GraphicWindow *>::free_list;
	__asm        mov    [ebp-4], eax;
	__asm        cmp    list<GraphicWindow *>::free_list, 0;
	__asm        je     _T45;

	__asm        mov    eax, list<GraphicWindow *>::free_list;
	__asm        mov    eax, [eax];
	__asm        mov    list<GraphicWindow *>::free_list, eax;
	__asm        mov    eax, [ebp-4];
	__asm        mov    [ebp-0x50], eax;
	__asm        jmp    _T222;
_T45:
