// Module: Hotspot.obj
// Source: C:\Copter\source\sparkal\Hotspot.cpp
// autogenerated by simcopter_tool from PDB file

// Type: void;

// Type: /*packed*/ class HotSpot (forward reference);
class HotSpot{ // packed(0x14 bytes) TI: 0x1e12
public:
	void HotSpot(long, /*packed*/ struct SparkalRect&);
	void HotSpot(/*packed*/ struct HotSpotResourceRecord*);
	void HotSpot(long, long, long, long[2]*);
	void HotSpot(const /*packed*/ class HotSpot&);
	void HotSpot();
	/*packed*/ class HotSpot& operator=(const /*packed*/ class HotSpot&);
	int32_t IsPointInHotspot(long, long);
	void GetBoundingRect(/*packed*/ class MRect&);
	/*+0x0*/   long lID;
	/*+0x4*/   long lType;
protected:
	int32_t PointInRect(long, long);
	int32_t PointInCircle(long, long);
	int32_t PointInPolygon(long, long);
	/*+0x8*/   /*packed*/ class vector<MPoint> pointArray; // 0xc bytes
};

// Type: long;

// Type: int32_t;

// Type: /*packed*/ struct HotSpotResourceRecord (forward reference);
struct HotSpotResourceRecord{ // packed(0x18 bytes) TI: 0x13c2
	/*+0x0*/   long lGroup;
	/*+0x4*/   long lID;
	/*+0x8*/   long lType;
	/*+0xc*/   long lCount;
	/*+0x10*/  long lCoordinates[1][2]; // 0x8 bytes
};

// Type: /*packed*/ struct SparkalRect (forward reference);
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ class MRect (forward reference);
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: /*packed*/ class list<HotSpot> (forward reference);
class list<HotSpot>{ // packed(0x8 bytes) TI: 0x121e
	using void_pointer = void * __ptr32;
	struct list<HotSpot>::list_node{ // packed(0x1c bytes) TI: 0x1244
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*packed*/ class HotSpot data; // 0x14 bytes
	};
protected:
	static /*packed*/ class allocator<list<HotSpot>::list_node> list_node_allocator;
	static /*packed*/ class allocator<HotSpot> value_allocator;
	using value_type = /*packed*/ class HotSpot;
	using value_allocator_type = /*packed*/ class allocator<HotSpot>;
	using pointer = /*packed*/ class HotSpot*;
	using reference = /*packed*/ class HotSpot&;
	using const_reference = const /*packed*/ class HotSpot&;
	using list_node_allocator_type = /*packed*/ class allocator<list<HotSpot>::list_node>;
	using link_type = /*packed*/ struct list<HotSpot>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<HotSpot>::list_node_buffer{ // packed(0x8 bytes) TI: 0x1242
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<HotSpot>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<HotSpot>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<HotSpot>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<HotSpot>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<HotSpot>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<HotSpot>::list_node *free_list;
	static /*packed*/ struct list<HotSpot>::list_node *next_avail;
	static /*packed*/ struct list<HotSpot>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<HotSpot>::list_node* get_node();
	void put_node(/*packed*/ struct list<HotSpot>::list_node*);
	/*+0x0*/   /*packed*/ struct list<HotSpot>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<HotSpot>::iterator : public bidirectional_iterator<HotSpot,int>
	{ // packed(0x4 bytes) TI: 0x1240
	protected:
		/*+0x0*/   /*packed*/ struct list<HotSpot>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<HotSpot>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<HotSpot>::iterator&);
		/*packed*/ class HotSpot& operator*();
		/*packed*/ class list<HotSpot>::iterator operator++(int32_t);
		/*packed*/ class list<HotSpot>::iterator& operator++();
		/*packed*/ class list<HotSpot>::iterator operator--(int32_t);
		/*packed*/ class list<HotSpot>::iterator& operator--();
	};
	class list<HotSpot>::const_iterator : public bidirectional_iterator<HotSpot,int>
	{ // packed(0x4 bytes) TI: 0x1233
	protected:
		/*+0x0*/   /*packed*/ struct list<HotSpot>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<HotSpot>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<HotSpot>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<HotSpot>::const_iterator&);
		const /*packed*/ class HotSpot& operator*();
		/*packed*/ class list<HotSpot>::const_iterator operator++(int32_t);
		/*packed*/ class list<HotSpot>::const_iterator& operator++();
		/*packed*/ class list<HotSpot>::const_iterator operator--(int32_t);
		/*packed*/ class list<HotSpot>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<HotSpot>::const_iterator,HotSpot,HotSpot const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<HotSpot>::iterator,HotSpot,HotSpot &,int>;
public:
	void list<HotSpot>(const /*packed*/ class list<HotSpot>&);
	void list<HotSpot>(const /*packed*/ class HotSpot*, const /*packed*/ class HotSpot*);
	void list<HotSpot>(uint32_t, const /*packed*/ class HotSpot&);
	void list<HotSpot>();
	/*packed*/ class list<HotSpot>::const_iterator begin();
	/*packed*/ class list<HotSpot>::iterator begin();
	/*packed*/ class list<HotSpot>::const_iterator end();
	/*packed*/ class list<HotSpot>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<HotSpot>::const_iterator,HotSpot,HotSpot const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<HotSpot>::iterator,HotSpot,HotSpot &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<HotSpot>::const_iterator,HotSpot,HotSpot const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<HotSpot>::iterator,HotSpot,HotSpot &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*packed*/ class HotSpot& front();
	/*packed*/ class HotSpot& front();
	const /*packed*/ class HotSpot& back();
	/*packed*/ class HotSpot& back();
	void swap(/*packed*/ class list<HotSpot>&);
	void insert(/*packed*/ class list<HotSpot>::iterator, uint32_t, const /*packed*/ class HotSpot&);
	void insert(/*packed*/ class list<HotSpot>::iterator, /*packed*/ class list<HotSpot>::const_iterator, /*packed*/ class list<HotSpot>::const_iterator);
	void insert(/*packed*/ class list<HotSpot>::iterator, const /*packed*/ class HotSpot*, const /*packed*/ class HotSpot*);
	/*packed*/ class list<HotSpot>::iterator insert(/*packed*/ class list<HotSpot>::iterator, const /*packed*/ class HotSpot&);
	void push_front(const /*packed*/ class HotSpot&);
	void push_back(const /*packed*/ class HotSpot&);
	void erase(/*packed*/ class list<HotSpot>::iterator, /*packed*/ class list<HotSpot>::iterator);
	void erase(/*packed*/ class list<HotSpot>::iterator);
	void pop_front();
	void pop_back();
	void ~list<HotSpot>();
	/*packed*/ class list<HotSpot>& operator=(const /*packed*/ class list<HotSpot>&);
protected:
	void transfer(/*packed*/ class list<HotSpot>::iterator, /*packed*/ class list<HotSpot>::iterator, /*packed*/ class list<HotSpot>::iterator);
public:
	void splice(/*packed*/ class list<HotSpot>::iterator, /*packed*/ class list<HotSpot>&, /*packed*/ class list<HotSpot>::iterator, /*packed*/ class list<HotSpot>::iterator);
	void splice(/*packed*/ class list<HotSpot>::iterator, /*packed*/ class list<HotSpot>&, /*packed*/ class list<HotSpot>::iterator);
	void splice(/*packed*/ class list<HotSpot>::iterator, /*packed*/ class list<HotSpot>&);
	void remove(const /*packed*/ class HotSpot&);
	void unique();
	void merge(/*packed*/ class list<HotSpot>&);
	void reverse();
	void sort();
};

// Type: char *;

// Type: /*packed*/ struct HotSpotResourceFileHeader (forward reference);
struct HotSpotResourceFileHeader{ // packed(0x10 bytes) TI: 0x211c
	/*+0x0*/   long lType;
	/*+0x4*/   long lGroupCount;
	/*+0x8*/   long lLittleEndian;
	/*+0xc*/   long lRecordCount;
};

// Type: /*packed*/ class ResourceRCData;
// VTABLE: COPTER_D 0x0058f648
class ResourceRCData{ // packed(0x1c bytes) TI: 0x2113
public:
	void ResourceRCData(/*packed*/ class ResourceRCData&);
	void ResourceRCData(int32_t, int32_t);
	void ResourceRCData();
	void ~ResourceRCData();
	/*packed*/ class ResourceRCData& operator=(/*packed*/ class ResourceRCData&);
	virtual void Reset(); // vtable+0x0
	virtual int32_t ReadResource(); // vtable+0x4
	unsigned long DataSize();
	char * DataReference();
protected:
	/*+0x4*/   int32_t nResource;
	/*+0x8*/   char * chData;
	/*+0xc*/   int32_t bWeOwnTheData;
	/*+0x10*/  void * __ptr32 hFoundResource;
	/*+0x14*/  void * __ptr32 hInstance;
	/*+0x18*/  void * __ptr32 hResource;
};

// Type: /*packed*/ class MPoint (forward reference);
class MPoint : public SparkalPoint
{ // packed(0x8 bytes) TI: 0x159a
public:
	void MPoint(unsigned long);
	void MPoint(/*packed*/ struct SparkalSize);
	void MPoint(/*packed*/ struct SparkalPoint);
	void MPoint(long, long);
	void MPoint();
	void Offset(/*packed*/ struct SparkalSize);
	void Offset(/*packed*/ struct SparkalPoint);
	void Offset(long, long);
	int32_t operator==(/*packed*/ struct SparkalPoint);
	int32_t operator!=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(const /*packed*/ struct SparkalRect*);
	/*packed*/ class MSize operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MPoint operator-();
	/*packed*/ class MPoint operator-(/*packed*/ struct SparkalSize);
};

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ struct SparkalPoint;
struct SparkalPoint{ // packed(0x8 bytes) TI: 0x1a54
	/*+0x0*/   long x;
	/*+0x4*/   long y;
	void SparkalPoint(long, long);
	void SparkalPoint();
};



// Contribution: 1:000b8040-000ba946 Module: 4, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004b9040
void HotSpot::HotSpot() {

	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+4], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+8], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+0xC], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+0x10], 0;
	__asm        jmp    _T42;
// LINE 26:
_T42:
	return;

	__asm        mov    eax, this;
}

// FUNCTION: COPTER_D 0x004b908f
void HotSpot::HotSpot(const /*packed*/ class HotSpot& newHotSpot) {

	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+8], 0;
	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax+0xC], 0;
	__asm        mov    eax, this;
