// Module: Mdate.obj
// Source: C:\Copter\source\sparkal\Mdate.cpp
// autogenerated by simcopter_tool from PDB file

// Type: unsigned char;

// Type: uint32_t;

// Type: char *;

// Type: /*packed*/ class MDate (forward reference);
// VTABLE: COPTER_D 0x0058f3e8
class MDate{ // packed(0xc bytes) TI: 0x284c
	enum HowToPrint {
		Normal = 0,
		Terse = 1,
		Numbers = 2,
		EuropeanNumbers = 3,
		European = 4,
	};
protected:
	void MDate(unsigned long);
public:
	void MDate(const /*unpacked*/ class MTime&);
	void MDate(/*unpacked*/ class istream&);
	void MDate(uint32_t, uint32_t, uint32_t);
	void MDate(uint32_t, char *, uint32_t);
	void MDate(uint32_t, uint32_t);
	void MDate();
	virtual char * PrintString(char *); // vtable+0x0
	int32_t Between(const /*packed*/ class MDate&, const /*packed*/ class MDate&);
	int32_t CompareTo(const /*packed*/ class MDate&);
	uint32_t Day();
	uint32_t DayOfMonth();
	uint32_t FirstDayOfMonth(uint32_t);
	uint32_t FirstDayOfMonth();
	uint32_t Hash();
	int32_t IsValid();
	int32_t Leap();
	/*packed*/ class MDate MaxDate(const /*packed*/ class MDate&);
	/*packed*/ class MDate MinDate(const /*packed*/ class MDate&);
	uint32_t Month();
	char * NameOfDay();
	char * NameOfMonth();
	/*packed*/ class MDate Previous(uint32_t);
	virtual /*packed*/ class MDate Previous(char *); // vtable+0x4
	uint32_t WeekDay();
	uint32_t Year();
	uint32_t YearLastTwoDigits();
	enum MDate::HowToPrint SetPrintOption(enum MDate::HowToPrint);
	int32_t operator<(const /*packed*/ class MDate&);
	int32_t operator<=(const /*packed*/ class MDate&);
	int32_t operator>(const /*packed*/ class MDate&);
	int32_t operator>=(const /*packed*/ class MDate&);
	int32_t operator==(const /*packed*/ class MDate&);
	int32_t operator!=(const /*packed*/ class MDate&);
	unsigned long operator-(const /*packed*/ class MDate&);
	void operator++();
	void operator--();
	void operator+=(int32_t);
	void operator-=(int32_t);
	// calltype: NearC
	static char * DayName(uint32_t);
	// calltype: NearC
	static uint32_t DayOfWeek(char *);
	// calltype: NearC
	static int32_t DayWithinMonth(uint32_t, uint32_t, uint32_t);
	// calltype: NearC
	static uint32_t DaysInYear(uint32_t);
	// calltype: NearC
	static uint32_t IndexOfMonth(char *);
	// calltype: NearC
	static unsigned long Jday(uint32_t, uint32_t, uint32_t);
	// calltype: NearC
	static int32_t LeapYear(uint32_t);
	// calltype: NearC
	static char * MonthName(uint32_t);
protected:
	// calltype: NearC
	static int32_t AssertWeekDayNumber(uint32_t);
	// calltype: NearC
	static int32_t AssertIndexOfMonth(uint32_t);
	void ParseFrom(/*unpacked*/ class istream&);
	void Mdy(uint32_t&, uint32_t&, uint32_t&);
	/*+0x4*/   unsigned long Julnum;
	/*+0x8*/   enum MDate::HowToPrint PrintOption;
};

// Type: /*packed*/ struct tm (forward reference);
struct tm{ // packed(0x24 bytes) TI: 0x2033
	/*+0x0*/   int32_t tm_sec;
	/*+0x4*/   int32_t tm_min;
	/*+0x8*/   int32_t tm_hour;
	/*+0xc*/   int32_t tm_mday;
	/*+0x10*/  int32_t tm_mon;
	/*+0x14*/  int32_t tm_year;
	/*+0x18*/  int32_t tm_wday;
	/*+0x1c*/  int32_t tm_yday;
	/*+0x20*/  int32_t tm_isdst;
};

// Type: long;

// Type: void;

// Type: enum MDate::HowToPrint;
enum HowToPrint {
	Normal = 0,
	Terse = 1,
	Numbers = 2,
	EuropeanNumbers = 3,
	European = 4,
};

// Type: int32_t;

// Type: unsigned long;

// Type: /*unpacked*/ class ostrstream;
// VTABLE: COPTER_D 0x00593b34
class ostrstream : public ostream, public virtual <indirect> ios
{ // not packed(0x58 bytes) TI: 0x1fc2
public:
	<NoType> ios;
	void ostrstream(char *, int32_t, int32_t);
	void ostrstream();
	virtual void ~ostrstream() /* override */;
	int32_t pcount();
	/*unpacked*/ class strstreambuf* rdbuf();
	char * str();
};

// Type: /*unpacked*/ class istream (forward reference);
// istream Class implementation not found

// Type: char;

// Type: /*unpacked*/ class ostream (forward reference);
// ostream Class implementation not found

// Type: /*unpacked*/ class ios;
// VTABLE: COPTER_D 0x00593ad4
class ios{ // not packed(0x50 bytes) TI: 0x4126
	enum io_state {
		goodbit = 0,
		eofbit = 1,
		failbit = 2,
		badbit = 4,
	};
	enum open_mode {
		in = 1,
		out = 2,
		ate = 4,
		app = 8,
		trunc = 16,
		nocreate = 32,
		noreplace = 64,
		binary = 128,
	};
	enum seek_dir {
		beg = 0,
		cur = 1,
		end = 2,
	};
	enum /* __unnamed */ {
		skipws = 1,
		left = 2,
		right = 4,
		internal = 8,
		dec = 16,
		oct = 32,
		hex = 64,
		showbase = 128,
		showpoint = 256,
		uppercase = 512,
		showpos = 1024,
		scientific = 2048,
		fixed = 4096,
		unitbuf = 8192,
		stdio = 16384,
	};
public:
	static const long basefield;
	static const long adjustfield;
	static const long floatfield;
	void ios(const /*unpacked*/ class ios&);
	void ios();
	void ios(/*unpacked*/ class streambuf*);
	virtual void ~ios(); // vtable+0x0
	long flags(long);
	long flags();
	long setf(long);
	long setf(long, long);
	long unsetf(long);
	int32_t width(int32_t);
	int32_t width();
	/*unpacked*/ class ostream* tie();
	/*unpacked*/ class ostream* tie(/*unpacked*/ class ostream*);
	char fill(char);
	char fill();
	int32_t precision();
	int32_t precision(int32_t);
	int32_t rdstate();
	void clear(int32_t);
	void * __ptr32 operator void *();
	int32_t operator!();
	int32_t good();
	int32_t eof();
	int32_t fail();
	int32_t bad();
	/*unpacked*/ class streambuf* rdbuf();
	long& iword(int32_t);
	void * __ptr32& pword(int32_t);
	// calltype: NearC
	static long bitalloc();
	// calltype: NearC
	static int32_t xalloc();
	// calltype: NearC
	static void sync_with_stdio();
	// calltype: NearC
	void setlock();
	// calltype: NearC
	void clrlock();
	// calltype: NearC
	void lock();
	// calltype: NearC
	void unlock();
	// calltype: NearC
	void lockbuf();
	// calltype: NearC
	void unlockbuf();
protected:
	/*unpacked*/ class ios& operator=(const /*unpacked*/ class ios&);
	void init(/*unpacked*/ class streambuf*);
	enum /* __unnamed */ {
		skipping = 0,
		tied = 1,
	};
protected:
	/*+0x4*/   /*unpacked*/ class streambuf *bp;
	/*+0x8*/   int32_t state;
	/*+0xc*/   int32_t ispecial;
	/*+0x10*/  int32_t ospecial;
	/*+0x14*/  int32_t isfx_special;
	/*+0x18*/  int32_t osfx_special;
	/*+0x1c*/  int32_t x_delbuf;
	/*+0x20*/  /*unpacked*/ class ostream *x_tie;
	/*+0x24*/  long x_flags;
	/*+0x28*/  int32_t x_precision;
	/*+0x2c*/  char x_fill; // 0x1 bytes
	/*+0x30*/  int32_t x_width;
	static void (*stdioflush)();
	// calltype: NearC
	static void lockc();
	// calltype: NearC
	static void unlockc();
	/*unpacked*/ struct _CRT_CRITICAL_SECTION* lockptr();
public:
	void delbuf(int32_t);
	int32_t delbuf();
private:
	static long x_maxbit;
	static int32_t x_curindex;
	static int32_t sunk_with_stdio;
	static long x_statebuf[8];
	static int32_t fLockcInit;
	static /*unpacked*/ struct _CRT_CRITICAL_SECTION x_lockc;
	/*+0x34*/  int32_t LockFlg;
	/*+0x38*/  /*unpacked*/ struct _CRT_CRITICAL_SECTION x_lock; // 0x18 bytes
};



// Contribution: 1:000bb460-000bc660 Module: 2, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004bc460
void MDate::MDate() {
	/*bp-0x4*/   long clk;
	/*bp-0x8*/   /*packed*/ struct tm *now;


	this->PrintOption = 0x0;
	this-><vftable> = 0x58f3e8;
// LINE 76:
	clk = time(0x0);
// LINE 77:
	now = localtime(clk);
// LINE 78:
	__asm        mov    eax, now;
	__asm        mov    eax, [eax+0x14];
	__asm        add    eax, 0x76C;
	__asm        push   eax;
	__asm        mov    eax, now;
	__asm        mov    eax, [eax+0xC];
	__asm        push   eax;
	__asm        mov    eax, now;
	__asm        mov    eax, [eax+0x10];
	__asm        inc    eax;
	__asm        push   eax;
	__asm        call   MDate::Jday;
	__asm        add    esp, 0xC;
	__asm        mov    ecx, this;
	__asm        mov    [ecx+4], eax;
// LINE 79:
	return;

	__asm        mov    eax, this;
}

