// Module: Miff.obj
// Source: C:\Copter\source\sparkal\Miff.cpp
// autogenerated by simcopter_tool from PDB file

// Type: void * __ptr32;

// Type: long;

// Type: char *;

// Type: int32_t;

// Type: /*packed*/ class MIFF (forward reference);
// VTABLE: COPTER_D 0x00591950
class MIFF : public PFile
{ // packed(0x148 bytes) TI: 0x428e
public:
	void MIFF(char *);
	void MIFF();
	virtual void ~MIFF() /* override */;
	virtual long OpenForReading(); // vtable+0x4
	virtual long OpenForWriting(long, long, long); // vtable+0x8
	virtual long OpenForAppending(); // vtable+0xc
	virtual long Close(); // vtable+0x10
	virtual long GetPresentRecordType(); // vtable+0x14
	virtual long GetPresentRecordSize(); // vtable+0x18
	virtual long GetPresentRecordDataSize(); // vtable+0x1c
	virtual long GetPresentRecordIndex(); // vtable+0x20
	virtual long VerifyFile(); // vtable+0x24
	virtual long ReadMIFFHeader(); // vtable+0x28
	virtual long ReadRecordHeader(); // vtable+0x2c
	virtual long ReadFileCreator(); // vtable+0x30
	virtual long ReadFileType(); // vtable+0x34
	virtual long ReadFileVersion(); // vtable+0x38
	virtual long ReadPresentRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x3c
	virtual long ReadPresentRecordData(char *, long); // vtable+0x40
	virtual long GoToFirstRecord(); // vtable+0x44
	virtual long GoToNextRecord(); // vtable+0x48
	virtual long GoToPreviousRecord(); // vtable+0x4c
	virtual long GoToFirstRecordOfGivenType(long); // vtable+0x50
	virtual long GoToNextRecordOfGivenType(long); // vtable+0x54
	virtual long GoToNthRecord(long); // vtable+0x58
	virtual long CountRecords(); // vtable+0x5c
	virtual long WriteMIFFRecord(/*packed*/ struct MIFFRecord*, long); // vtable+0x60
	virtual long WriteDataRecord(long, char *, long); // vtable+0x64
	virtual long WriteFileHeader(long, long, long); // vtable+0x68
	virtual long WriteEnd(); // vtable+0x6c
	/*+0x110*/ long lPresentRecordStart;
	/*+0x114*/ long lPresentRecordType;
	/*+0x118*/ long lPresentRecordLength;
	/*+0x11c*/ long lPresentRecordIndex;
	/*+0x120*/ long lReadWriteMode;
	/*+0x124*/ long bFileEndWritten;
	/*+0x128*/ long bFileAppearsCorrupt;
	/*+0x12c*/ /*packed*/ struct MIFFHeader myMIFFHeader; // 0x1c bytes
};

// Type: void;

// Type: /*packed*/ struct MIFFRecord (forward reference);
struct MIFFRecord{ // packed(0xc bytes) TI: 0x148f
	/*+0x0*/   long lRecordType;
	/*+0x4*/   long lRecordLength;
	/*+0x8*/   char chRecordData[4];
};

// Type: uint32_t;

// Type: /*packed*/ class PFile;
// VTABLE: COPTER_D 0x00590468
class PFile{ // packed(0x110 bytes) TI: 0x453c
	enum /* __unnamed */ {
		FileNull = -1,
	};
	enum SeekTypes {
		N_SEEK_FROM_FILE_START = 0,
		N_SEEK_FROM_FILE_CURRENT = 1,
		N_SEEK_FROM_FILE_END = 2,
	};
	enum AccessTypes {
		ReadOnly = 0,
		ReadWrite = 2,
		WriteOnly = 1,
		Create = 768,
		CreateExcl = 1280,
		Append = 8,
		Binary = 32768,
		Compat = 0,
		DenyNone = 64,
		DenyRead = 48,
		DenyWrite = 32,
		DenyRdWr = 16,
		NoInherit = 128,
	};
	enum PermissionTypes {
		PermRead = 256,
		PermWrite = 128,
		PermRdWr = 384,
	};
	enum seek_dir {
		beg = 0,
		cur = 1,
		end = 2,
	};
public:
	void PFile(char *);
	void PFile(const /*packed*/ class PFile&);
	void PFile(int32_t);
	void PFile();
	virtual void ~PFile(); // vtable+0x0
	int32_t Open(char *, unsigned short, unsigned short, int32_t);
	int32_t Close();
	int32_t GetHandle();
	long Position();
	void Length(long);
	long Length();
	long Seek(long, int32_t);
	long SeekToBegin();
	long SeekToEnd();
	int32_t IsOpen();
	int32_t Read(void * __ptr32, int32_t);
	int32_t Write(void * __ptr32, int32_t);
	void Flush();
	// calltype: NearC
	static void Remove(char *);
	// calltype: NearC
	static void Rename(char *, char *);
	// calltype: NearC
	static unsigned long Checksum(char *);
	long SetPath(char *);
	long FileCreate(char *, int32_t);
	long FileExists(char *);
	/*+0x4*/   char szFilePath[260]; // 0x104 bytes
	/*+0x108*/ int32_t Handle;
private:
	/*+0x10c*/ int32_t ShouldClose;
};



// Contribution: 1:000aa530-000ab9b5 Module: 6, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004ab530
int32_t ReadFirstMIFFChunk(void * __ptr32 miffReader, long lDataType, char * ptrData, long lDataLength) {
// LINE 18:
	__asm        mov    eax, miffReader;
	__asm        mov    eax, [eax];
	__asm        mov    ecx, miffReader;
	__asm        call   dword ptr [eax+0x44];
// LINE 19:
	__asm        mov    eax, lDataType;
	__asm        push   eax;
	__asm        mov    eax, miffReader;
	__asm        mov    eax, [eax];
	__asm        mov    ecx, miffReader;
	__asm        call   dword ptr [eax+0x54];
	__asm        test   eax, eax;
	__asm        jne    _T2f;
// LINE 20:
	return 0x0;
// LINE 21:
_T2f:
	__asm        mov    eax, lDataLength;
	__asm        push   eax;
	__asm        mov    eax, ptrData;
	__asm        push   eax;
	__asm        mov    eax, miffReader;
	__asm        mov    eax, [eax];
	__asm        mov    ecx, miffReader;
