// Module: palhelp.obj
// Source: C:\Copter\source\sparkal\palhelp.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class SparkalPalette (forward reference);
// VTABLE: COPTER_D 0x005910f8
class SparkalPalette{ // packed(0x10 bytes) TI: 0x47c7
public:
	/*+0x4*/   /*packed*/ struct SparkalColor *pColors;
	/*+0x8*/   long lColors;
	/*+0xc*/   int32_t bOwnColors;
	void SparkalPalette(/*packed*/ struct SparkalColor*, int32_t, unsigned long);
	void SparkalPalette();
	virtual void ~SparkalPalette(); // vtable+0x0
	virtual void GetRGBValue(int32_t, /*packed*/ struct SparkalColor&); // vtable+0x4
	virtual void GetNearestIndex(/*packed*/ struct SparkalColor&, int32_t&); // vtable+0x8
	virtual void FadeToWhite(long); // vtable+0xc
	virtual void FadeToBlack(long); // vtable+0x10
	virtual void FadeToPalette(/*packed*/ struct SparkalColor, long, long); // vtable+0x14
	// calltype: NearC
	static void FadeToPalette(/*packed*/ struct SparkalColor, /*packed*/ struct SparkalColor*, long, long);
	void FadeToRGB(/*packed*/ struct SparkalColor&, long);
	// calltype: NearC
	static void SetSystemPaletteEntriesToRGB(/*packed*/ struct SparkalColor&);
	virtual void ImplementNewPalette(/*packed*/ struct SparkalColor*); // vtable+0x18
};

// Type: /*packed*/ struct SparkalColor (forward reference);
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: int32_t;

// Type: unsigned long;

// Type: void;

// Type: long;

// Type: /*packed*/ class MTimer;
class MTimer{ // packed(0x10 bytes) TI: 0x1968
	enum TimerResolution {
		nTimerResolutionMicroseconds = 0,
		nTimerResolutionMilliseconds = 1,
		nTimerResolutionSeconds = 2,
	};
public:
	void MTimer(enum MTimer::TimerResolution);
	void ~MTimer();
	void SetResolution(enum MTimer::TimerResolution);
	enum MTimer::TimerResolution GetResolution();
	void Start();
	void Stop();
	void Reset();
	void Restart();
	unsigned long GetElapsedTime();
	int32_t IsTimerRunning();
	unsigned long GetTickCount();
protected:
	/*+0x0*/   enum MTimer::TimerResolution nTimerResolution;
	/*+0x4*/   unsigned long lStartTime;
	/*+0x8*/   unsigned long lTotalElapsedTime;
	unsigned long GetWindowsTimerFrequency();
	/*+0xc*/   unsigned long lFrequency;
};

// Type: /*packed*/ struct tagPALETTEENTRY (forward reference);
struct tagPALETTEENTRY{ // packed(0x4 bytes) TI: 0x1be6
	/*+0x0*/   unsigned char peRed; // 0x1 bytes
	/*+0x1*/   unsigned char peGreen; // 0x1 bytes
	/*+0x2*/   unsigned char peBlue; // 0x1 bytes
	/*+0x3*/   unsigned char peFlags; // 0x1 bytes
};

// Type: /*packed*/ struct SparkalColor;
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: /*packed*/ struct SparkalPalette::FadeToPalette::TempPalette (forward reference);
struct SparkalPalette::FadeToPalette::TempPalette{ // packed(0x400 bytes) TI: 0x47cb
	/*+0x0*/   /*packed*/ struct tagPALETTEENTRY palEntries[256]; // 0x400 bytes
};

// Type: /*packed*/ class CopterSparkalPalette (forward reference);
// VTABLE: COPTER_D 0x00591118
class CopterSparkalPalette : public SparkalPalette
{ // packed(0x10 bytes) TI: 0x47ce
public:
	void CopterSparkalPalette(/*packed*/ struct SparkalColor*, int32_t);
	void CopterSparkalPalette();
	int32_t GetNextDarkerColorIndex(int32_t);
	int32_t GetNextLighterColorIndex(int32_t);
	virtual void ~CopterSparkalPalette() /* override */; // synthetic
};

// Type: void * __ptr32;

// Type: /*packed*/ struct ClearWindowsSystemPalette::__unnamed;
struct ClearWindowsSystemPalette::__unnamed{ // packed(0x404 bytes) TI: 0x2314
	/*+0x0*/   unsigned short Version; // 0x2 bytes
	/*+0x2*/   unsigned short NumberOfEntries; // 0x2 bytes
	/*+0x4*/   /*packed*/ struct tagPALETTEENTRY aEntries[256]; // 0x400 bytes
};

// Type: uint32_t;

// Type: /*packed*/ class SparkalPalette;
// VTABLE: COPTER_D 0x005910f8
class SparkalPalette{ // packed(0x10 bytes) TI: 0x47c7
public:
	/*+0x4*/   /*packed*/ struct SparkalColor *pColors;
	/*+0x8*/   long lColors;
	/*+0xc*/   int32_t bOwnColors;
	void SparkalPalette(/*packed*/ struct SparkalColor*, int32_t, unsigned long);
	void SparkalPalette();
	virtual void ~SparkalPalette(); // vtable+0x0
	virtual void GetRGBValue(int32_t, /*packed*/ struct SparkalColor&); // vtable+0x4
	virtual void GetNearestIndex(/*packed*/ struct SparkalColor&, int32_t&); // vtable+0x8
	virtual void FadeToWhite(long); // vtable+0xc
	virtual void FadeToBlack(long); // vtable+0x10
	virtual void FadeToPalette(/*packed*/ struct SparkalColor, long, long); // vtable+0x14
	// calltype: NearC
	static void FadeToPalette(/*packed*/ struct SparkalColor, /*packed*/ struct SparkalColor*, long, long);
	void FadeToRGB(/*packed*/ struct SparkalColor&, long);
	// calltype: NearC
	static void SetSystemPaletteEntriesToRGB(/*packed*/ struct SparkalColor&);
	virtual void ImplementNewPalette(/*packed*/ struct SparkalColor*); // vtable+0x18
};



// Contribution: 1:000953b0-00096b4b Module: 18, 16 byte alignment, code, execute, read, 
