// Module: Prefsmgr.obj
// Source: C:\Copter\source\sparkal\Prefsmgr.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct list<NotificationItem>::list_node_buffer (forward reference);
struct list<NotificationItem>::list_node_buffer{ // packed(0x8 bytes) TI: 0x26b1
	/*+0x0*/   void * __ptr32 next_buffer;
	/*+0x4*/   /*packed*/ struct list<NotificationItem>::list_node *buffer;
};

// Type: /*packed*/ struct list<NotificationItem>::list_node (forward reference);
struct list<NotificationItem>::list_node{ // packed(0x10 bytes) TI: 0x26b3
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*packed*/ class NotificationItem data; // 0x8 bytes
};

// Type: uint32_t;

// Type: /*packed*/ struct list<PreferenceItem>::list_node_buffer (forward reference);
struct list<PreferenceItem>::list_node_buffer{ // packed(0x8 bytes) TI: 0x264e
	/*+0x0*/   void * __ptr32 next_buffer;
	/*+0x4*/   /*packed*/ struct list<PreferenceItem>::list_node *buffer;
};

// Type: /*packed*/ struct list<PreferenceItem>::list_node (forward reference);
struct list<PreferenceItem>::list_node{ // packed(0x14 bytes) TI: 0x2650
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*packed*/ class PreferenceItem data; // 0xc bytes
};

// Type: /*packed*/ class PreferenceItem (forward reference);
class PreferenceItem{ // packed(0xc bytes) TI: 0x2577
public:
	void PreferenceItem(const /*packed*/ class PreferenceItem&);
	void PreferenceItem();
	void ~PreferenceItem();
	/*packed*/ class PreferenceItem& operator=(const /*packed*/ class PreferenceItem&);
	int32_t Compare(const /*packed*/ class PreferenceItem&);
	/*packed*/ class PreferenceItem* DuplicatePointer();
	/*+0x0*/   long lPreferenceType;
	/*+0x4*/   long lPreferenceDataLength;
	/*+0x8*/   char * chPreferenceData;
};

// Type: void;

// Type: int32_t;

// Type: /*packed*/ class PreferenceManager (forward reference);
// VTABLE: COPTER_D 0x00590db0
class PreferenceManager{ // packed(0x28 bytes) TI: 0x26c8
protected:
	/*+0x4*/   int32_t bSaveFileAtAllChanges;
	/*+0x8*/   /*packed*/ class list<PreferenceItem> myPreferences; // 0x8 bytes
	/*+0x10*/  /*packed*/ class MIFF *miffPrefsFile;
	/*+0x14*/  long lFileCreator;
	/*+0x18*/  long lFileType;
	/*+0x1c*/  long lFileVersion;
	/*+0x20*/  int32_t bPrefsDirty;
	/*+0x24*/  int32_t bPrefsLocked;
public:
	void PreferenceManager(long, long, long, int32_t);
	int32_t IPreferenceManager(char *);
	virtual void ~PreferenceManager(); // vtable+0x0
	virtual long SaveAllPrefs(); // vtable+0x4
	virtual long LoadAllPrefs(); // vtable+0x8
	virtual long ClearPrefsMemory(); // vtable+0xc
	virtual void EnumeratePrefs(); // vtable+0x10
	virtual /*packed*/ class PreferenceItem* GetPrefPointer(long); // vtable+0x14
	virtual /*packed*/ class PreferenceItem* GetPrefCopy(long); // vtable+0x18
	virtual char * GetPrefDataPointer(long); // vtable+0x1c
	virtual char * GetPrefDataCopy(long); // vtable+0x20
	virtual long GetPrefDataLength(long); // vtable+0x24
	virtual long SetPref(/*packed*/ class PreferenceItem*); // vtable+0x28
	virtual long SetPref(long, char *, long); // vtable+0x2c
	virtual long RemovePref(long); // vtable+0x30
};

// Type: long;

// Type: char *;

// Type: /*packed*/ class list<PreferenceItem>::iterator;
class list<PreferenceItem>::iterator : public bidirectional_iterator<PreferenceItem,int>
{ // packed(0x4 bytes) TI: 0x264c
protected:
	/*+0x0*/   /*packed*/ struct list<PreferenceItem>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<PreferenceItem>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<PreferenceItem>::iterator&);
	/*packed*/ class PreferenceItem& operator*();
	/*packed*/ class list<PreferenceItem>::iterator operator++(int32_t);
	/*packed*/ class list<PreferenceItem>::iterator& operator++();
	/*packed*/ class list<PreferenceItem>::iterator operator--(int32_t);
	/*packed*/ class list<PreferenceItem>::iterator& operator--();
};

// Type: char;

// Type: /*packed*/ class PreferenceItem;
class PreferenceItem{ // packed(0xc bytes) TI: 0x2577
public:
	void PreferenceItem(const /*packed*/ class PreferenceItem&);
	void PreferenceItem();
	void ~PreferenceItem();
	/*packed*/ class PreferenceItem& operator=(const /*packed*/ class PreferenceItem&);
	int32_t Compare(const /*packed*/ class PreferenceItem&);
	/*packed*/ class PreferenceItem* DuplicatePointer();
	/*+0x0*/   long lPreferenceType;
	/*+0x4*/   long lPreferenceDataLength;
	/*+0x8*/   char * chPreferenceData;
};

// Type: /*packed*/ class NotificationPreferenceManager (forward reference);
// VTABLE: COPTER_D 0x00590de8
class NotificationPreferenceManager : public PreferenceManager
{ // packed(0x30 bytes) TI: 0x2539
public:
	/*+0x28*/  /*packed*/ class list<NotificationItem> myNotifications; // 0x8 bytes
	void NotificationPreferenceManager(long, long, long, int32_t);
	virtual long SetPref(/*packed*/ class PreferenceItem*) /* override */;
	virtual long SetPref(long, char *, long) /* override */;
	virtual int32_t AddNotification(/*packed*/ class NotificationItem&); // vtable+0x34
	virtual int32_t AddNotification(long, /*packed*/ class NotificationSink*); // vtable+0x38
	virtual int32_t RemoveNotification(/*packed*/ class NotificationSink*, long); // vtable+0x3c
	virtual void DoNotification(long); // vtable+0x40
};

// Type: /*packed*/ class NotificationSink (forward reference);
// VTABLE: COPTER_D 0x0058f5c8
class NotificationSink{ // packed(0x4 bytes) TI: 0x2ae9
public:
	virtual void DoNotificationChange(long, /*unpacked*/ class PreferenceManager*); // vtable+0x0
};

// Type: /*packed*/ class NotificationItem;
class NotificationItem{ // packed(0x8 bytes) TI: 0x2557
public:
	/*+0x0*/   long lPreferenceType;
	/*+0x4*/   /*packed*/ class NotificationSink *myNotificationSink;
	void NotificationItem(long, /*packed*/ class NotificationSink*);
	void NotificationItem(const /*packed*/ class NotificationItem&);
	void NotificationItem();
	/*packed*/ class NotificationItem& operator=(const /*packed*/ class NotificationItem&);
};

// Type: /*packed*/ class NotificationItem (forward reference);
class NotificationItem{ // packed(0x8 bytes) TI: 0x2557
public:
	/*+0x0*/   long lPreferenceType;
	/*+0x4*/   /*packed*/ class NotificationSink *myNotificationSink;
	void NotificationItem(long, /*packed*/ class NotificationSink*);
	void NotificationItem(const /*packed*/ class NotificationItem&);
	void NotificationItem();
	/*packed*/ class NotificationItem& operator=(const /*packed*/ class NotificationItem&);
};

// Type: /*packed*/ class list<NotificationItem>::iterator;
class list<NotificationItem>::iterator : public bidirectional_iterator<NotificationItem,int>
{ // packed(0x4 bytes) TI: 0x26af
protected:
	/*+0x0*/   /*packed*/ struct list<NotificationItem>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<NotificationItem>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<NotificationItem>::iterator&);
	/*packed*/ class NotificationItem& operator*();
	/*packed*/ class list<NotificationItem>::iterator operator++(int32_t);
	/*packed*/ class list<NotificationItem>::iterator& operator++();
	/*packed*/ class list<NotificationItem>::iterator operator--(int32_t);
	/*packed*/ class list<NotificationItem>::iterator& operator--();
};

// Type: /*packed*/ class list<PreferenceItem> (forward reference);
class list<PreferenceItem>{ // packed(0x8 bytes) TI: 0x262a
	using void_pointer = void * __ptr32;
	struct list<PreferenceItem>::list_node{ // packed(0x14 bytes) TI: 0x2650
		/*+0x0*/   void * __ptr32 next;
		/*+0x4*/   void * __ptr32 prev;
		/*+0x8*/   /*packed*/ class PreferenceItem data; // 0xc bytes
	};
protected:
	static /*packed*/ class allocator<list<PreferenceItem>::list_node> list_node_allocator;
	static /*packed*/ class allocator<PreferenceItem> value_allocator;
	using value_type = /*packed*/ class PreferenceItem;
	using value_allocator_type = /*packed*/ class allocator<PreferenceItem>;
	using pointer = /*packed*/ class PreferenceItem*;
	using reference = /*packed*/ class PreferenceItem&;
	using const_reference = const /*packed*/ class PreferenceItem&;
	using list_node_allocator_type = /*packed*/ class allocator<list<PreferenceItem>::list_node>;
	using link_type = /*packed*/ struct list<PreferenceItem>::list_node*;
	using size_type = uint32_t;
	using difference_type = int32_t;
protected:
	uint32_t buffer_size();
	struct list<PreferenceItem>::list_node_buffer{ // packed(0x8 bytes) TI: 0x264e
		/*+0x0*/   void * __ptr32 next_buffer;
		/*+0x4*/   /*packed*/ struct list<PreferenceItem>::list_node *buffer;
	};
	using buffer_allocator_type = /*packed*/ class allocator<list<PreferenceItem>::list_node_buffer>;
	using buffer_pointer = /*packed*/ struct list<PreferenceItem>::list_node_buffer*;
protected:
	static /*packed*/ class allocator<list<PreferenceItem>::list_node_buffer> buffer_allocator;
	static /*packed*/ struct list<PreferenceItem>::list_node_buffer *buffer_list;
	static /*packed*/ struct list<PreferenceItem>::list_node *free_list;
	static /*packed*/ struct list<PreferenceItem>::list_node *next_avail;
	static /*packed*/ struct list<PreferenceItem>::list_node *last;
	void add_new_buffer();
	static uint32_t number_of_lists;
	void deallocate_buffers();
	/*packed*/ struct list<PreferenceItem>::list_node* get_node();
	void put_node(/*packed*/ struct list<PreferenceItem>::list_node*);
	/*+0x0*/   /*packed*/ struct list<PreferenceItem>::list_node *node;
	/*+0x4*/   uint32_t length;
	class list<PreferenceItem>::iterator : public bidirectional_iterator<PreferenceItem,int>
	{ // packed(0x4 bytes) TI: 0x264c
	protected:
		/*+0x0*/   /*packed*/ struct list<PreferenceItem>::list_node *node;
	public:
		void iterator();
	protected:
		void iterator(/*packed*/ struct list<PreferenceItem>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<PreferenceItem>::iterator&);
		/*packed*/ class PreferenceItem& operator*();
		/*packed*/ class list<PreferenceItem>::iterator operator++(int32_t);
		/*packed*/ class list<PreferenceItem>::iterator& operator++();
		/*packed*/ class list<PreferenceItem>::iterator operator--(int32_t);
		/*packed*/ class list<PreferenceItem>::iterator& operator--();
	};
	class list<PreferenceItem>::const_iterator : public bidirectional_iterator<PreferenceItem,int>
	{ // packed(0x4 bytes) TI: 0x263f
	protected:
		/*+0x0*/   /*packed*/ struct list<PreferenceItem>::list_node *node;
	public:
		void const_iterator(const /*packed*/ class list<PreferenceItem>::iterator&);
		void const_iterator();
	protected:
		void const_iterator(/*packed*/ struct list<PreferenceItem>::list_node*);
	public:
		int32_t operator==(const /*packed*/ class list<PreferenceItem>::const_iterator&);
		const /*packed*/ class PreferenceItem& operator*();
		/*packed*/ class list<PreferenceItem>::const_iterator operator++(int32_t);
		/*packed*/ class list<PreferenceItem>::const_iterator& operator++();
		/*packed*/ class list<PreferenceItem>::const_iterator operator--(int32_t);
		/*packed*/ class list<PreferenceItem>::const_iterator& operator--();
	};
	using const_reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<PreferenceItem>::const_iterator,PreferenceItem,PreferenceItem const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_bidirectional_iterator<list<PreferenceItem>::iterator,PreferenceItem,PreferenceItem &,int>;
public:
	void list<PreferenceItem>(const /*packed*/ class list<PreferenceItem>&);
	void list<PreferenceItem>(const /*packed*/ class PreferenceItem*, const /*packed*/ class PreferenceItem*);
	void list<PreferenceItem>(uint32_t, const /*packed*/ class PreferenceItem&);
	void list<PreferenceItem>();
	/*packed*/ class list<PreferenceItem>::const_iterator begin();
	/*packed*/ class list<PreferenceItem>::iterator begin();
	/*packed*/ class list<PreferenceItem>::const_iterator end();
	/*packed*/ class list<PreferenceItem>::iterator end();
	/*unpacked*/ class reverse_bidirectional_iterator<list<PreferenceItem>::const_iterator,PreferenceItem,PreferenceItem const &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<PreferenceItem>::iterator,PreferenceItem,PreferenceItem &,int> rbegin();
	/*unpacked*/ class reverse_bidirectional_iterator<list<PreferenceItem>::const_iterator,PreferenceItem,PreferenceItem const &,int> rend();
	/*unpacked*/ class reverse_bidirectional_iterator<list<PreferenceItem>::iterator,PreferenceItem,PreferenceItem &,int> rend();
	int32_t empty();
	uint32_t size();
	uint32_t max_size();
	const /*packed*/ class PreferenceItem& front();
	/*packed*/ class PreferenceItem& front();
	const /*packed*/ class PreferenceItem& back();
	/*packed*/ class PreferenceItem& back();
	void swap(/*packed*/ class list<PreferenceItem>&);
	void insert(/*packed*/ class list<PreferenceItem>::iterator, uint32_t, const /*packed*/ class PreferenceItem&);
	void insert(/*packed*/ class list<PreferenceItem>::iterator, /*packed*/ class list<PreferenceItem>::const_iterator, /*packed*/ class list<PreferenceItem>::const_iterator);
	void insert(/*packed*/ class list<PreferenceItem>::iterator, const /*packed*/ class PreferenceItem*, const /*packed*/ class PreferenceItem*);
	/*packed*/ class list<PreferenceItem>::iterator insert(/*packed*/ class list<PreferenceItem>::iterator, const /*packed*/ class PreferenceItem&);
	void push_front(const /*packed*/ class PreferenceItem&);
	void push_back(const /*packed*/ class PreferenceItem&);
	void erase(/*packed*/ class list<PreferenceItem>::iterator, /*packed*/ class list<PreferenceItem>::iterator);
	void erase(/*packed*/ class list<PreferenceItem>::iterator);
	void pop_front();
	void pop_back();
	void ~list<PreferenceItem>();
	/*packed*/ class list<PreferenceItem>& operator=(const /*packed*/ class list<PreferenceItem>&);
protected:
	void transfer(/*packed*/ class list<PreferenceItem>::iterator, /*packed*/ class list<PreferenceItem>::iterator, /*packed*/ class list<PreferenceItem>::iterator);
public:
	void splice(/*packed*/ class list<PreferenceItem>::iterator, /*packed*/ class list<PreferenceItem>&, /*packed*/ class list<PreferenceItem>::iterator, /*packed*/ class list<PreferenceItem>::iterator);
	void splice(/*packed*/ class list<PreferenceItem>::iterator, /*packed*/ class list<PreferenceItem>&, /*packed*/ class list<PreferenceItem>::iterator);
	void splice(/*packed*/ class list<PreferenceItem>::iterator, /*packed*/ class list<PreferenceItem>&);
	void remove(const /*packed*/ class PreferenceItem&);
	void unique();
	void merge(/*packed*/ class list<PreferenceItem>&);
	void reverse();
	void sort();
};

// Type: /*packed*/ class PreferenceManager;
// VTABLE: COPTER_D 0x00590db0
class PreferenceManager{ // packed(0x28 bytes) TI: 0x26c8
protected:
	/*+0x4*/   int32_t bSaveFileAtAllChanges;
	/*+0x8*/   /*packed*/ class list<PreferenceItem> myPreferences; // 0x8 bytes
	/*+0x10*/  /*packed*/ class MIFF *miffPrefsFile;
	/*+0x14*/  long lFileCreator;
	/*+0x18*/  long lFileType;
	/*+0x1c*/  long lFileVersion;
	/*+0x20*/  int32_t bPrefsDirty;
	/*+0x24*/  int32_t bPrefsLocked;
public:
	void PreferenceManager(long, long, long, int32_t);
	int32_t IPreferenceManager(char *);
	virtual void ~PreferenceManager(); // vtable+0x0
	virtual long SaveAllPrefs(); // vtable+0x4
	virtual long LoadAllPrefs(); // vtable+0x8
	virtual long ClearPrefsMemory(); // vtable+0xc
	virtual void EnumeratePrefs(); // vtable+0x10
	virtual /*packed*/ class PreferenceItem* GetPrefPointer(long); // vtable+0x14
	virtual /*packed*/ class PreferenceItem* GetPrefCopy(long); // vtable+0x18
	virtual char * GetPrefDataPointer(long); // vtable+0x1c
	virtual char * GetPrefDataCopy(long); // vtable+0x20
	virtual long GetPrefDataLength(long); // vtable+0x24
	virtual long SetPref(/*packed*/ class PreferenceItem*); // vtable+0x28
	virtual long SetPref(long, char *, long); // vtable+0x2c
	virtual long RemovePref(long); // vtable+0x30
};

// Type: /*packed*/ struct bidirectional_iterator<NotificationItem,int>;
