// Module: S3dsnd.obj
// Source: C:\Copter\source\sparkal\S3dsnd.cpp
// autogenerated by simcopter_tool from PDB file

// Type: long;

// Type: /*packed*/ class SoundChangeNotificationSink;
// VTABLE: COPTER_D 0x0058f5c0
class SoundChangeNotificationSink : public NotificationSink
{ // packed(0x4 bytes) TI: 0x2432
public:
	virtual int32_t Initialize(); // vtable+0x4
	virtual void DoNotificationChange(long, /*packed*/ class PreferenceManager*) /* override */;
};

// Type: /*packed*/ class SoundChangeNotificationSink;
// VTABLE: COPTER_D 0x0058f5c0
class SoundChangeNotificationSink : public NotificationSink
{ // packed(0x4 bytes) TI: 0x2ac5
public:
	virtual int32_t Initialize(); // vtable+0x4
	virtual void DoNotificationChange(long, /*packed*/ class PreferenceManager*) /* override */;
	void SoundChangeNotificationSink(); // synthetic
};

// Type: void ();

// Type: void;

// Type: /*packed*/ class SoundChangeNotificationSink (forward reference);
// VTABLE: COPTER_D 0x0058f5c0
class SoundChangeNotificationSink : public NotificationSink
{ // packed(0x4 bytes) TI: 0x2ac5
public:
	virtual int32_t Initialize(); // vtable+0x4
	virtual void DoNotificationChange(long, /*packed*/ class PreferenceManager*) /* override */;
	void SoundChangeNotificationSink(); // synthetic
};

// Type: int32_t;

// Type: /*packed*/ class PreferenceManager (forward reference);
// VTABLE: COPTER_D 0x00590db0
class PreferenceManager{ // packed(0x28 bytes) TI: 0x26c8
protected:
	/*+0x4*/   int32_t bSaveFileAtAllChanges;
	/*+0x8*/   /*packed*/ class list<PreferenceItem> myPreferences; // 0x8 bytes
	/*+0x10*/  /*packed*/ class MIFF *miffPrefsFile;
	/*+0x14*/  long lFileCreator;
	/*+0x18*/  long lFileType;
	/*+0x1c*/  long lFileVersion;
	/*+0x20*/  int32_t bPrefsDirty;
	/*+0x24*/  int32_t bPrefsLocked;
public:
	void PreferenceManager(long, long, long, int32_t);
	int32_t IPreferenceManager(char *);
	virtual void ~PreferenceManager(); // vtable+0x0
	virtual long SaveAllPrefs(); // vtable+0x4
	virtual long LoadAllPrefs(); // vtable+0x8
	virtual long ClearPrefsMemory(); // vtable+0xc
	virtual void EnumeratePrefs(); // vtable+0x10
	virtual /*packed*/ class PreferenceItem* GetPrefPointer(long); // vtable+0x14
	virtual /*packed*/ class PreferenceItem* GetPrefCopy(long); // vtable+0x18
	virtual char * GetPrefDataPointer(long); // vtable+0x1c
	virtual char * GetPrefDataCopy(long); // vtable+0x20
	virtual long GetPrefDataLength(long); // vtable+0x24
	virtual long SetPref(/*packed*/ class PreferenceItem*); // vtable+0x28
	virtual long SetPref(long, char *, long); // vtable+0x2c
	virtual long RemovePref(long); // vtable+0x30
};

// Type: char *;

// Type: /*packed*/ struct SoundPreferences (forward reference);
struct SoundPreferences{ // packed(0x10 bytes) TI: 0x2845
	/*+0x0*/   long lMasterVolume;
	/*+0x4*/   long lDispatchVolume;
	/*+0x8*/   long lSoundEffectsVolume;
	/*+0xc*/   long lVehicleVolume;
};

// Type: void * __ptr32;

// Type: char;

// Type: /*packed*/ class DigitalSound (forward reference);
// VTABLE: COPTER_D 0x0058f488
class DigitalSound : public Sound
{ // packed(0x7a bytes) TI: 0x45d4
protected:
	/*+0x34*/  int32_t nStreamingType;
	/*+0x38*/  int32_t nCompletionEstimationTimerSet;
	static /*packed*/ struct IDirectSound *lpDirectSound;
	/*+0x3c*/  uint32_t cbSize;
	/*+0x40*/  /*packed*/ struct tWAVEFORMATEX waveFormatEx; // 0x12 bytes
	/*+0x52*/  /*packed*/ struct IDirectSoundBuffer *lpSound[8]; // 0x20 bytes
	/*+0x72*/  /*packed*/ struct _STREAMBUFINFO *lpStreamBufferInfo;
	/*+0x76*/  unsigned long dwDesiredBufferDescFlags;
public:
	void DigitalSound(long);
	void DigitalSound(const /*packed*/ class basic_string<char>&, int32_t);
	void DigitalSound();
	virtual void ~DigitalSound() /* override */;
	/*packed*/ class DigitalSound& operator=(/*packed*/ class DigitalSound&);
	virtual void SetSoundFile(const /*packed*/ class basic_string<char>&, int32_t); // vtable+0x2c
	virtual int32_t Load(); // vtable+0x30
	virtual int32_t LoadFromResource(); // vtable+0x34
	virtual int32_t LoadFromFile(); // vtable+0x38
	virtual void Unload(); // vtable+0x3c
	virtual long Play(long, int32_t) /* override */;
	virtual long Stop() /* override */;
	virtual long ShouldWeStream(); // vtable+0x40
	virtual long PlayStream(); // vtable+0x44
	virtual long StopStream(); // vtable+0x48
protected:
	virtual long IsPlaying(/*packed*/ struct IDirectSoundBuffer**); // vtable+0x4c
public:
	virtual long IsPlaying() /* override */;
	virtual int32_t GetVolume(long *) /* override */;
	virtual int32_t SetVolume(long) /* override */;
	virtual int32_t GetPan(long *); // vtable+0x50
	virtual int32_t SetPan(long); // vtable+0x54
	virtual int32_t SetPosition(long, long, long); // vtable+0x58
	virtual long GetOriginalFrequency(); // vtable+0x5c
	virtual int32_t GetFrequency(long *); // vtable+0x60
	virtual int32_t SetFrequency(long); // vtable+0x64
	virtual int32_t GetSoundType() /* override */;
	virtual int32_t SetCompletionNotification(void (*)(long), long) /* override */;
	virtual void StopCompletionNotification() /* override */;
	virtual long EstimateRemainingPlayTime() /* override */;
protected:
	virtual int32_t GetSoundAliasToPlay(/*packed*/ struct IDirectSoundBuffer**); // vtable+0x68
	virtual int32_t CreateSoundBuffer(/*packed*/ struct _DSBUFFERDESC*); // vtable+0x6c
	virtual int32_t CreatePrimarySoundBuffer(); // vtable+0x70
	virtual int32_t ReleaseSoundBuffer(); // vtable+0x74
	virtual long InitializeStreamBuffer(long); // vtable+0x78
	virtual void ProcessStreamingBufferTimerCallback(); // vtable+0x7c
	virtual void ProcessCompletionEstimationTimerCallback(); // vtable+0x80
	virtual void StopCompletionNotificationEstimationTimer(); // vtable+0x84
	virtual int32_t StartCompletionNotificationEstimationTimer(); // vtable+0x88
};

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ class NotificationSink;
// VTABLE: COPTER_D 0x0058f5c8
class NotificationSink{ // packed(0x4 bytes) TI: 0x2ae9
public:
	virtual void DoNotificationChange(long, /*unpacked*/ class PreferenceManager*); // vtable+0x0
};

// Type: /*packed*/ class Sound;
// VTABLE: COPTER_D 0x0058f458
class Sound{ // packed(0x34 bytes) TI: 0x4335
	enum SoundSourceType {
		nSoundSourceTypeResource = 0,
		nSoundSourceTypeFile = 1,
	};
public:
	/*+0x4*/   enum Sound::SoundSourceType nSoundSourceType;
	enum SoundDuplicateType {
		nSoundDuplicateDefault = 0,
		nSoundDuplicateInterrupt = 1,
		nSoundDuplicateContinue = 2,
		nSoundDuplicateOverlap = 3,
	};
public:
	/*+0x8*/   enum Sound::SoundDuplicateType nSoundDuplicateType;
	/*+0xc*/   long lID;
	/*+0x10*/  long lResID;
	/*+0x14*/  /*packed*/ class basic_string<char> sSoundFile; // 0x8 bytes
	/*+0x1c*/  long bLooping;
	/*+0x20*/  long bStreaming;
	/*+0x24*/  long lVolume;
	/*+0x28*/  void (*soundCompletionFunction)(long);
	/*+0x2c*/  long lSoundCompletionData;
	/*+0x30*/  int32_t bUnloadBeforeNextPlay;
	void Sound();
	virtual void ~Sound(); // vtable+0x0
	/*packed*/ class Sound& operator=(const /*packed*/ class Sound&);
	virtual void SetSoundFile(const /*packed*/ class basic_string<char>&); // vtable+0x4
	virtual long Play(long, int32_t); // vtable+0x8
	virtual long Stop(); // vtable+0xc
	virtual long IsPlaying(); // vtable+0x10
	virtual int32_t SetCompletionNotification(void (*)(long), long); // vtable+0x14
	virtual void StopCompletionNotification(); // vtable+0x18
	virtual long EstimateRemainingPlayTime(); // vtable+0x1c
	virtual int32_t GetVolume(long *); // vtable+0x20
	virtual int32_t SetVolume(long); // vtable+0x24
	virtual int32_t GetSoundType(); // vtable+0x28
	// calltype: NearC
	static unsigned long GetTotalMemoryUsage();
	static unsigned long lTotalMemoryUsage;
};



// Contribution: 1:00040e30-000461ac Module: 52, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00441e30
