// Module: scontrols.obj
// Source: C:\Copter\source\sparkal\scontrols.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class DigitalSound;
// VTABLE: COPTER_D 0x0058f488
class DigitalSound : public Sound
{ // packed(0x7a bytes) TI: 0x45d4
protected:
	/*+0x34*/  int32_t nStreamingType;
	/*+0x38*/  int32_t nCompletionEstimationTimerSet;
	static /*packed*/ struct IDirectSound *lpDirectSound;
	/*+0x3c*/  uint32_t cbSize;
	/*+0x40*/  /*packed*/ struct tWAVEFORMATEX waveFormatEx; // 0x12 bytes
	/*+0x52*/  /*packed*/ struct IDirectSoundBuffer *lpSound[8]; // 0x20 bytes
	/*+0x72*/  /*packed*/ struct _STREAMBUFINFO *lpStreamBufferInfo;
	/*+0x76*/  unsigned long dwDesiredBufferDescFlags;
public:
	void DigitalSound(long);
	void DigitalSound(const /*packed*/ class basic_string<char>&, int32_t);
	void DigitalSound();
	virtual void ~DigitalSound() /* override */;
	/*packed*/ class DigitalSound& operator=(/*packed*/ class DigitalSound&);
	virtual void SetSoundFile(const /*packed*/ class basic_string<char>&, int32_t); // vtable+0x2c
	virtual int32_t Load(); // vtable+0x30
	virtual int32_t LoadFromResource(); // vtable+0x34
	virtual int32_t LoadFromFile(); // vtable+0x38
	virtual void Unload(); // vtable+0x3c
	virtual long Play(long, int32_t) /* override */;
	virtual long Stop() /* override */;
	virtual long ShouldWeStream(); // vtable+0x40
	virtual long PlayStream(); // vtable+0x44
	virtual long StopStream(); // vtable+0x48
protected:
	virtual long IsPlaying(/*packed*/ struct IDirectSoundBuffer**); // vtable+0x4c
public:
	virtual long IsPlaying() /* override */;
	virtual int32_t GetVolume(long *) /* override */;
	virtual int32_t SetVolume(long) /* override */;
	virtual int32_t GetPan(long *); // vtable+0x50
	virtual int32_t SetPan(long); // vtable+0x54
	virtual int32_t SetPosition(long, long, long); // vtable+0x58
	virtual long GetOriginalFrequency(); // vtable+0x5c
	virtual int32_t GetFrequency(long *); // vtable+0x60
	virtual int32_t SetFrequency(long); // vtable+0x64
	virtual int32_t GetSoundType() /* override */;
	virtual int32_t SetCompletionNotification(void (*)(long), long) /* override */;
	virtual void StopCompletionNotification() /* override */;
	virtual long EstimateRemainingPlayTime() /* override */;
protected:
	virtual int32_t GetSoundAliasToPlay(/*packed*/ struct IDirectSoundBuffer**); // vtable+0x68
	virtual int32_t CreateSoundBuffer(/*packed*/ struct _DSBUFFERDESC*); // vtable+0x6c
	virtual int32_t CreatePrimarySoundBuffer(); // vtable+0x70
	virtual int32_t ReleaseSoundBuffer(); // vtable+0x74
	virtual long InitializeStreamBuffer(long); // vtable+0x78
	virtual void ProcessStreamingBufferTimerCallback(); // vtable+0x7c
	virtual void ProcessCompletionEstimationTimerCallback(); // vtable+0x80
	virtual void StopCompletionNotificationEstimationTimer(); // vtable+0x84
	virtual int32_t StartCompletionNotificationEstimationTimer(); // vtable+0x88
};

// Type: long;

// Type: void ();

// Type: void;

// Type: /*packed*/ class SoundButtonWindow (forward reference);
// VTABLE: COPTER_D 0x00590870
class SoundButtonWindow : public ButtonWindow
{ // packed(0x94 bytes) TI: 0x457a
public:
	void SoundButtonWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void SoundButtonWindow();
	virtual void ~SoundButtonWindow() /* override */;
	virtual void SetState(int32_t) /* override */;
	// calltype: NearC
	static void SetSoundFile(const /*packed*/ class basic_string<char>&);
protected:
	static /*packed*/ class DigitalSound buttonSound;
	static long lButtonSoundReferenceCount;
};

// Type: /*packed*/ class MRect (forward reference);
class MRect : public SparkalRect
{ // packed(0x10 bytes) TI: 0x1067
public:
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void MRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalSize);
	void MRect(/*packed*/ struct SparkalRect*);
	void MRect(/*packed*/ class MRect*);
	void MRect(const /*packed*/ struct SparkalRect&);
	void MRect(long, long, long, long);
	void MRect();
	long Width();
	long Height();
	/*packed*/ class MSize Size();
	const /*packed*/ class MPoint& TopLeft();
	/*packed*/ class MPoint& TopLeft();
	const /*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint& BottomRight();
	/*packed*/ class MPoint CenterPoint();
	/*packed*/ struct SparkalRect* operator struct SparkalRect *();
	/*packed*/ class MRect* operator class MRect *();
	int32_t IsRectEmpty();
	int32_t IsRectNull();
	int32_t PtInRect(/*packed*/ struct SparkalPoint);
	int32_t PtInRect(long, long);
	int32_t DoesRectOverlap(/*packed*/ struct SparkalRect*);
	void SetRect(/*packed*/ struct SparkalPoint, /*packed*/ struct SparkalPoint);
	void SetRect(long, long, long, long);
	void SetRectEmpty();
	void CopyRect(/*packed*/ class MRect*);
	int32_t EqualRect(/*packed*/ class MRect*);
	void InflateRect(long, long, long, long);
	void InflateRect(/*packed*/ class MRect*);
	void InflateRect(/*packed*/ struct SparkalSize);
	void InflateRect(long, long);
	void DeflateRect(long, long, long, long);
	void DeflateRect(/*packed*/ class MRect*);
	void DeflateRect(/*packed*/ struct SparkalSize);
	void DeflateRect(long, long);
	void MoveRect(/*packed*/ struct SparkalPoint);
	void MoveRect(long, long);
	void OffsetRect(/*packed*/ struct SparkalPoint);
	void OffsetRect(/*packed*/ struct SparkalSize);
	void OffsetRect(long, long);
	void NormalizeRect();
	int32_t IntersectRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t UnionRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t SubtractRect(/*packed*/ class MRect*, /*packed*/ class MRect*);
	int32_t operator==(const /*packed*/ struct SparkalRect&);
	int32_t operator!=(const /*packed*/ struct SparkalRect&);
	void operator+=(/*packed*/ class MRect*);
	void operator+=(/*packed*/ struct SparkalSize);
	void operator+=(/*packed*/ struct SparkalPoint);
	void operator-=(/*packed*/ class MRect*);
	void operator-=(/*packed*/ struct SparkalSize);
	void operator-=(/*packed*/ struct SparkalPoint);
	void operator&=(const /*packed*/ struct SparkalRect&);
	void operator|=(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator+(/*packed*/ class MRect*);
	/*packed*/ class MRect operator+(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator-(/*packed*/ class MRect*);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalSize);
	/*packed*/ class MRect operator-(/*packed*/ struct SparkalPoint);
	/*packed*/ class MRect operator&(const /*packed*/ struct SparkalRect&);
	/*packed*/ class MRect operator|(const /*packed*/ struct SparkalRect&);
};

// Type: int32_t;

// Type: /*unpacked*/ class GraphicWindow (forward reference);
// GraphicWindow Class implementation not found

// Type: char *;

// Type: /*packed*/ class GraphicWindowOwner (forward reference);
// VTABLE: COPTER_D 0x00590f2c
class GraphicWindowOwner{ // packed(0x4 bytes) TI: 0x1647
public:
	virtual int32_t DoMessage(/*unpacked*/ class GraphicWindow*, long, long, void * __ptr32); // vtable+0x0
};

// Type: /*unpacked*/ class ButtonGroup (forward reference);
// ButtonGroup Class implementation not found

// Type: /*packed*/ class SoundRadioButtonWindow (forward reference);
// VTABLE: COPTER_D 0x00590950
class SoundRadioButtonWindow : public RadioButtonWindow
{ // packed(0x98 bytes) TI: 0x4582
public:
	void SoundRadioButtonWindow(/*unpacked*/ class ButtonGroup*, /*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	virtual void ~SoundRadioButtonWindow() /* override */;
	virtual void SetState(int32_t) /* override */;
	// calltype: NearC
	static void SetSoundFile(const /*packed*/ class basic_string<char>&);
protected:
	static /*packed*/ class DigitalSound radioButtonSound;
	static long lRadioSoundReferenceCount;
};

// Type: /*packed*/ class SoundCheckBoxWindow (forward reference);
// VTABLE: COPTER_D 0x00590a38
class SoundCheckBoxWindow : public CheckBoxWindow
{ // packed(0x94 bytes) TI: 0x45e5
public:
	void SoundCheckBoxWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void SoundCheckBoxWindow();
	virtual void ~SoundCheckBoxWindow() /* override */;
	virtual void SetState(int32_t) /* override */;
	// calltype: NearC
	static void SetSoundFile(const /*packed*/ class basic_string<char>&);
protected:
	static /*packed*/ class DigitalSound checkBoxSound;
	static long lCheckBoxSoundReferenceCount;
};

// Type: /*packed*/ class SoundScrollBarWindow (forward reference);
// VTABLE: COPTER_D 0x00590b18
class SoundScrollBarWindow : public ScrollBarWindow
{ // packed(0xd4 bytes) TI: 0x45e2
public:
	void SoundScrollBarWindow(/*packed*/ class MRect&, int32_t, enum SliderWindow::SliderWindowDirection, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, char *);
	void SoundScrollBarWindow();
	virtual void ~SoundScrollBarWindow() /* override */;
	virtual void MoveLinePrevious() /* override */;
	virtual void MoveLineNext() /* override */;
	// calltype: NearC
	static void SetSoundFile(const /*packed*/ class basic_string<char>&);
protected:
	static /*packed*/ class DigitalSound scrollBarSound;
	static long lScrollBarSoundReferenceCount;
};

// Type: enum SliderWindow::SliderWindowDirection;
enum SliderWindowDirection {
	nSliderWindowDirectionHorizontal = 0,
	nSliderWindowDirectionVertical = 1,
};

// Type: /*packed*/ class ButtonWindow (forward reference);
// VTABLE: COPTER_D 0x00591b78
class ButtonWindow : public GraphicWindow
{ // packed(0x94 bytes) TI: 0x1a48
	enum ButtonState {
		nButtonStateDisabled = 0,
		nButtonStateOff = 1,
		nButtonStateOn = 2,
	};
public:
	void ButtonWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void ButtonWindow();
	virtual int32_t Initialize() /* override */;
	virtual int32_t GetImageCount(); // vtable+0xc4
	virtual void SetState(int32_t); // vtable+0xc8
	virtual int32_t GetState(); // vtable+0xcc
	virtual void Enable(); // vtable+0xd0
	virtual void Disable(); // vtable+0xd4
	virtual int32_t ComposeSelf() /* override */;
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
	virtual void SetTextColor(const /*packed*/ struct SparkalColor*, const /*packed*/ struct SparkalColor*); // vtable+0xd8
	virtual int32_t CanWeRespondToMessage() /* override */;
protected:
	/*+0x74*/  int32_t nButtonState;
	/*+0x78*/  int32_t bEnabled;
	/*+0x7c*/  int32_t nButtonTextHeight;
	/*+0x80*/  /*packed*/ class MSize sizeTextOffset; // 0x8 bytes
	/*+0x88*/  int32_t bBusySettingState;
	/*+0x8c*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x90*/  /*packed*/ struct SparkalColor colorFontHighlighted;
};

// Type: uint32_t;

// Type: /*packed*/ class ButtonWindow;
// VTABLE: COPTER_D 0x00591b78
class ButtonWindow : public GraphicWindow
{ // packed(0x94 bytes) TI: 0x1a48
	enum ButtonState {
		nButtonStateDisabled = 0,
		nButtonStateOff = 1,
		nButtonStateOn = 2,
	};
public:
	void ButtonWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void ButtonWindow();
	virtual int32_t Initialize() /* override */;
	virtual int32_t GetImageCount(); // vtable+0xc4
	virtual void SetState(int32_t); // vtable+0xc8
	virtual int32_t GetState(); // vtable+0xcc
	virtual void Enable(); // vtable+0xd0
	virtual void Disable(); // vtable+0xd4
	virtual int32_t ComposeSelf() /* override */;
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
	virtual void SetTextColor(const /*packed*/ struct SparkalColor*, const /*packed*/ struct SparkalColor*); // vtable+0xd8
	virtual int32_t CanWeRespondToMessage() /* override */;
protected:
	/*+0x74*/  int32_t nButtonState;
	/*+0x78*/  int32_t bEnabled;
	/*+0x7c*/  int32_t nButtonTextHeight;
	/*+0x80*/  /*packed*/ class MSize sizeTextOffset; // 0x8 bytes
	/*+0x88*/  int32_t bBusySettingState;
	/*+0x8c*/  /*packed*/ struct SparkalColor colorFont;
	/*+0x90*/  /*packed*/ struct SparkalColor colorFontHighlighted;
};

// Type: /*packed*/ class Sound;
// VTABLE: COPTER_D 0x0058f458
class Sound{ // packed(0x34 bytes) TI: 0x4335
	enum SoundSourceType {
		nSoundSourceTypeResource = 0,
		nSoundSourceTypeFile = 1,
	};
public:
	/*+0x4*/   enum Sound::SoundSourceType nSoundSourceType;
	enum SoundDuplicateType {
		nSoundDuplicateDefault = 0,
		nSoundDuplicateInterrupt = 1,
		nSoundDuplicateContinue = 2,
		nSoundDuplicateOverlap = 3,
	};
public:
	/*+0x8*/   enum Sound::SoundDuplicateType nSoundDuplicateType;
	/*+0xc*/   long lID;
	/*+0x10*/  long lResID;
	/*+0x14*/  /*packed*/ class basic_string<char> sSoundFile; // 0x8 bytes
	/*+0x1c*/  long bLooping;
	/*+0x20*/  long bStreaming;
	/*+0x24*/  long lVolume;
	/*+0x28*/  void (*soundCompletionFunction)(long);
	/*+0x2c*/  long lSoundCompletionData;
	/*+0x30*/  int32_t bUnloadBeforeNextPlay;
	void Sound();
	virtual void ~Sound(); // vtable+0x0
	/*packed*/ class Sound& operator=(const /*packed*/ class Sound&);
	virtual void SetSoundFile(const /*packed*/ class basic_string<char>&); // vtable+0x4
	virtual long Play(long, int32_t); // vtable+0x8
	virtual long Stop(); // vtable+0xc
	virtual long IsPlaying(); // vtable+0x10
	virtual int32_t SetCompletionNotification(void (*)(long), long); // vtable+0x14
	virtual void StopCompletionNotification(); // vtable+0x18
	virtual long EstimateRemainingPlayTime(); // vtable+0x1c
	virtual int32_t GetVolume(long *); // vtable+0x20
	virtual int32_t SetVolume(long); // vtable+0x24
	virtual int32_t GetSoundType(); // vtable+0x28
	// calltype: NearC
	static unsigned long GetTotalMemoryUsage();
	static unsigned long lTotalMemoryUsage;
};

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ class ScrollBarWindow;
// VTABLE: COPTER_D 0x00591fc0
class ScrollBarWindow : public SliderWindow
{ // packed(0xd4 bytes) TI: 0x1813
	enum ScrollHitTestResult {
		nScrollHitTestResultNone = 0,
		nScrollHitTestResultLinePrevious = 1,
		nScrollHitTestResultLineNext = 2,
		nScrollHitTestResultPagePrevious = 3,
		nScrollHitTestResultPageNext = 4,
		nScrollHitTestResultThumb = 5,
	};
public:
	void ScrollBarWindow(/*packed*/ class MRect&, int32_t, enum SliderWindow::SliderWindowDirection, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, char *);
	void ScrollBarWindow();
	virtual int32_t Initialize() /* override */;
	virtual int32_t ComposeSelf() /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
	virtual void SetLineAndPageCount(long, long); // vtable+0xd8
	virtual void MoveLinePrevious(); // vtable+0xdc
	virtual void MoveLineNext(); // vtable+0xe0
	virtual void MovePagePrevious(); // vtable+0xe4
	virtual void MovePageNext(); // vtable+0xe8
protected:
	virtual int32_t DoCursorPositionHitTest(enum ScrollBarWindow::ScrollHitTestResult&, long, long); // vtable+0xec
	virtual void CalculateAllMetrics() /* override */;
	virtual long GetThumbWidth() /* override */;
	virtual long GetThumbHeight() /* override */;
	virtual long GetPrevNextButtonWidth(); // vtable+0xf0
	virtual long GetPrevNextButtonHeight(); // vtable+0xf4
	virtual long GetCurrentLine(); // vtable+0xf8
	virtual long GetValueOfGivenLine(long); // vtable+0xfc
	virtual long GetCurrentPage(); // vtable+0x100
	virtual long GetValueOfGivenPage(long); // vtable+0x104
	/*+0xb4*/  long lLineCount;
	/*+0xb8*/  long lPageCount;
	/*+0xbc*/  /*packed*/ class MTimer myTimer; // 0x10 bytes
	/*+0xcc*/  enum ScrollBarWindow::ScrollHitTestResult initialScrollHitTestResult;
	/*+0xd0*/  int32_t bCursorIsOnInitialHitTestResult;
};

// Type: /*packed*/ class CheckBoxWindow;
// VTABLE: COPTER_D 0x00591c58
class CheckBoxWindow : public ButtonWindow
{ // packed(0x94 bytes) TI: 0x213e
public:
	void CheckBoxWindow(/*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void CheckBoxWindow();
	virtual int32_t ComposeSelf() /* override */;
	virtual int32_t GetImageCount() /* override */;
	virtual void SetState(int32_t) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
};

// Type: /*packed*/ class RadioButtonWindow;
// VTABLE: COPTER_D 0x00591d38
class RadioButtonWindow : public ButtonWindow
{ // packed(0x98 bytes) TI: 0x1554
public:
	void RadioButtonWindow(/*unpacked*/ class ButtonGroup*, /*packed*/ class MRect&, int32_t, /*unpacked*/ class GraphicWindow*, char *, /*packed*/ class GraphicWindowOwner*, int32_t);
	void RadioButtonWindow();
	virtual void ~RadioButtonWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual int32_t GetImageCount() /* override */;
	virtual int32_t ComposeSelf() /* override */;
	virtual void AddToGroup(/*unpacked*/ class ButtonGroup*); // vtable+0xdc
	virtual int32_t RemoveFromGroup(); // vtable+0xe0
	virtual void SetState(int32_t) /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
protected:
	/*+0x94*/  /*unpacked*/ class ButtonGroup *myRadioButtonGroup;
};

// Type: /*packed*/ class SliderWindow;
// VTABLE: COPTER_D 0x00591ee8
class SliderWindow : public GraphicWindow
{ // packed(0xb4 bytes) TI: 0x2142
	enum SliderWindowDirection {
		nSliderWindowDirectionHorizontal = 0,
		nSliderWindowDirectionVertical = 1,
	};
public:
	void SliderWindow(/*packed*/ class MRect&, int32_t, enum SliderWindow::SliderWindowDirection, /*unpacked*/ class GraphicWindow*, /*packed*/ class GraphicWindowOwner*, int32_t, char *, char *, long);
	void SliderWindow();
	virtual void ~SliderWindow() /* override */;
	virtual int32_t Initialize() /* override */;
	void SetMinimumValue(long);
	void SetMaximumValue(long);
	virtual void MoveWindow(int32_t, int32_t) /* override */;
	virtual void SetWidthAndHeight(int32_t, int32_t) /* override */;
	long GetValue();
	void SetValue(long);
	virtual int32_t CreateImage(int32_t) /* override */;
	virtual void DestroyImage() /* override */;
	virtual int32_t ComposeSelf() /* override */;
	virtual long DoCursorDown(long, long, unsigned long) /* override */;
	virtual long DoCursorUp(long, long, unsigned long) /* override */;
	virtual long DoCursorMove(long, long) /* override */;
protected:
	virtual int32_t ConvertCursorPositionToValue(long&, long, long); // vtable+0xc4
	virtual void CalculateThumbPosition(); // vtable+0xc8
	virtual void CalculateAllMetrics(); // vtable+0xcc
	virtual long GetThumbWidth(); // vtable+0xd0
	virtual long GetThumbHeight(); // vtable+0xd4
public:
	/*+0x74*/  enum SliderWindow::SliderWindowDirection nSliderWindowDirection;
	/*+0x78*/  long lSliderMinimumValue;
	/*+0x7c*/  long lSliderMaximumValue;
	/*+0x80*/  long lSliderCurrentValue;
	/*+0x84*/  long lMinimumThumbPosition;
	/*+0x88*/  long lCurrentThumbPosition;
	/*+0x8c*/  long lMaximumThumbPosition;
	/*+0x90*/  long lThumbLimitIndentation;
	/*+0x94*/  /*packed*/ class MRect rectThumbImage; // 0x10 bytes
	/*+0xa4*/  /*unpacked*/ class CBackBuffer *myBackgroundImage;
	/*+0xa8*/  /*packed*/ class basic_string<char> sBackgroundFile; // 0x8 bytes
	/*+0xb0*/  int32_t bBusySettingValue;
};



// Contribution: 1:000705e0-00070d19 Module: 38, 16 byte alignment, code, execute, read, 
// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x004715e0
static void $E65() {

	__asm        call   $E61;
	__asm        call   $E64;
	__asm        jmp    near ptr 0x004715F5;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x004715fa
static void $E61() {

	__asm        mov    ecx, 0x6042C8;
	__asm        call   DigitalSound::DigitalSound;
	__asm        jmp    near ptr 0x0047160F;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00471614
static void $E64() {

	__asm        push   0x471631;
	__asm        call   atexit;
	__asm        add    esp, 4;
	__asm        jmp    near ptr 0x0047162C;
}

// STATIC INITIALIZER:
// SYNTHETIC: COPTER_D 0x00471631
static void $E62() {

	__asm        xor    eax, eax;
	__asm        mov    al, ds:[0x604444];
	__asm        test   al, 1;
	__asm        jne    _T2d;

	__asm        xor    eax, eax;
