// Module: scrnbuf.obj
// Source: C:\Copter\source\sparkal\scrnbuf.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class ScreenBuffer (forward reference);
// VTABLE: COPTER_D 0x005915b0
class ScreenBuffer : public CBackBuffer
{ // packed(0x16a bytes) TI: 0x2735
public:
	/*+0x134*/ /*unpacked*/ class CSparkalWindow *pWindow;
	/*+0x138*/ long bOK;
	void ScreenBuffer(/*unpacked*/ class CSparkalWindow*, long, long, /*packed*/ struct SparkalColor*, int32_t, enum tagModeType, int32_t);
	void ScreenBuffer();
	virtual void ~ScreenBuffer(); // vtable+0x64
	virtual unsigned long Swap(/*unpacked*/ class CSparkalWindow*, long, long) /* override */;
	virtual int32_t DeleteSurfaces(); // vtable+0x68
	virtual int32_t CreateSurfaces(); // vtable+0x6c
	virtual int32_t ClearSurfaces(int32_t); // vtable+0x70
	virtual int32_t UsePalette(/*packed*/ struct SparkalColor*); // vtable+0x74
	virtual void FreePalette(); // vtable+0x78
	virtual void SetPalette(); // vtable+0x7c
	virtual unsigned long FillRect(long, /*packed*/ struct SparkalRect*) /* override */;
	virtual void SetWindowRect(/*packed*/ struct SparkalRect*); // vtable+0x80
	virtual void SetNewModeType(enum tagModeType); // vtable+0x84
	virtual void WaitTillReadyToFlip(); // vtable+0x88
protected:
	/*+0x13c*/ /*packed*/ struct SparkalRect rectBuffer; // 0x10 bytes
	/*+0x14c*/ short nBackBuffers; // 0x2 bytes
	/*+0x14e*/ enum tagModeType nCurrentModeType;
	/*+0x152*/ int32_t bUsingFlipping;
	/*+0x156*/ /*packed*/ struct IDirectDrawClipper *lpClipper;
	/*+0x15a*/ /*packed*/ struct tagRECT rectDirectDrawBackBuffer; // 0x10 bytes
};

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: void;

// Type: /*unpacked*/ class CSparkalWindow (forward reference);
// CSparkalWindow Class implementation not found

// Type: long;

// Type: /*packed*/ struct SparkalColor (forward reference);
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: int32_t;

// Type: enum tagModeType;
enum tagModeType {
	nModeTypeFullScreen = 0,
	nModeTypeWindowed = 1,
};

// Type: /*packed*/ struct _DDSCAPS;
struct _DDSCAPS{ // packed(0x4 bytes) TI: 0x176d
	/*+0x0*/   unsigned long dwCaps;
};

// Type: /*packed*/ struct _DDBLTFX;
struct _DDBLTFX{ // packed(0x64 bytes) TI: 0x12e7
	/*+0x0*/   unsigned long dwSize;
	/*+0x4*/   unsigned long dwDDFX;
	/*+0x8*/   unsigned long dwROP;
	/*+0xc*/   unsigned long dwDDROP;
	/*+0x10*/  unsigned long dwRotationAngle;
	/*+0x14*/  unsigned long dwZBufferOpCode;
	/*+0x18*/  unsigned long dwZBufferLow;
	/*+0x1c*/  unsigned long dwZBufferHigh;
	/*+0x20*/  unsigned long dwZBufferBaseDest;
	/*+0x24*/  unsigned long dwZDestConstBitDepth;
	/*+0x28*/  unsigned long dwZDestConst;
	/*+0x28*/  /*packed*/ struct IDirectDrawSurface *lpDDSZBufferDest;
	/*+0x2c*/  unsigned long dwZSrcConstBitDepth;
	/*+0x30*/  unsigned long dwZSrcConst;
	/*+0x30*/  /*packed*/ struct IDirectDrawSurface *lpDDSZBufferSrc;
	/*+0x34*/  unsigned long dwAlphaEdgeBlendBitDepth;
	/*+0x38*/  unsigned long dwAlphaEdgeBlend;
	/*+0x3c*/  unsigned long dwReserved;
	/*+0x40*/  unsigned long dwAlphaDestConstBitDepth;
	/*+0x44*/  unsigned long dwAlphaDestConst;
	/*+0x44*/  /*packed*/ struct IDirectDrawSurface *lpDDSAlphaDest;
	/*+0x48*/  unsigned long dwAlphaSrcConstBitDepth;
	/*+0x4c*/  unsigned long dwAlphaSrcConst;
	/*+0x4c*/  /*packed*/ struct IDirectDrawSurface *lpDDSAlphaSrc;
	/*+0x50*/  unsigned long dwFillColor;
	/*+0x50*/  /*packed*/ struct IDirectDrawSurface *lpDDSPattern;
	/*+0x54*/  /*packed*/ struct _DDCOLORKEY ddckDestColorkey; // 0x8 bytes
	/*+0x5c*/  /*packed*/ struct _DDCOLORKEY ddckSrcColorkey; // 0x8 bytes
};

// Type: unsigned long;

// Type: /*packed*/ struct tagPALETTEENTRY (forward reference);
struct tagPALETTEENTRY{ // packed(0x4 bytes) TI: 0x1be6
	/*+0x0*/   unsigned char peRed; // 0x1 bytes
	/*+0x1*/   unsigned char peGreen; // 0x1 bytes
	/*+0x2*/   unsigned char peBlue; // 0x1 bytes
	/*+0x3*/   unsigned char peFlags; // 0x1 bytes
};

// Type: void * __ptr32;

// Type: /*packed*/ struct SparkalRect (forward reference);
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ struct tagRECT;
struct tagRECT{ // packed(0x10 bytes) TI: 0x13c4
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
};

// Type: uint32_t;

// Type: /*unpacked*/ class CBackBuffer (forward reference);
// CBackBuffer Class implementation not found



// Contribution: 1:0009d450-0009e705 Module: 12, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x0049e450
void ScreenBuffer::ScreenBuffer() {
	/*bp-0x10*/  /*packed*/ struct SparkalRect rectWindowTemp; // 0x10 bytes


	__asm        mov    ecx, this;
	__asm        call   CBackBuffer::CBackBuffer;
	__asm        jmp    _T19;
_T19:
	this-><ScreenBuffer+0x00> = 0x5915b0;
// LINE 25:
	__asm        jmp    _T27;
// LINE 26:
_T27:
	this->pWindow = 0x0;
// LINE 27:
	this-><ScreenBuffer+0x08> = 0x280;
// LINE 28:
	this-><ScreenBuffer+0x0c> = 0x1e0;
// LINE 29:
	this->nBackBuffers = 0x2;
// LINE 30:
	this->nCurrentModeType = 0x0;
// LINE 31:
	this->bUsingFlipping = 0x0;
// LINE 33:
	rectWindowTemp.left = 0x0;
// LINE 34:
	rectWindowTemp.top = 0x0;
// LINE 35:
	rectWindowTemp.right = 0x0;
// LINE 36:
