// Module: Smkbuff.obj
// Source: C:\Copter\source\sparkal\Smkbuff.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class SmackerBuffer (forward reference);
// VTABLE: COPTER_D 0x00591138
class SmackerBuffer{ // packed(0x140 bytes) TI: 0x20de
public:
	void SmackerBuffer(char *, int32_t, int32_t);
	void SmackerBuffer();
	virtual void ~SmackerBuffer(); // vtable+0x0
	virtual int32_t Initialize(); // vtable+0x4
	virtual int32_t CreateSurface(); // vtable+0x8
	virtual void ClearBuffer(int32_t); // vtable+0xc
	virtual int32_t Open(char *, unsigned long, unsigned long); // vtable+0x10
	virtual void Close(); // vtable+0x14
	virtual int32_t ComposeToWindow(); // vtable+0x18
	virtual int32_t SetPalette(); // vtable+0x1c
	void Goto(unsigned long);
	void Reset();
	void GetSummary(/*packed*/ struct SmackSumTag*);
	void CenterBufferInRect(/*packed*/ struct SparkalRect*);
	void SetBufferPosition(int32_t, int32_t);
	void SetWindow(/*packed*/ class CSparkalWindow*);
	void SetWindow(void * __ptr32);
	void SetZoomFactor(int32_t);
	// calltype: NearC
	static char * GetSmackerVersion(char *);
	/*+0x4*/   int32_t nStatus;
	/*+0x8*/   int32_t bLoopVideo;
	/*+0xc*/   int32_t bBlankAtEndOfVideo;
	/*+0x10*/  int32_t nBlankColorIndex;
	/*+0x14*/  /*packed*/ struct SparkalColor colorWindowFill;
	/*+0x18*/  void * __ptr32 myWindow;
	/*+0x1c*/  int32_t nBufferWidth;
	/*+0x20*/  int32_t nBufferHeight;
	/*+0x24*/  int32_t nDestX;
	/*+0x28*/  int32_t nDestY;
	/*+0x2c*/  int32_t nDestWidth;
	/*+0x30*/  int32_t nDestHeight;
protected:
	/*+0x34*/  /*packed*/ struct SmackBufTag *smkbuf;
	/*+0x38*/  /*packed*/ struct SmackTag *smk;
	/*+0x3c*/  char szSmackFilePath[260]; // 0x104 bytes
};

// Type: void;

// Type: char *;

// Type: int32_t;

// Type: unsigned long;

// Type: void * __ptr32;

// Type: /*packed*/ struct SparkalRect;
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ struct tagRECT;
struct tagRECT{ // packed(0x10 bytes) TI: 0x13c4
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
};

// Type: /*unpacked*/ class CSparkalWindow (forward reference);
// CSparkalWindow Class implementation not found

// Type: /*packed*/ struct SparkalRect (forward reference);
struct SparkalRect{ // packed(0x10 bytes) TI: 0x155f
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
	void SparkalRect(long, long, long, long);
	void SparkalRect();
};

// Type: /*packed*/ class VRBmpSmackerBuffer (forward reference);
// VTABLE: COPTER_D 0x00591158
class VRBmpSmackerBuffer : public SmackerBuffer
{ // packed(0x164 bytes) TI: 0x230c
public:
	/*+0x140*/ char * szVRBmpName;
	/*+0x144*/ int32_t nVRBmpFlags;
	/*+0x148*/ /*packed*/ struct VRResource *vrOriginalResource;
	/*+0x14c*/ /*packed*/ struct VRBmpHdr *bmpOriginalHeader;
	/*+0x150*/ int32_t bPreserveBmp;
	/*+0x154*/ char * chVRBmpHeader;
	/*+0x158*/ /*packed*/ struct VRBmpHdr *bmpHeader;
	/*+0x15c*/ char * bmpDataStart;
	/*+0x160*/ int32_t bPreserveSmackerBuffer;
	void VRBmpSmackerBuffer(char *, int32_t, int32_t, int32_t);
	void VRBmpSmackerBuffer();
	virtual void ~VRBmpSmackerBuffer() /* override */;
	void InitializeVRBmpMembers();
	virtual int32_t CreateSurface(int32_t); // vtable+0x20
	virtual void DeleteSurface(); // vtable+0x24
	virtual void ClearBuffer(int32_t) /* override */;
	virtual int32_t Open(char *, unsigned long, unsigned long) /* override */;
	virtual int32_t SetDefaultVRBmp(char *, int32_t, int32_t); // vtable+0x28
	int32_t Compose();
	virtual int32_t DrawDefaultVRBmp(); // vtable+0x2c
};

// Type: /*packed*/ struct VRBmpHdr (forward reference);
struct VRBmpHdr{ // packed(0x10 bytes) TI: 0x2312
	/*+0x0*/   /*packed*/ struct VRBmpInfo info; // 0xc bytes
	/*+0xc*/   int32_t ScanOffset[1];
};

// Type: /*packed*/ class SmackerBackBuffer (forward reference);
// VTABLE: COPTER_D 0x005911f0
class SmackerBackBuffer : public SmackerBuffer, public CBackBuffer
{ // packed(0x27c bytes) TI: 0x41fc
public:
	/*+0x274*/ int32_t bUseSmackBuf;
	void SmackerBackBuffer(char *, int32_t, int32_t, int32_t, int32_t, int32_t);
	void SmackerBackBuffer();
	virtual void ~SmackerBackBuffer() /* override */;
	virtual int32_t Initialize() /* override */;
	virtual void SetBackBufferData(char *, int32_t, int32_t, int32_t, int32_t, int32_t); // vtable+0x20
	virtual int32_t Open(char *, unsigned long, unsigned long) /* override */;
	virtual int32_t CreateSurface() /* override */;
	virtual void SetDirectBlit(); // vtable+0x24
	virtual unsigned long Compose(/*packed*/ class IFlatImage*, long, long, long, long, long, long) /* override */;
	virtual unsigned long StretchCompose(/*packed*/ class IFlatImage*, long, long, long, long, long, long, long, long) /* override */;
protected:
	/*+0x278*/ int32_t bDirectBlit;
	void BltParts(/*packed*/ class IFlatImage*, long, long, long, long, long, long);
	void BltAll(/*packed*/ class IFlatImage*, long, long, long, long, long, long);
};

// Type: long;

// Type: /*packed*/ class IFlatImage (forward reference);
// VTABLE: COPTER_D 0x00591050
class IFlatImage{ // packed(0x18 bytes) TI: 0x13a1
public:
	void IFlatImage();
	virtual unsigned long Lock(); // vtable+0x0
	virtual unsigned long Unlock(); // vtable+0x4
	unsigned long GetLockCount();
	virtual void SetTransparentColor(int32_t, long); // vtable+0x8
	long GetHeight();
	long GetWidth();
	void * __ptr32 GetBitsPointer();
	long GetStride();
	virtual unsigned long Compose(/*packed*/ class IFlatImage*, long, long, long, long, long, long); // vtable+0xc
	unsigned long Compose(/*packed*/ class IFlatImage*, long, long);
	virtual unsigned long StretchCompose(/*packed*/ class IFlatImage*, long, long, long, long, long, long, long, long); // vtable+0x10
	virtual unsigned long StretchCompose(/*packed*/ class IFlatImage*, /*packed*/ struct SparkalRect, /*packed*/ struct SparkalRect); // vtable+0x14
	virtual unsigned long FillRect(long, /*packed*/ struct SparkalRect*); // vtable+0x18
	void DrawPixel(unsigned char, long, long);
	unsigned char GetPixel(long, long);
	static unsigned long lTotalMemoryUsage;
	static unsigned long lTotalLockCount;
protected:
	/*+0x4*/   unsigned long mLockCount;
	/*+0x8*/   long mWidth;
	/*+0xc*/   long mHeight;
	/*+0x10*/  void * __ptr32 mpBits;
	/*+0x14*/  long mStride;
};

// Type: uint32_t;

// Type: /*packed*/ class SmackerBuffer;
// VTABLE: COPTER_D 0x00591138
class SmackerBuffer{ // packed(0x140 bytes) TI: 0x20de
public:
	void SmackerBuffer(char *, int32_t, int32_t);
	void SmackerBuffer();
	virtual void ~SmackerBuffer(); // vtable+0x0
	virtual int32_t Initialize(); // vtable+0x4
	virtual int32_t CreateSurface(); // vtable+0x8
	virtual void ClearBuffer(int32_t); // vtable+0xc
	virtual int32_t Open(char *, unsigned long, unsigned long); // vtable+0x10
	virtual void Close(); // vtable+0x14
	virtual int32_t ComposeToWindow(); // vtable+0x18
	virtual int32_t SetPalette(); // vtable+0x1c
	void Goto(unsigned long);
	void Reset();
	void GetSummary(/*packed*/ struct SmackSumTag*);
	void CenterBufferInRect(/*packed*/ struct SparkalRect*);
	void SetBufferPosition(int32_t, int32_t);
	void SetWindow(/*packed*/ class CSparkalWindow*);
	void SetWindow(void * __ptr32);
	void SetZoomFactor(int32_t);
	// calltype: NearC
	static char * GetSmackerVersion(char *);
	/*+0x4*/   int32_t nStatus;
	/*+0x8*/   int32_t bLoopVideo;
	/*+0xc*/   int32_t bBlankAtEndOfVideo;
	/*+0x10*/  int32_t nBlankColorIndex;
	/*+0x14*/  /*packed*/ struct SparkalColor colorWindowFill;
	/*+0x18*/  void * __ptr32 myWindow;
	/*+0x1c*/  int32_t nBufferWidth;
	/*+0x20*/  int32_t nBufferHeight;
	/*+0x24*/  int32_t nDestX;
	/*+0x28*/  int32_t nDestY;
	/*+0x2c*/  int32_t nDestWidth;
	/*+0x30*/  int32_t nDestHeight;
protected:
	/*+0x34*/  /*packed*/ struct SmackBufTag *smkbuf;
	/*+0x38*/  /*packed*/ struct SmackTag *smk;
	/*+0x3c*/  char szSmackFilePath[260]; // 0x104 bytes
};

// Type: /*unpacked*/ class CBackBuffer (forward reference);
// CBackBuffer Class implementation not found



// Contribution: 1:00096c00-00098e2e Module: 17, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00497c00
void SmackerBuffer::SmackerBuffer() {

	__asm        jmp    near ptr 0x00497C11;

	this-><vftable> = 0x591138;
// LINE 40:
	this->nStatus = 0x0;
// LINE 41:
	this->bLoopVideo = 0x0;
// LINE 42:
	this->bBlankAtEndOfVideo = 0x0;
// LINE 43:
	this->nBlankColorIndex = 0x0;
// LINE 44:
	__asm        mov    eax, this;
	__asm        mov    byte ptr [eax+0x14], 0;
	__asm        mov    eax, this;
	__asm        mov    al, [eax+0x14];
	__asm        mov    ecx, this;
	__asm        mov    [ecx+0x15], al;
	__asm        mov    eax, this;
	__asm        mov    al, [eax+0x15];
	__asm        mov    ecx, this;
	__asm        mov    [ecx+0x16], al;
// LINE 45:
	this->myWindow = 0x0;
// LINE 46:
	this->nBufferWidth = 0x0;
