// Module: soundq.obj
// Source: C:\Copter\source\sparkal\soundq.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct list<SoundQueueItem *>::list_node_buffer (forward reference);
struct list<SoundQueueItem *>::list_node_buffer{ // packed(0x8 bytes) TI: 0x25ea
	/*+0x0*/   void * __ptr32 next_buffer;
	/*+0x4*/   /*packed*/ struct list<SoundQueueItem *>::list_node *buffer;
};

// Type: /*packed*/ struct list<SoundQueueItem *>::list_node (forward reference);
struct list<SoundQueueItem *>::list_node{ // packed(0xc bytes) TI: 0x25ec
	/*+0x0*/   void * __ptr32 next;
	/*+0x4*/   void * __ptr32 prev;
	/*+0x8*/   /*packed*/ struct SoundQueueItem *data;
};

// Type: uint32_t;

// Type: void;

// Type: /*packed*/ struct SoundQueueItem (forward reference);
struct SoundQueueItem{ // packed(0x18 bytes) TI: 0x24b1
	void SoundQueueItem(/*packed*/ class Sound*, char *, long, int32_t);
	void SoundQueueItem(/*packed*/ class Sound*, const /*packed*/ class basic_string<char>&, long, int32_t);
	void SoundQueueItem(/*packed*/ class Sound*, long, long, int32_t);
	void SoundQueueItem(/*packed*/ class Sound*, long, int32_t);
	void SoundQueueItem();
	/*+0x0*/   /*packed*/ class Sound *mySound;
	/*+0x4*/   long lSoundResourceID;
	/*+0x8*/   /*packed*/ class basic_string<char> sSoundFile; // 0x8 bytes
	/*+0x10*/  long lTimeToWaitBeforePlaying;
	/*+0x14*/  int32_t bDeleteSoundWhenFinished;
};

// Type: /*packed*/ class Sound (forward reference);
// VTABLE: COPTER_D 0x0058f458
class Sound{ // packed(0x34 bytes) TI: 0x4335
	enum SoundSourceType {
		nSoundSourceTypeResource = 0,
		nSoundSourceTypeFile = 1,
	};
public:
	/*+0x4*/   enum Sound::SoundSourceType nSoundSourceType;
	enum SoundDuplicateType {
		nSoundDuplicateDefault = 0,
		nSoundDuplicateInterrupt = 1,
		nSoundDuplicateContinue = 2,
		nSoundDuplicateOverlap = 3,
	};
public:
	/*+0x8*/   enum Sound::SoundDuplicateType nSoundDuplicateType;
	/*+0xc*/   long lID;
	/*+0x10*/  long lResID;
	/*+0x14*/  /*packed*/ class basic_string<char> sSoundFile; // 0x8 bytes
	/*+0x1c*/  long bLooping;
	/*+0x20*/  long bStreaming;
	/*+0x24*/  long lVolume;
	/*+0x28*/  void (*soundCompletionFunction)(long);
	/*+0x2c*/  long lSoundCompletionData;
	/*+0x30*/  int32_t bUnloadBeforeNextPlay;
	void Sound();
	virtual void ~Sound(); // vtable+0x0
	/*packed*/ class Sound& operator=(const /*packed*/ class Sound&);
	virtual void SetSoundFile(const /*packed*/ class basic_string<char>&); // vtable+0x4
	virtual long Play(long, int32_t); // vtable+0x8
	virtual long Stop(); // vtable+0xc
	virtual long IsPlaying(); // vtable+0x10
	virtual int32_t SetCompletionNotification(void (*)(long), long); // vtable+0x14
	virtual void StopCompletionNotification(); // vtable+0x18
	virtual long EstimateRemainingPlayTime(); // vtable+0x1c
	virtual int32_t GetVolume(long *); // vtable+0x20
	virtual int32_t SetVolume(long); // vtable+0x24
	virtual int32_t GetSoundType(); // vtable+0x28
	// calltype: NearC
	static unsigned long GetTotalMemoryUsage();
	static unsigned long lTotalMemoryUsage;
};

// Type: long;

// Type: int32_t;

// Type: /*packed*/ class basic_string<char> (forward reference);
class basic_string<char>{ // packed(0x8 bytes) TI: 0x1380
	using reference_class = /*unpacked*/ class basic_string_ref<char>;
	using reference_pointer = /*unpacked*/ class basic_string_ref<char>*;
private:
	/*+0x0*/   char * c_str_ptr;
	/*+0x4*/   /*unpacked*/ class basic_string_ref<char> *reference;
	char * point();
	uint32_t& len();
	uint32_t ref_count();
	// calltype: NearC
	static char eos();
	void assign_str(char *, uint32_t);
	void append_str(char *, uint32_t);
	void insert_str(uint32_t, char *, uint32_t);
	void replace_str(uint32_t, uint32_t, char *, uint32_t);
	int32_t compare_str(uint32_t, char *, uint32_t, uint32_t);
	uint32_t find_str(char *, uint32_t, uint32_t);
	uint32_t rfind_str(char *, uint32_t, uint32_t);
	uint32_t find_first_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_of_str(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of_str(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of_str(char *, uint32_t, uint32_t);
public:
	void basic_string<char>(const /*packed*/ class vector<char>&);
	void basic_string<char>(char, uint32_t);
	void basic_string<char>(char *);
	void basic_string<char>(char *, uint32_t);
	void basic_string<char>(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	void basic_string<char>(uint32_t, enum capacity);
	void basic_string<char>();
protected:
	void basic_string<char>(char *, uint32_t, uint32_t);
	void delete_ref();
	using char_type = char;
	using baggage_type = /*packed*/ struct string_char_baggage<char>;
public:
	void ~basic_string<char>();
	/*packed*/ class basic_string<char>& operator=(char);
	/*packed*/ class basic_string<char>& operator=(char *);
	/*packed*/ class basic_string<char>& operator=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class basic_string<char>& operator+=(char);
	/*packed*/ class basic_string<char>& operator+=(char *);
	/*packed*/ class basic_string<char>& operator+=(const /*packed*/ class basic_string<char>&);
	/*packed*/ class vector<char> operator class vector<char>();
	/*packed*/ class basic_string<char>& append(char, uint32_t);
	/*packed*/ class basic_string<char>& append(char *);
	/*packed*/ class basic_string<char>& append(char *, uint32_t);
	/*packed*/ class basic_string<char>& append(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& assign(char, uint32_t);
	/*packed*/ class basic_string<char>& assign(char *);
	/*packed*/ class basic_string<char>& assign(char *, uint32_t);
	/*packed*/ class basic_string<char>& assign(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *);
	/*packed*/ class basic_string<char>& insert(uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& insert(uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& remove(uint32_t, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, char *, uint32_t);
	/*packed*/ class basic_string<char>& replace(uint32_t, uint32_t, const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
	char get_at(uint32_t);
	void put_at(uint32_t, char);
	char& operator[](uint32_t);
	char operator[](uint32_t);
	char * c_str();
	char * data();
	uint32_t length();
	void resize(uint32_t);
	void resize(uint32_t, char);
	void reserve(uint32_t);
	uint32_t reserve();
	uint32_t copy(char *, uint32_t, uint32_t);
	uint32_t find(char, uint32_t);
	uint32_t find(char *, uint32_t);
	uint32_t find(char *, uint32_t, uint32_t);
	uint32_t find(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t rfind(char, uint32_t);
	uint32_t rfind(char *, uint32_t);
	uint32_t rfind(char *, uint32_t, uint32_t);
	uint32_t rfind(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_of(char, uint32_t);
	uint32_t find_first_of(char *, uint32_t);
	uint32_t find_first_of(char *, uint32_t, uint32_t);
	uint32_t find_first_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_of(char, uint32_t);
	uint32_t find_last_of(char *, uint32_t);
	uint32_t find_last_of(char *, uint32_t, uint32_t);
	uint32_t find_last_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_first_not_of(char, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t);
	uint32_t find_first_not_of(char *, uint32_t, uint32_t);
	uint32_t find_first_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	uint32_t find_last_not_of(char, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t);
	uint32_t find_last_not_of(char *, uint32_t, uint32_t);
	uint32_t find_last_not_of(const /*packed*/ class basic_string<char>&, uint32_t);
	/*packed*/ class basic_string<char> substr(uint32_t, uint32_t);
	int32_t compare(char, uint32_t, uint32_t);
	int32_t compare(char *, uint32_t);
	int32_t compare(char *, uint32_t, uint32_t);
	int32_t compare(const /*packed*/ class basic_string<char>&, uint32_t, uint32_t);
};

// Type: char *;

// Type: /*packed*/ struct DigitalSoundQueueItem (forward reference);
struct DigitalSoundQueueItem : public SoundQueueItem
{ // packed(0x18 bytes) TI: 0x2ba7
	void DigitalSoundQueueItem(long, long);
	void DigitalSoundQueueItem(char *, long);
	void DigitalSoundQueueItem(const /*packed*/ class basic_string<char>&, long);
};

// Type: /*packed*/ class SoundQueue (forward reference);
// VTABLE: COPTER_D 0x0058f3f0
class SoundQueue{ // packed(0x18 bytes) TI: 0x24ef
public:
	void SoundQueue();
	void ~SoundQueue();
	virtual int32_t Initialize(); // vtable+0x0
	virtual void DeInitialize(int32_t); // vtable+0x4
	virtual void ClearQueue(int32_t); // vtable+0x8
	/*packed*/ class SoundQueue& operator+=(/*packed*/ struct SoundQueueItem*);
	/*packed*/ class SoundQueue& operator+=(/*packed*/ class Sound*);
	virtual int32_t StartPauseCallback(long); // vtable+0xc
	virtual void EndPauseCallback(); // vtable+0x10
	virtual void PlayNextSoundInQueue(); // vtable+0x14
	virtual void RemoveNextSoundInQueue(); // vtable+0x18
	virtual void SoundQueueCompletionCallback(); // vtable+0x1c
	// calltype: NearC
	static void StaticSoundQueueCompletionCallback(long);
	virtual void SoundQueueWaitTimeCallback(); // vtable+0x20
	// calltype: NearC
	static void StaticSoundQueueWaitTimeCallback(long);
	virtual int32_t GetMutex(unsigned long); // vtable+0x24
	virtual void ReleaseMutex(); // vtable+0x28
protected:
	/*+0x4*/   /*packed*/ class list<SoundQueueItem *> mySoundQueueItemList; // 0x8 bytes
	/*+0xc*/   int32_t bOK;
	/*+0x10*/  long bMutex;
	/*+0x14*/  int32_t nWaitTimerSet;
	// calltype: NearStd
	static void WindowsStaticSoundQueueCompletionCallback(uint32_t, uint32_t, unsigned long, unsigned long, unsigned long);
	// calltype: NearStd
	static void WindowsStaticSoundQueueWaitTimeCallback(uint32_t, uint32_t, unsigned long, unsigned long, unsigned long);
};

// Type: /*packed*/ class list<SoundQueueItem *>::iterator;
class list<SoundQueueItem *>::iterator : public bidirectional_iterator<SoundQueueItem *,int>
{ // packed(0x4 bytes) TI: 0x25e8
protected:
	/*+0x0*/   /*packed*/ struct list<SoundQueueItem *>::list_node *node;
public:
	void iterator();
protected:
	void iterator(/*packed*/ struct list<SoundQueueItem *>::list_node*);
public:
	int32_t operator==(const /*packed*/ class list<SoundQueueItem *>::iterator&);
	/*packed*/ struct SoundQueueItem*& operator*();
	/*packed*/ class list<SoundQueueItem *>::iterator operator++(int32_t);
	/*packed*/ class list<SoundQueueItem *>::iterator& operator++();
	/*packed*/ class list<SoundQueueItem *>::iterator operator--(int32_t);
	/*packed*/ class list<SoundQueueItem *>::iterator& operator--();
};

// Type: unsigned long;

// Type: /*packed*/ class MTimer;
class MTimer{ // packed(0x10 bytes) TI: 0x1968
	enum TimerResolution {
		nTimerResolutionMicroseconds = 0,
		nTimerResolutionMilliseconds = 1,
		nTimerResolutionSeconds = 2,
	};
public:
	void MTimer(enum MTimer::TimerResolution);
	void ~MTimer();
	void SetResolution(enum MTimer::TimerResolution);
	enum MTimer::TimerResolution GetResolution();
	void Start();
	void Stop();
	void Reset();
	void Restart();
	unsigned long GetElapsedTime();
	int32_t IsTimerRunning();
	unsigned long GetTickCount();
protected:
	/*+0x0*/   enum MTimer::TimerResolution nTimerResolution;
	/*+0x4*/   unsigned long lStartTime;
	/*+0x8*/   unsigned long lTotalElapsedTime;
	unsigned long GetWindowsTimerFrequency();
	/*+0xc*/   unsigned long lFrequency;
};

// Type: /*packed*/ struct bidirectional_iterator<SoundQueueItem *,int>;
struct bidirectional_iterator<SoundQueueItem *,int>{ // packed(0x1 bytes) TI: 0x24ff
};

// Type: /*packed*/ struct SoundQueueItem;
struct SoundQueueItem{ // packed(0x18 bytes) TI: 0x24b1
	void SoundQueueItem(/*packed*/ class Sound*, char *, long, int32_t);
	void SoundQueueItem(/*packed*/ class Sound*, const /*packed*/ class basic_string<char>&, long, int32_t);
	void SoundQueueItem(/*packed*/ class Sound*, long, long, int32_t);
	void SoundQueueItem(/*packed*/ class Sound*, long, int32_t);
	void SoundQueueItem();
	/*+0x0*/   /*packed*/ class Sound *mySound;
	/*+0x4*/   long lSoundResourceID;
	/*+0x8*/   /*packed*/ class basic_string<char> sSoundFile; // 0x8 bytes
	/*+0x10*/  long lTimeToWaitBeforePlaying;
	/*+0x14*/  int32_t bDeleteSoundWhenFinished;
};



// Contribution: 1:0001f5f0-00021277 Module: 71, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004205f0
void SoundQueueItem::SoundQueueItem() {

	__asm        push   0x10;
	__asm        call   operator new;
	__asm        add    esp, 4;
	__asm        mov    [ebp-4], eax;
	__asm        cmp    dword ptr [ebp-4], 0;
	__asm        je     _T5f;

	__asm        mov    eax, [ebp-4];
	__asm        mov    dword ptr [eax+4], 0;
	__asm        mov    eax, [ebp-4];
	__asm        mov    eax, [eax+4];
	__asm        mov    ecx, [ebp-4];
	__asm        mov    [ecx+8], eax;
	__asm        mov    eax, [ebp-4];
	__asm        mov    dword ptr [eax], 0;
	__asm        mov    eax, [ebp-4];
	__asm        mov    dword ptr [eax+0xC], 1;
	__asm        jmp    _T51;
_T51:
	__asm        mov    eax, [ebp-4];
	__asm        mov    ecx, this;
	__asm        mov    [ecx+0xC], eax;
	__asm        jmp    _T69;
_T5f:
	this->sSoundFile.reference = 0x0;
_T69:
