// Module: version.obj
// Source: C:\Copter\source\sparkal\version.cpp
// autogenerated by simcopter_tool from PDB file

// Type: unsigned long;

// Type: void * __ptr32;

// Type: uint32_t;

// Type: char;

// Type: void;

// Type: /*packed*/ class Version (forward reference);
// VTABLE: COPTER_D 0x0058f5b8
class Version{ // packed(0xc bytes) TI: 0x241c
public:
	void Version();
	virtual void ~Version(); // vtable+0x0
	int32_t GetApplicationName(char *&);
	long GetApplicationVersion(int32_t);
	int32_t GetApplicationVersion(char *&);
	int32_t GetApplicationCopyright(char *&);
	int32_t GetApplicationDebugVersion(char *&);
	// calltype: NearC
	static int32_t GetSystemType();
	// calltype: NearC
	static long GetSystemVersion(int32_t);
	// calltype: NearC
	static int32_t GetSystemVersion(char *);
	// calltype: NearC
	static long GetCPUVersion();
	// calltype: NearC
	static long GetCPUSpeed();
protected:
	/*+0x4*/   unsigned char * lpTransBlock;
	/*+0x8*/   void * __ptr32 lpFVData;
};

// Type: char *;

// Type: int32_t;

// Type: /*packed*/ struct tagVS_FIXEDFILEINFO (forward reference);
struct tagVS_FIXEDFILEINFO{ // packed(0x34 bytes) TI: 0x2aed
	/*+0x0*/   unsigned long dwSignature;
	/*+0x4*/   unsigned long dwStrucVersion;
	/*+0x8*/   unsigned long dwFileVersionMS;
	/*+0xc*/   unsigned long dwFileVersionLS;
	/*+0x10*/  unsigned long dwProductVersionMS;
	/*+0x14*/  unsigned long dwProductVersionLS;
	/*+0x18*/  unsigned long dwFileFlagsMask;
	/*+0x1c*/  unsigned long dwFileFlags;
	/*+0x20*/  unsigned long dwFileOS;
	/*+0x24*/  unsigned long dwFileType;
	/*+0x28*/  unsigned long dwFileSubtype;
	/*+0x2c*/  unsigned long dwFileDateMS;
	/*+0x30*/  unsigned long dwFileDateLS;
};

// Type: long;

// Type: /*packed*/ struct FREQ_INFO;
struct FREQ_INFO{ // packed(0x10 bytes) TI: 0x2a8f
	/*+0x0*/   unsigned long in_cycles;
	/*+0x4*/   unsigned long ex_ticks;
	/*+0x8*/   unsigned long raw_freq;
	/*+0xc*/   unsigned long norm_freq;
};



// Contribution: 1:0003cae0-0003d110 Module: 55, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x0043dae0
void Version::Version() {
	/*bp-0x104*/ char szFileName[260]; // 0x104 bytes
	/*bp-0x108*/ uint32_t nValueSize;
	/*bp-0x10c*/ unsigned long dwVersionInfoSize;
	/*bp-0x110*/ void * __ptr32 hModule;
	/*bp-0x114*/ unsigned long dwVersionInfoHandle;


	this-><vftable> = 0x58f5b8;
// LINE 31:
	this->lpFVData = 0x0;
// LINE 35:
	__asm        push   0;
	__asm        call   dword ptr ds:[0x6C363C];
	__asm        mov    hModule, eax;
// LINE 36:
	__asm        push   0x103;
	__asm        lea    eax, szFileName[0];
	__asm        push   eax;
	__asm        mov    eax, hModule;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3640];
// LINE 37:
	__asm        lea    eax, dwVersionInfoHandle;
	__asm        push   eax;
	__asm        lea    eax, szFileName[0];
	__asm        push   eax;
	__asm        call   0x004C468A;
	__asm        mov    dwVersionInfoSize, eax;
// LINE 38:
	__asm        cmp    dwVersionInfoSize, 0;
	__asm        je     _T120;
// LINE 39:
	__asm        mov    eax, dwVersionInfoSize;
	__asm        push   eax;
	__asm        call   operator new;
	__asm        add    esp, 4;
	__asm        mov    ecx, this;
	__asm        mov    [ecx+8], eax;
// LINE 40:
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        push   eax;
	__asm        mov    eax, dwVersionInfoSize;
	__asm        push   eax;
	__asm        mov    eax, dwVersionInfoHandle;
	__asm        push   eax;
	__asm        lea    eax, szFileName[0];
	__asm        push   eax;
	__asm        call   0x004C4684;
	__asm        test   eax, eax;
	__asm        je     _T120;
// LINE 42:
	__asm        lea    eax, nValueSize;
	__asm        push   eax;
	__asm        mov    eax, this;
	__asm        add    eax, 4;
	__asm        push   eax;
	__asm        push   0x598584;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        push   eax;
	__asm        call   0x004C467E;
	__asm        test   eax, eax;
	__asm        jne    _T120;
// LINE 44:
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        mov    [ebp-0x118], eax;
	__asm        mov    eax, [ebp-0x118];
	__asm        mov    [ebp-0x11C], eax;
	__asm        mov    eax, [ebp-0x11C];
	__asm        push   eax;
	__asm        call   operator delete;
	__asm        add    esp, 4;
// LINE 45:
	this->lpFVData = 0x0;
// LINE 50:
_T120:
	__asm        jmp    near ptr 0x0043DC05;

	__asm        mov    eax, this;
}

// FUNCTION: COPTER_D 0x0043dc10
void Version::~Version() {

	this-><vftable> = 0x58f5b8;
// LINE 59:
	__asm        mov    eax, this;
	__asm        cmp    dword ptr [eax+8], 0;
	__asm        je     _T3d;
// LINE 60:
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        mov    [ebp-4], eax;
	__asm        mov    eax, [ebp-4];
	__asm        mov    [ebp-8], eax;
	__asm        mov    eax, [ebp-8];
	__asm        push   eax;
	__asm        call   operator delete;
	__asm        add    esp, 4;
// LINE 62:
_T3d:
	__asm        jmp    near ptr 0x0043DC52;
}

// FUNCTION: COPTER_D 0x0043dc57
int32_t Version::GetApplicationName(char *& szName) {
	/*bp-0x4*/   uint32_t vSize;
	/*bp-0x8*/   int32_t nReturnValue;
	/*bp-0x108*/ char subBlockName[255]; // 0xff bytes

// LINE 80:
	__asm        mov    eax, this;
	__asm        cmp    dword ptr [eax+8], 0;
	__asm        jne    _T29;
// LINE 81:
	__asm        xor    eax, eax;
	__asm        jmp    _T8b;
// LINE 94:
_T29:
	__asm        push   0x5985A0;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+4];
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax+2];
	__asm        push   ecx;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+4];
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax];
	__asm        push   ecx;
	__asm        push   0x5985AC;
	__asm        lea    eax, subBlockName[0];
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3858];
	__asm        add    esp, 0x14;
// LINE 95:
	__asm        lea    eax, vSize;
	__asm        push   eax;
	__asm        mov    eax, szName;
	__asm        push   eax;
	__asm        lea    eax, subBlockName[0];
	__asm        push   eax;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        push   eax;
	__asm        call   0x004C467E;
	__asm        mov    nReturnValue, eax;
// LINE 96:
	__asm        mov    eax, nReturnValue;
	__asm        jmp    _T8b;
// LINE 98:
_T8b:
}

// FUNCTION: COPTER_D 0x0043dce9
int32_t Version::GetApplicationVersion(char *& szVersion) {
	/*bp-0x4*/   uint32_t vSize;
	/*bp-0x8*/   int32_t nReturnValue;
	/*bp-0x108*/ char subBlockName[255]; // 0xff bytes

// LINE 115:
	__asm        mov    eax, this;
	__asm        cmp    dword ptr [eax+8], 0;
	__asm        jne    _T29;
// LINE 116:
	__asm        xor    eax, eax;
	__asm        jmp    _T8b;
// LINE 117:
_T29:
	__asm        push   0x5985CC;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+4];
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax+2];
	__asm        push   ecx;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+4];
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax];
	__asm        push   ecx;
	__asm        push   0x5985D8;
	__asm        lea    eax, subBlockName[0];
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3858];
	__asm        add    esp, 0x14;
// LINE 118:
	__asm        lea    eax, vSize;
	__asm        push   eax;
	__asm        mov    eax, szVersion;
	__asm        push   eax;
	__asm        lea    eax, subBlockName[0];
	__asm        push   eax;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        push   eax;
	__asm        call   0x004C467E;
	__asm        mov    nReturnValue, eax;
// LINE 119:
	__asm        mov    eax, nReturnValue;
	__asm        jmp    _T8b;
// LINE 121:
_T8b:
}

// FUNCTION: COPTER_D 0x0043dd7b
int32_t Version::GetApplicationCopyright(char *& szCopyright) {
	/*bp-0x4*/   uint32_t vSize;
	/*bp-0x8*/   int32_t nReturnValue;
	/*bp-0x108*/ char subBlockName[255]; // 0xff bytes

// LINE 139:
	__asm        mov    eax, this;
	__asm        cmp    dword ptr [eax+8], 0;
	__asm        jne    _T29;
// LINE 140:
	__asm        xor    eax, eax;
	__asm        jmp    _T8b;
// LINE 141:
_T29:
	__asm        push   0x5985F8;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+4];
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax+2];
	__asm        push   ecx;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+4];
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax];
	__asm        push   ecx;
	__asm        push   0x598608;
	__asm        lea    eax, subBlockName[0];
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3858];
	__asm        add    esp, 0x14;
// LINE 142:
	__asm        lea    eax, vSize;
	__asm        push   eax;
	__asm        mov    eax, szCopyright;
	__asm        push   eax;
	__asm        lea    eax, subBlockName[0];
	__asm        push   eax;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        push   eax;
	__asm        call   0x004C467E;
	__asm        mov    nReturnValue, eax;
// LINE 143:
	__asm        mov    eax, nReturnValue;
	__asm        jmp    _T8b;
// LINE 145:
_T8b:
}

// FUNCTION: COPTER_D 0x0043de0d
int32_t Version::GetApplicationDebugVersion(char *& szVersion) {
	/*bp-0x4*/   uint32_t vSize;
	/*bp-0x8*/   int32_t nReturnValue;
	/*bp-0x108*/ char subBlockName[255]; // 0xff bytes

// LINE 162:
	__asm        mov    eax, this;
	__asm        cmp    dword ptr [eax+8], 0;
	__asm        jne    _T29;
// LINE 163:
	__asm        xor    eax, eax;
	__asm        jmp    _T8b;
// LINE 164:
_T29:
	__asm        push   0x598628;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+4];
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax+2];
	__asm        push   ecx;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+4];
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax];
	__asm        push   ecx;
	__asm        push   0x598638;
	__asm        lea    eax, subBlockName[0];
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3858];
	__asm        add    esp, 0x14;
// LINE 165:
	__asm        lea    eax, vSize;
	__asm        push   eax;
	__asm        mov    eax, szVersion;
	__asm        push   eax;
	__asm        lea    eax, subBlockName[0];
	__asm        push   eax;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        push   eax;
	__asm        call   0x004C467E;
	__asm        mov    nReturnValue, eax;
// LINE 166:
	__asm        mov    eax, nReturnValue;
	__asm        jmp    _T8b;
// LINE 168:
_T8b:
}

// FUNCTION: COPTER_D 0x0043de9f
long Version::GetApplicationVersion(int32_t nVersionComponent) {
	/*bp-0x4*/   uint32_t vSize;
	/*bp-0x8*/   /*packed*/ struct tagVS_FIXEDFILEINFO *vsFixedFileInfo;
	/*bp-0xc*/   int32_t nReturnValue;

// LINE 193:
	__asm        mov    eax, this;
	__asm        cmp    dword ptr [eax+8], 0;
	__asm        jne    _T20;
// LINE 194:
	__asm        xor    eax, eax;
	__asm        jmp    _Tdd;
// LINE 195:
_T20:
	__asm        lea    eax, vSize;
	__asm        push   eax;
	__asm        lea    eax, vsFixedFileInfo;
	__asm        push   eax;
	__asm        push   0x598658;
	__asm        mov    eax, this;
	__asm        mov    eax, [eax+8];
	__asm        push   eax;
	__asm        call   0x004C467E;
	__asm        mov    nReturnValue, eax;
// LINE 196:
	__asm        cmp    nReturnValue, 0;
	__asm        jne    _T50;
// LINE 197:
	__asm        mov    eax, 0xFFFFFFFF;
	__asm        jmp    _Tdd;
// LINE 198:
_T50:
	__asm        cmp    nVersionComponent, 0;
	__asm        jne    _T75;
// LINE 199:
	__asm        mov    eax, vsFixedFileInfo;
	__asm        mov    eax, [eax+8];
	__asm        shr    eax, 0x10;
	__asm        and    eax, 0xFFFF;
	__asm        movzx  eax, ax;
	__asm        jmp    _Tdd;
// LINE 200:
	__asm        jmp    _Td3;
_T75:
	__asm        cmp    nVersionComponent, 1;
	__asm        jne    _T94;
// LINE 201:
	__asm        mov    eax, vsFixedFileInfo;
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax+8];
	__asm        mov    eax, ecx;
	__asm        jmp    _Tdd;
// LINE 202:
	__asm        jmp    _Td3;
_T94:
	__asm        cmp    nVersionComponent, 2;
	__asm        jne    _Tb9;
// LINE 203:
	__asm        mov    eax, vsFixedFileInfo;
	__asm        mov    eax, [eax+0xC];
	__asm        shr    eax, 0x10;
	__asm        and    eax, 0xFFFF;
	__asm        movzx  eax, ax;
	__asm        jmp    _Tdd;
// LINE 204:
	__asm        jmp    _Td3;
_Tb9:
	__asm        cmp    nVersionComponent, 3;
	__asm        jne    _Td3;
// LINE 205:
	__asm        mov    eax, vsFixedFileInfo;
	__asm        xor    ecx, ecx;
	__asm        mov    cx, [eax+0xC];
	__asm        mov    eax, ecx;
	__asm        jmp    _Tdd;
// LINE 206:
_Td3:
	__asm        mov    eax, 0xFFFFFFFF;
	__asm        jmp    _Tdd;
// LINE 208:
_Tdd:
}

// FUNCTION: COPTER_D 0x0043df83
int32_t Version::GetSystemVersion(char * szSystemVersion) {
	/*bp-0x4*/   unsigned long dwVersion;

// LINE 232:
	__asm        call   dword ptr ds:[0x6C3644];
	__asm        mov    dwVersion, eax;
// LINE 234:
	__asm        cmp    dwVersion, 0x80000000;
	__asm        jae    _T42;
// LINE 238:
	__asm        xor    eax, eax;
	__asm        mov    al, *reinterpret_cast<uint8_t*>(reinterpret_cast<char*>(&dwVersion) + 1);
	__asm        push   eax;
	__asm        xor    eax, eax;
	__asm        mov    al, reinterpret_cast<uint8_t>(dwVersion);
	__asm        push   eax;
	__asm        push   0x59865C;
	__asm        mov    eax, szSystemVersion;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3858];
	__asm        add    esp, 0x10;
// LINE 240:
	__asm        jmp    _T60;
// LINE 244:
_T42:
	__asm        xor    eax, eax;
	__asm        mov    al, *reinterpret_cast<uint8_t*>(reinterpret_cast<char*>(&dwVersion) + 1);
	__asm        push   eax;
	__asm        xor    eax, eax;
	__asm        mov    al, reinterpret_cast<uint8_t>(dwVersion);
	__asm        push   eax;
	__asm        push   0x598670;
	__asm        mov    eax, szSystemVersion;
	__asm        push   eax;
	__asm        call   dword ptr ds:[0x6C3858];
	__asm        add    esp, 0x10;
// LINE 255:
_T60:
	__asm        mov    eax, 1;
	__asm        jmp    near ptr 0x0043DFED;
// LINE 256:
}

// FUNCTION: COPTER_D 0x0043dff2
int32_t Version::GetSystemType() {
	/*bp-0x4*/   unsigned long dwVersion;
	/*bp-0x8*/   int32_t nSystemType;

// LINE 268:
	nSystemType = 0x0;
// LINE 271:
	__asm        call   dword ptr ds:[0x6C3644];
	__asm        mov    dwVersion, eax;
// LINE 273:
	__asm        cmp    dwVersion, 0x80000000;
	__asm        jae    _T32;
// LINE 274:
	nSystemType = 0x4;
// LINE 275:
	__asm        jmp    _T39;
// LINE 276:
_T32:
	nSystemType = 0x3;
// LINE 285:
_T39:
	__asm        mov    eax, nSystemType;
	__asm        jmp    near ptr 0x0043E033;
// LINE 286:
}

// FUNCTION: COPTER_D 0x0043e038
long Version::GetSystemVersion(int32_t nVersionComponent) {
	/*bp-0x4*/   unsigned long dwVersion;

// LINE 307:
	__asm        call   dword ptr ds:[0x6C3644];
	__asm        mov    dwVersion, eax;
// LINE 309:
	__asm        cmp    nVersionComponent, 0;
	__asm        jne    _T2b;
// LINE 310:
	__asm        xor    eax, eax;
	__asm        mov    al, reinterpret_cast<uint8_t>(dwVersion);
	__asm        jmp    _T49;
// LINE 311:
	__asm        jmp    _T3f;
_T2b:
	__asm        cmp    nVersionComponent, 1;
	__asm        jne    _T3f;
// LINE 312:
	__asm        xor    eax, eax;
	__asm        mov    al, *reinterpret_cast<uint8_t*>(reinterpret_cast<char*>(&dwVersion) + 1);
	__asm        jmp    _T49;
// LINE 313:
_T3f:
	__asm        mov    eax, 0xFFFFFFFF;
	__asm        jmp    _T49;
// LINE 316:
_T49:
}

// FUNCTION: COPTER_D 0x0043e086
long Version::GetCPUVersion() {
	/*bp-0x4*/   long lReturnValue;

// LINE 339:
	__asm        call   wincpuid;
	__asm        movzx  eax, ax;
	__asm        mov    lReturnValue, eax;
// LINE 340:
	__asm        cmp    lReturnValue, 0xA;
	__asm        jle    _T25;
// LINE 341:
	lReturnValue = 0xa;
// LINE 342:
_T25:
	__asm        mov    eax, lReturnValue;
	__asm        jmp    near ptr 0x0043E0B3;
// LINE 344:
}

// FUNCTION: COPTER_D 0x0043e0b8
long Version::GetCPUSpeed() {
	/*bp-0x10*/  /*packed*/ struct FREQ_INFO tempFREQ_INFO; // 0x10 bytes

// LINE 360:
	__asm        push   0;
	__asm        lea    eax, [ebp-0x30];
	__asm        push   eax;
	__asm        call   cpuspeed;
	__asm        add    esp, 8;
	__asm        lea    ecx, [ebp-0x20];
	__asm        mov    edx, [eax];
	__asm        mov    [ecx], edx;
	__asm        mov    edx, [eax+4];
	__asm        mov    [ecx+4], edx;
	__asm        mov    edx, [eax+8];
	__asm        mov    [ecx+8], edx;
	__asm        mov    eax, [eax+0xC];
	__asm        mov    [ecx+0xC], eax;
	__asm        lea    eax, [ebp-0x20];
	__asm        lea    ecx, tempFREQ_INFO.in_cycles;
	__asm        mov    edx, [eax];
	__asm        mov    [ecx], edx;
	__asm        mov    edx, [eax+4];
	__asm        mov    [ecx+4], edx;
	__asm        mov    edx, [eax+8];
	__asm        mov    [ecx+8], edx;
	__asm        mov    eax, [eax+0xC];
	__asm        mov    [ecx+0xC], eax;
// LINE 361:
	__asm        mov    eax, tempFREQ_INFO.norm_freq;
	__asm        jmp    near ptr 0x0043E10C;
// LINE 363:
}



// Contribution: 1:0003d120-0003d158 Module: 55, 16 byte alignment, code, (comdat), execute, read, 
// FUNCTION: COPTER_D 0x0043e120
// Version::`scalar deleting destructor'



// Contribution: 2:000005b8-000005bb Module: 55, 4 byte alignment, initialized_data, (comdat), read, 
// vftable for Version @ 0x0058f5b8
//   00: Version::`scalar deleting destructor' @ 0x0043e120
//   1 entries



// Contribution: 3:00001584-0000167d Module: 55, 4 byte alignment, initialized_data, read, write, 
