// Module: Winwindo.obj
// Source: C:\Copter\source\sparkal\Winwindo.cpp
// autogenerated by simcopter_tool from PDB file

// Type: char;

// Type: int32_t;

// Type: void;

// Type: /*packed*/ class CSparkalWindow (forward reference);
// VTABLE: COPTER_D 0x00590ef8
class CSparkalWindow{ // packed(0x68 bytes) TI: 0x20d9
public:
	void CSparkalWindow(unsigned long, unsigned long, unsigned long, const /*packed*/ struct SparkalColor*, char *);
	void CSparkalWindow();
	virtual void ~CSparkalWindow(); // vtable+0x0
	void * __ptr32 GetPlatformData();
	long GetWidth();
	long GetHeight();
	virtual unsigned long GetClientSize(long *, long *); // vtable+0x4
	/*unpacked*/ class ScreenBuffer* GetBackBuffer();
	/*unpacked*/ class ScreenBuffer* SetBackBuffer(/*unpacked*/ class ScreenBuffer*);
	/*unpacked*/ class ICommander* GetCommander();
	/*unpacked*/ class ICommander* SetCommander(/*unpacked*/ class ICommander*);
	virtual unsigned long Draw(); // vtable+0x8
	virtual unsigned long SetCursor(unsigned long); // vtable+0xc
	virtual unsigned long SetCursorFromIndex(int32_t); // vtable+0x10
	virtual unsigned long LoadGameCursors(); // vtable+0x14
	virtual void FreeGameCursors(); // vtable+0x18
	unsigned long DrawBufferText(const const char*, unsigned long, long, long, long *, long *, long *, long *);
	virtual unsigned long Sleep(); // vtable+0x1c
	virtual unsigned long WakeUp(); // vtable+0x20
	unsigned long ScreenScroll(long, long, long, long, long, long);
	unsigned long RectSlideUp(long, long, long, long);
	virtual unsigned long SwapBuffer(long, long, long, long); // vtable+0x24
	virtual unsigned long SwapBuffer(); // vtable+0x28
	virtual void UpdatePalette(long, long, /*packed*/ struct SparkalColor*); // vtable+0x2c
protected:
	/*+0x4*/   long mHeight;
	/*+0x8*/   long mWidth;
	/*+0xc*/   unsigned long mStyle;
	/*+0x10*/  /*unpacked*/ class ICommander *mpCommander;
	/*+0x14*/  /*unpacked*/ class ScreenBuffer *mpBackBuffer;
	/*+0x18*/  void * __ptr32 mWindow;
	// calltype: NearStd
	virtual long MySparkalWindowProc(void * __ptr32, uint32_t, uint32_t, long); // vtable+0x30
	/*+0x1c*/  void * __ptr32 mPalette;
	/*+0x20*/  void * __ptr32 mhCurrentCursor;
	/*+0x24*/  void * __ptr32 mhCustomCursor;
	/*+0x28*/  void * __ptr32 mCursors[16]; // 0x40 bytes
};

// Type: unsigned long;

// Type: /*packed*/ struct SparkalColor (forward reference);
struct SparkalColor{ // packed(0x4 bytes) TI: 0x12ee
	/*+0x0*/   unsigned char Blue; // 0x1 bytes
	/*+0x1*/   unsigned char Green; // 0x1 bytes
	/*+0x2*/   unsigned char Red; // 0x1 bytes
	/*+0x3*/   unsigned char Padding; // 0x1 bytes
	void SparkalColor(unsigned char, unsigned char, unsigned char);
	void SparkalColor();
};

// Type: char *;

// Type: /*packed*/ struct tagRECT;
struct tagRECT{ // packed(0x10 bytes) TI: 0x13c4
	/*+0x0*/   long left;
	/*+0x4*/   long top;
	/*+0x8*/   long right;
	/*+0xc*/   long bottom;
};

// Type: /*packed*/ struct tagWNDCLASSA;
struct tagWNDCLASSA{ // packed(0x28 bytes) TI: 0x26d3
	/*+0x0*/   uint32_t style;
	/*+0x4*/   long (*lpfnWndProc)(void * __ptr32, uint32_t, uint32_t, long);
	/*+0x8*/   int32_t cbClsExtra;
	/*+0xc*/   int32_t cbWndExtra;
	/*+0x10*/  void * __ptr32 hInstance;
	/*+0x14*/  void * __ptr32 hIcon;
	/*+0x18*/  void * __ptr32 hCursor;
	/*+0x1c*/  void * __ptr32 hbrBackground;
	/*+0x20*/  char * lpszMenuName;
	/*+0x24*/  char * lpszClassName;
};

// Type: /*packed*/ struct CSparkalWindow::__ctor::__unnamed;
struct CSparkalWindow::__ctor::__unnamed{ // packed(0x404 bytes) TI: 0x26d4
	/*+0x0*/   unsigned short Version; // 0x2 bytes
	/*+0x2*/   unsigned short NumberOfEntries; // 0x2 bytes
	/*+0x4*/   /*packed*/ struct tagPALETTEENTRY aEntries[256]; // 0x400 bytes
};

// Type: void * __ptr32;

// Type: uint32_t;

// Type: long *;

// Type: long;

// Type: /*packed*/ struct tagSIZE;
struct tagSIZE{ // packed(0x8 bytes) TI: 0x21e7
	/*+0x0*/   long cx;
	/*+0x4*/   long cy;
};

// Type: /*packed*/ struct tagPALETTEENTRY (forward reference);
struct tagPALETTEENTRY{ // packed(0x4 bytes) TI: 0x1be6
	/*+0x0*/   unsigned char peRed; // 0x1 bytes
	/*+0x1*/   unsigned char peGreen; // 0x1 bytes
	/*+0x2*/   unsigned char peBlue; // 0x1 bytes
	/*+0x3*/   unsigned char peFlags; // 0x1 bytes
};

// Type: unsigned char;

// Type: /*packed*/ struct CheckIdentityPalette::__unnamed;
struct CheckIdentityPalette::__unnamed{ // packed(0x428 bytes) TI: 0x26d9
	/*+0x0*/   /*packed*/ struct tagBITMAPINFOHEADER Header; // 0x28 bytes
	/*+0x28*/  /*packed*/ struct tagRGBQUAD Colors[256]; // 0x400 bytes
};

// Type: /*packed*/ struct tagPAINTSTRUCT;
struct tagPAINTSTRUCT{ // packed(0x40 bytes) TI: 0x124b
	/*+0x0*/   void * __ptr32 hdc;
	/*+0x4*/   int32_t fErase;
	/*+0x8*/   /*packed*/ struct tagRECT rcPaint; // 0x10 bytes
	/*+0x18*/  int32_t fRestore;
	/*+0x1c*/  int32_t fIncUpdate;
	/*+0x20*/  unsigned char rgbReserved[32]; // 0x20 bytes
};



// Contribution: 1:0007f690-00080ad0 Module: 30, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00480690
void CSparkalWindow::CSparkalWindow() {
	/*bp-0x4*/   int32_t i;


	this-><vftable> = 0x590ef8;
// LINE 55:
	this->mpCommander = 0x0;
// LINE 56:
	this->mpBackBuffer = 0x0;
// LINE 57:
	this->mWindow = 0x0;
// LINE 58:
	this->mWidth = 0x0;
// LINE 59:
	this->mHeight = 0x0;
// LINE 60:
	this->mStyle = 0x0;
// LINE 61:
	this->mPalette = 0x0;
// LINE 62:
	this->mhCurrentCursor = 0x0;
// LINE 63:
	this->mhCustomCursor = 0x0;
// LINE 65:
	__asm        mov    i, 0;
	__asm        jmp    _T7e;
_T7b:
	i++;
_T7e:
	__asm        cmp    i, 0x10;
	__asm        jge    _T9b;
// LINE 66:
	__asm        mov    eax, i;
	__asm        mov    ecx, this;
	__asm        mov    dword ptr [ecx+eax*4+0x28], 0;
	__asm        jmp    _T7b;
// LINE 67:
_T9b:
	return;
_Ta0:
	__asm        mov    eax, this;
}

