// Module: lza.obj
// Source: C:\Copter\Source\Common\lza.cpp
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ class cGZXBitstream (forward reference);
// VTABLE: COPTER_D 0x005923f8
class cGZXBitstream{ // packed(0x4 bytes) TI: 0x2d06
public:
	virtual unsigned long Read(unsigned char *, unsigned long); // vtable+0x0
	virtual unsigned long Write(unsigned char *, unsigned long); // vtable+0x4
	virtual void Rewind(); // vtable+0x8
	virtual void RewindToMark(); // vtable+0xc
	virtual void Mark(); // vtable+0x10
	virtual long Size(); // vtable+0x14
	virtual void FreeAll(); // vtable+0x18
};

// Type: unsigned long *;

// Type: /*packed*/ struct tLZSSBinaryForest (forward reference);
struct tLZSSBinaryForest{ // packed(0xd44f bytes) TI: 0x2d0d
	/*+0x0*/   unsigned char text_buf[4155]; // 0x103b bytes
	/*+0x103b*/ long match_position;
	/*+0x103f*/ long match_length;
	/*+0x1043*/ long lson[4097]; // 0x4004 bytes
	/*+0x5047*/ long rson[4353]; // 0x4404 bytes
	/*+0x944b*/ long dad[4097]; // 0x4004 bytes
};

// Type: short;

// Type: /*packed*/ struct tCompressState (forward reference);
struct tCompressState{ // packed(0x20 bytes) TI: 0x2d08
	/*+0x0*/   unsigned long putBuffer;
	/*+0x4*/   unsigned long putMask;
	/*+0x8*/   unsigned long getBuffer;
	/*+0xc*/   unsigned long getMask;
	/*+0x10*/  unsigned long textsize;
	/*+0x14*/  unsigned long codesize;
	/*+0x18*/  /*packed*/ class cGZXBitstream *infile;
	/*+0x1c*/  /*packed*/ class cGZXBitstream *outfile;
};

// Type: unsigned char;

// Type: /*packed*/ struct tACompModel (forward reference);
struct tACompModel{ // packed(0x53c0 bytes) TI: 0x2d13
	/*+0x0*/   unsigned long low;
	/*+0x4*/   unsigned long high;
	/*+0x8*/   unsigned long value;
	/*+0xc*/   long shifts;
	/*+0x10*/  long char_to_sym[314]; // 0x4e8 bytes
	/*+0x4f8*/ long sym_to_char[315]; // 0x4ec bytes
	/*+0x9e4*/ unsigned long sym_freq[315]; // 0x4ec bytes
	/*+0xed0*/ unsigned long sym_cum[315]; // 0x4ec bytes
	/*+0x13bc*/ unsigned long position_cum[4097]; // 0x4004 bytes
};

// Type: long;

// Type: void;

// Type: unsigned char *;

// Type: unsigned long;



// Contribution: 1:000ce090-000cfa4b Module: 88, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004cf090
short LZACompress(/*packed*/ class cGZXBitstream *inStream, /*packed*/ class cGZXBitstream *outStream, unsigned long * cSize) {
	/*bp-0x4*/   /*packed*/ struct tACompModel *model;
	/*bp-0xc*/   unsigned char header[5]; // 0x5 bytes
	/*bp-0x10*/  /*packed*/ struct tCompressState *state;
	/*bp-0x14*/  short retVal;
	/*bp-0x18*/  /*packed*/ struct tLZSSBinaryForest *forest;

// LINE 648:
	__asm        mov    header[0], 0;
	__asm        mov    header[1], 0;
	__asm        mov    header[2], 0;
	__asm        mov    header[3], 0;
	__asm        mov    header[4], 0;
// LINE 653:
	__asm        mov    eax, cSize;
	__asm        mov    dword ptr [eax], 0;
// LINE 655:
	__asm        push   0x53C0;
