// Module: Mt.obj
// Source: C:\Copter\source\common\Mt.c
// autogenerated by simcopter_tool from PDB file

// Type: /*packed*/ struct Point3d;
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*unpacked*/ struct Point3d;
struct Point3d{ // not packed(0xc bytes) TI: 0x348f
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: /*packed*/ struct Point3d (forward reference);
struct Point3d{ // packed(0xc bytes) TI: 0x18b0
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
	/*+0x8*/   int32_t z;
};

// Type: double;

// Type: int32_t;

// Type: /*packed*/ struct Plane (forward reference);
struct Plane{ // packed(0x10 bytes) TI: 0x2e46
	/*+0x0*/   int32_t A;
	/*+0x4*/   int32_t B;
	/*+0x8*/   int32_t C;
	/*+0xc*/   int32_t D;
};

// Type: void;

// Type: /*packed*/ struct Plane;
struct Plane{ // packed(0x10 bytes) TI: 0x2e46
	/*+0x0*/   int32_t A;
	/*+0x4*/   int32_t B;
	/*+0x8*/   int32_t C;
	/*+0xc*/   int32_t D;
};

// Type: /*packed*/ struct mv (forward reference);
struct mv{ // packed(0x14 bytes) TI: 0x2a5e
	/*+0x0*/   int32_t M;
	/*+0x4*/   int32_t Vmag;
	/*+0x8*/   /*packed*/ struct Point3d V; // 0xc bytes
};

// Type: /*packed*/ struct Point2d (forward reference);
struct Point2d{ // packed(0x8 bytes) TI: 0x18b2
	/*+0x0*/   int32_t x;
	/*+0x4*/   int32_t y;
};



// Contribution: 1:000c90c0-000ca2a6 Module: 92, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004ca0c0
int32_t MTMagnitude(/*packed*/ struct Point3d *V) {
	/*bp-0x8*/   double i; // 0x8 bytes
	/*bp-0x10*/  double j; // 0x8 bytes
	/*bp-0x18*/  double k; // 0x8 bytes

// LINE 43:
	__asm        mov    eax, V;
	__asm        mov    eax, [eax];
	__asm        mov    [ebp-0x1C], eax;
	__asm        fild   dword ptr [ebp-0x1C];
	__asm        fdiv   qword ptr ds:[0x5923E8];
	__asm        fstp   i;
// LINE 44:
	__asm        mov    eax, V;
	__asm        mov    eax, [eax+4];
	__asm        mov    [ebp-0x20], eax;
	__asm        fild   dword ptr [ebp-0x20];
	__asm        fdiv   qword ptr ds:[0x5923E8];
	__asm        fstp   j;
// LINE 45:
	__asm        mov    eax, V;
	__asm        mov    eax, [eax+8];
	__asm        mov    [ebp-0x24], eax;
	__asm        fild   dword ptr [ebp-0x24];
	__asm        fdiv   qword ptr ds:[0x5923E8];
	__asm        fstp   k;
