// Module: S2global.obj
// Source: s2global.c
// autogenerated by simcopter_tool from PDB file

// Type: short;

// Type: unsigned short;

// Type: long;

// Type: unsigned char;

// Type: unsigned long;

// Type: /*packed*/ struct _rect (forward reference);
struct _rect{ // packed(0x8 bytes) TI: 0x2e1b
	/*+0x0*/   short Xmin; // 0x2 bytes
	/*+0x2*/   short Xmax; // 0x2 bytes
	/*+0x4*/   short Ymin; // 0x2 bytes
	/*+0x6*/   short Ymax; // 0x2 bytes
};

// Type: /*packed*/ struct S2Rect (forward reference);
struct S2Rect{ // packed(0x8 bytes) TI: 0x2e21
	/*+0x0*/   short top; // 0x2 bytes
	/*+0x2*/   short left; // 0x2 bytes
	/*+0x4*/   short bottom; // 0x2 bytes
	/*+0x6*/   short right; // 0x2 bytes
};



// Contribution: 3:00004550-00005167 Module: 90, 8 byte alignment, initialized_data, read, write, 
// GLOBAL: COPTER_D 0x0059b550
short GameSpeed = 3;

// GLOBAL: COPTER_D 0x0059b554
short NewDisaster = 0;

// GLOBAL: COPTER_D 0x0059b558
short DisasterObject = -1;

// GLOBAL: COPTER_D 0x0059b55c
unsigned short AutoBudget = 0;

// GLOBAL: COPTER_D 0x0059b560
unsigned short AutoGo = 1;

// GLOBAL: COPTER_D 0x0059b564
unsigned short UserSoundOn = 1;

// GLOBAL: COPTER_D 0x0059b568
unsigned short UserMusicOn = 0;

// GLOBAL: COPTER_D 0x0059b56c
unsigned short NoDisasters = 0;

// GLOBAL: COPTER_D 0x0059b570
short VMax[8] = {2000, 1500, 1500, 1000, 1000, 500, 1000, 1000};

// GLOBAL: COPTER_D 0x0059b580
long simCycle = 1;

// GLOBAL: COPTER_D 0x0059b584
short baseYear = 2000;

// GLOBAL: COPTER_D 0x0059b588
