// Module: S2lodsav.obj
// Source: C:\Copter\source\common\S2lodsav.c
// autogenerated by simcopter_tool from PDB file

// Type: void * __ptr32;

// Type: long;

// Type: short;

// Type: char *;

// Type: int32_t;

// Type: /*packed*/ struct _iobuf (forward reference);
struct _iobuf{ // packed(0x20 bytes) TI: 0x2278
	/*+0x0*/   char * _ptr;
	/*+0x4*/   int32_t _cnt;
	/*+0x8*/   char * _base;
	/*+0xc*/   int32_t _flag;
	/*+0x10*/  int32_t _file;
	/*+0x14*/  int32_t _charbuf;
	/*+0x18*/  int32_t _bufsiz;
	/*+0x1c*/  char * _tmpfname;
};

// Type: unsigned short;

// Type: char;

// Type: void;

// Type: uint32_t;

// Type: long *;

// Type: unsigned char;

// Type: /*packed*/ struct Micro (forward reference);
struct Micro{ // packed(0x8 bytes) TI: 0x2d4d
	/*+0x0*/   unsigned char type; // 0x1 bytes
	/*+0x1*/   unsigned char stat0; // 0x1 bytes
	/*+0x2*/   unsigned short stat1; // 0x2 bytes
	/*+0x4*/   unsigned short stat2; // 0x2 bytes
	/*+0x6*/   unsigned short stat3; // 0x2 bytes
};

// Type: short *;

// Type: unsigned char *;

// Type: unsigned short *;

// Type: unsigned long;



// Contribution: 1:000c3690-000c8acf Module: 94, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004c4690
int32_t S2CityValidate(char * filepath) {
	/*bp-0x4*/   long lChunkType;
	/*bp-0x8*/   long lChunkDataSize;
	/*bp-0xc*/   /*packed*/ struct _iobuf *filNum;
	/*bp-0x10*/  long lFileLength;
	/*bp-0x14*/  long lCityDataChunkLength;
	/*bp-0x18*/  int32_t bOK;
	/*bp-0x1c*/  long lBytesReadSoFar;

// LINE 115:
	__asm        push   0x59AFF0;
	__asm        mov    eax, filepath;
	__asm        push   eax;
	__asm        call   fopen;
	__asm        add    esp, 8;
	__asm        mov    filNum, eax;
	__asm        cmp    filNum, 0;
	__asm        jne    _T2e;
// LINE 116:
	return 0x0;
// LINE 119:
_T2e:
	__asm        push   2;
	__asm        push   0;
	__asm        mov    eax, filNum;
	__asm        push   eax;
