// Module: scxload.obj
// Source: C:\Copter\Source\Common\scxload.cpp
// autogenerated by simcopter_tool from PDB file

// Type: unsigned char *;

// Type: void;

// Type: /*packed*/ class cLZAPFileBitStream (forward reference);
// VTABLE: COPTER_D 0x00592418
class cLZAPFileBitStream : public cGZXBitstream
{ // packed(0xc bytes) TI: 0x2d27
public:
	void cLZAPFileBitStream();
	void ~cLZAPFileBitStream();
	virtual int32_t OpenRead(char *); // vtable+0x1c
	virtual void Close(); // vtable+0x20
	virtual unsigned long Read(unsigned char *, unsigned long) /* override */;
	virtual unsigned long Write(unsigned char *, unsigned long) /* override */;
	virtual void Rewind() /* override */;
	virtual void RewindToMark() /* override */;
	virtual void Mark() /* override */;
	virtual long Size() /* override */;
	virtual void FreeAll() /* override */;
private:
	/*+0x4*/   /*packed*/ class PFile *m_file;
	/*+0x8*/   unsigned long m_mark;
};

// Type: char *;

// Type: int32_t;

// Type: unsigned long;

// Type: long;

// Type: /*packed*/ class cGZXBitstream (forward reference);
// VTABLE: COPTER_D 0x005923f8
class cGZXBitstream{ // packed(0x4 bytes) TI: 0x2d06
public:
	virtual unsigned long Read(unsigned char *, unsigned long); // vtable+0x0
	virtual unsigned long Write(unsigned char *, unsigned long); // vtable+0x4
	virtual void Rewind(); // vtable+0x8
	virtual void RewindToMark(); // vtable+0xc
	virtual void Mark(); // vtable+0x10
	virtual long Size(); // vtable+0x14
	virtual void FreeAll(); // vtable+0x18
};

// Type: /*packed*/ struct SCXNeighborData (forward reference);
struct SCXNeighborData{ // packed(0x2e bytes) TI: 0x2d72
	/*+0x0*/   char name[32]; // 0x20 bytes
	/*+0x20*/  short nameIndex; // 0x2 bytes
	/*+0x22*/  unsigned long val;
	/*+0x26*/  unsigned long pop;
	/*+0x2a*/  unsigned long fame;
};

// Type: /*packed*/ class cLZAPFileBitStream;
// VTABLE: COPTER_D 0x00592418
class cLZAPFileBitStream : public cGZXBitstream
{ // packed(0xc bytes) TI: 0x2d27
public:
	void cLZAPFileBitStream();
	void ~cLZAPFileBitStream();
	virtual int32_t OpenRead(char *); // vtable+0x1c
	virtual void Close(); // vtable+0x20
	virtual unsigned long Read(unsigned char *, unsigned long) /* override */;
	virtual unsigned long Write(unsigned char *, unsigned long) /* override */;
	virtual void Rewind() /* override */;
	virtual void RewindToMark() /* override */;
	virtual void Mark() /* override */;
	virtual long Size() /* override */;
	virtual void FreeAll() /* override */;
private:
	/*+0x4*/   /*packed*/ class PFile *m_file;
	/*+0x8*/   unsigned long m_mark;
};

// Type: /*packed*/ struct ReadSCXFile::__unnamed;
struct ReadSCXFile::__unnamed{ // packed(0x9 bytes) TI: 0x2d29
	/*+0x0*/   unsigned char type; // 0x1 bytes
	/*+0x1*/   unsigned char owner; // 0x1 bytes
	/*+0x2*/   unsigned char stat0; // 0x1 bytes
	/*+0x3*/   short stat1; // 0x2 bytes
	/*+0x5*/   short stat2; // 0x2 bytes
	/*+0x7*/   short stat3; // 0x2 bytes
};

// Type: /*packed*/ class cGZXParamBitstream<t_alloc,t_free>;
class cGZXParamBitstream<t_alloc,t_free> : public cGZXBitstream
{ // packed(0x3c bytes) TI: 0x2d3d
protected:
	/*+0x4*/   unsigned long curPos;
	/*+0x8*/   unsigned long markPos;
	/*+0xc*/   short nodeNo; // 0x2 bytes
	/*+0xe*/   short markNode; // 0x2 bytes
	/*+0x10*/  short maxNode; // 0x2 bytes
	/*+0x12*/  unsigned long maxPos;
	using tNodeList = /*packed*/ class vector<tGZXBitstreamNode>;
protected:
	/*+0x16*/  /*packed*/ class vector<tGZXBitstreamNode> nodeList; // 0xc bytes
	/*+0x22*/  /*packed*/ struct t_alloc m_rawAllocate; // 0x1 bytes
	/*+0x23*/  /*packed*/ struct t_free m_rawFree; // 0x1 bytes
	class cGZXParamBitstream<t_alloc,t_free>::stream_iterator{ // packed(0xa bytes) TI: 0x2d64
	public:
		void stream_iterator(/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		void stream_iterator(/*packed*/ class cGZXParamBitstream<t_alloc,t_free>*, short, unsigned long);
		void stream_iterator();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& operator=(const /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		int32_t operator==(const /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		unsigned char& operator*();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& operator++();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator operator++(int32_t);
	private:
		/*+0x0*/   /*packed*/ class cGZXParamBitstream<t_alloc,t_free> *m_stream;
		/*+0x4*/   /*packed*/ class CPropertyType<unsigned long> m_pos;
		/*+0x8*/   /*packed*/ class CPropertyType<short> m_node; // 0x2 bytes
	};
	class cGZXParamBitstream<t_alloc,t_free>::stream_iterator{ // packed(0xa bytes) TI: 0x2d64
	public:
		void stream_iterator(/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		void stream_iterator(/*packed*/ class cGZXParamBitstream<t_alloc,t_free>*, short, unsigned long);
		void stream_iterator();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& operator=(const /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		int32_t operator==(const /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		unsigned char& operator*();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& operator++();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator operator++(int32_t);
	private:
		/*+0x0*/   /*packed*/ class cGZXParamBitstream<t_alloc,t_free> *m_stream;
		/*+0x4*/   /*packed*/ class CPropertyType<unsigned long> m_pos;
		/*+0x8*/   /*packed*/ class CPropertyType<short> m_node; // 0x2 bytes
	};
public:
	/*+0x24*/  /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator starting_iterator; // 0xa bytes
	/*+0x2e*/  /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator ending_iterator; // 0xa bytes
	/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& begin();
	/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& end();
	void cGZXParamBitstream<t_alloc,t_free>(/*packed*/ struct tGZXBitstreamNode*);
	void cGZXParamBitstream<t_alloc,t_free>(uint32_t);
	void ~cGZXParamBitstream<t_alloc,t_free>();
	virtual void FreeAll() /* override */;
	virtual unsigned long Read(unsigned char *, unsigned long) /* override */;
	virtual unsigned long Write(unsigned char *, unsigned long) /* override */;
	virtual void Rewind() /* override */;
	virtual void RewindToMark() /* override */;
	virtual void Mark() /* override */;
	virtual long Size() /* override */;
	/*+0x38*/  /*packed*/ class CPropertyType<long> PageSize;
};

// Type: /*packed*/ struct tSCXSaveFileHdr;
struct tSCXSaveFileHdr{ // packed(0x2c bytes) TI: 0x2d3f
	/*+0x0*/   char type[4];
	/*+0x4*/   char product[32]; // 0x20 bytes
	/*+0x24*/  long version;
	/*+0x28*/  long time;
};

// Type: /*packed*/ class vector<tGZXBitstreamNode> (forward reference);
class vector<tGZXBitstreamNode>{ // packed(0xc bytes) TI: 0x2da6
	using vector_allocator = /*packed*/ class allocator<tGZXBitstreamNode>;
	using value_type = /*packed*/ struct tGZXBitstreamNode;
	using pointer = /*packed*/ struct tGZXBitstreamNode*;
	using iterator = /*packed*/ struct tGZXBitstreamNode*;
	using const_iterator = const /*packed*/ struct tGZXBitstreamNode*;
	using reference = /*packed*/ struct tGZXBitstreamNode&;
	using const_reference = const /*packed*/ struct tGZXBitstreamNode&;
	using size_type = uint32_t;
	using difference_type = int32_t;
	using const_reverse_iterator = /*unpacked*/ class reverse_iterator<tGZXBitstreamNode const *,tGZXBitstreamNode,tGZXBitstreamNode const &,int>;
	using reverse_iterator = /*unpacked*/ class reverse_iterator<tGZXBitstreamNode *,tGZXBitstreamNode,tGZXBitstreamNode &,int>;
protected:
	static /*packed*/ class allocator<tGZXBitstreamNode> static_allocator;
	/*+0x0*/   /*packed*/ struct tGZXBitstreamNode *start;
	/*+0x4*/   /*packed*/ struct tGZXBitstreamNode *finish;
	/*+0x8*/   /*packed*/ struct tGZXBitstreamNode *end_of_storage;
	void insert_aux(/*packed*/ struct tGZXBitstreamNode*, const /*packed*/ struct tGZXBitstreamNode&);
public:
	const /*packed*/ struct tGZXBitstreamNode* begin();
	/*packed*/ struct tGZXBitstreamNode* begin();
	const /*packed*/ struct tGZXBitstreamNode* end();
	/*packed*/ struct tGZXBitstreamNode* end();
	/*unpacked*/ class reverse_iterator<tGZXBitstreamNode const *,tGZXBitstreamNode,tGZXBitstreamNode const &,int> rbegin();
	/*unpacked*/ class reverse_iterator<tGZXBitstreamNode *,tGZXBitstreamNode,tGZXBitstreamNode &,int> rbegin();
	/*unpacked*/ class reverse_iterator<tGZXBitstreamNode const *,tGZXBitstreamNode,tGZXBitstreamNode const &,int> rend();
	/*unpacked*/ class reverse_iterator<tGZXBitstreamNode *,tGZXBitstreamNode,tGZXBitstreamNode &,int> rend();
	uint32_t size();
	uint32_t max_size();
	uint32_t capacity();
	int32_t empty();
	const /*packed*/ struct tGZXBitstreamNode& operator[](uint32_t);
	/*packed*/ struct tGZXBitstreamNode& operator[](uint32_t);
	void vector<tGZXBitstreamNode>(const /*packed*/ struct tGZXBitstreamNode*, const /*packed*/ struct tGZXBitstreamNode*);
	void vector<tGZXBitstreamNode>(const /*packed*/ class vector<tGZXBitstreamNode>&);
	void vector<tGZXBitstreamNode>(uint32_t, const /*packed*/ struct tGZXBitstreamNode&);
	void vector<tGZXBitstreamNode>();
	void ~vector<tGZXBitstreamNode>();
	/*packed*/ class vector<tGZXBitstreamNode>& operator=(const /*packed*/ class vector<tGZXBitstreamNode>&);
	void reserve(uint32_t);
	const /*packed*/ struct tGZXBitstreamNode& front();
	/*packed*/ struct tGZXBitstreamNode& front();
	const /*packed*/ struct tGZXBitstreamNode& back();
	/*packed*/ struct tGZXBitstreamNode& back();
	void push_back(const /*packed*/ struct tGZXBitstreamNode&);
	void swap(/*packed*/ class vector<tGZXBitstreamNode>&);
	void insert(/*packed*/ struct tGZXBitstreamNode*, uint32_t, const /*packed*/ struct tGZXBitstreamNode&);
	void insert(/*packed*/ struct tGZXBitstreamNode*, const /*packed*/ struct tGZXBitstreamNode*, const /*packed*/ struct tGZXBitstreamNode*);
	/*packed*/ struct tGZXBitstreamNode* insert(/*packed*/ struct tGZXBitstreamNode*, const /*packed*/ struct tGZXBitstreamNode&);
	void pop_back();
	void erase(/*packed*/ struct tGZXBitstreamNode*, /*packed*/ struct tGZXBitstreamNode*);
	void erase(/*packed*/ struct tGZXBitstreamNode*);
};

// Type: uint32_t;

// Type: /*packed*/ class cGZXParamBitstream<t_alloc,t_free> (forward reference);
class cGZXParamBitstream<t_alloc,t_free> : public cGZXBitstream
{ // packed(0x3c bytes) TI: 0x2d3d
protected:
	/*+0x4*/   unsigned long curPos;
	/*+0x8*/   unsigned long markPos;
	/*+0xc*/   short nodeNo; // 0x2 bytes
	/*+0xe*/   short markNode; // 0x2 bytes
	/*+0x10*/  short maxNode; // 0x2 bytes
	/*+0x12*/  unsigned long maxPos;
	using tNodeList = /*packed*/ class vector<tGZXBitstreamNode>;
protected:
	/*+0x16*/  /*packed*/ class vector<tGZXBitstreamNode> nodeList; // 0xc bytes
	/*+0x22*/  /*packed*/ struct t_alloc m_rawAllocate; // 0x1 bytes
	/*+0x23*/  /*packed*/ struct t_free m_rawFree; // 0x1 bytes
	class cGZXParamBitstream<t_alloc,t_free>::stream_iterator{ // packed(0xa bytes) TI: 0x2d64
	public:
		void stream_iterator(/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		void stream_iterator(/*packed*/ class cGZXParamBitstream<t_alloc,t_free>*, short, unsigned long);
		void stream_iterator();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& operator=(const /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		int32_t operator==(const /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		unsigned char& operator*();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& operator++();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator operator++(int32_t);
	private:
		/*+0x0*/   /*packed*/ class cGZXParamBitstream<t_alloc,t_free> *m_stream;
		/*+0x4*/   /*packed*/ class CPropertyType<unsigned long> m_pos;
		/*+0x8*/   /*packed*/ class CPropertyType<short> m_node; // 0x2 bytes
	};
	class cGZXParamBitstream<t_alloc,t_free>::stream_iterator{ // packed(0xa bytes) TI: 0x2d64
	public:
		void stream_iterator(/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		void stream_iterator(/*packed*/ class cGZXParamBitstream<t_alloc,t_free>*, short, unsigned long);
		void stream_iterator();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& operator=(const /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		int32_t operator==(const /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator&);
		unsigned char& operator*();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& operator++();
		/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator operator++(int32_t);
	private:
		/*+0x0*/   /*packed*/ class cGZXParamBitstream<t_alloc,t_free> *m_stream;
		/*+0x4*/   /*packed*/ class CPropertyType<unsigned long> m_pos;
		/*+0x8*/   /*packed*/ class CPropertyType<short> m_node; // 0x2 bytes
	};
public:
	/*+0x24*/  /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator starting_iterator; // 0xa bytes
	/*+0x2e*/  /*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator ending_iterator; // 0xa bytes
	/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& begin();
	/*packed*/ class cGZXParamBitstream<t_alloc,t_free>::stream_iterator& end();
	void cGZXParamBitstream<t_alloc,t_free>(/*packed*/ struct tGZXBitstreamNode*);
	void cGZXParamBitstream<t_alloc,t_free>(uint32_t);
	void ~cGZXParamBitstream<t_alloc,t_free>();
	virtual void FreeAll() /* override */;
	virtual unsigned long Read(unsigned char *, unsigned long) /* override */;
	virtual unsigned long Write(unsigned char *, unsigned long) /* override */;
	virtual void Rewind() /* override */;
	virtual void RewindToMark() /* override */;
	virtual void Mark() /* override */;
	virtual long Size() /* override */;
	/*+0x38*/  /*packed*/ class CPropertyType<long> PageSize;
};

// Type: /*packed*/ struct tGZXBitstreamNode (forward reference);
struct tGZXBitstreamNode{ // packed(0x8 bytes) TI: 0x2d18
	/*+0x0*/   unsigned char * data;
	/*+0x4*/   unsigned long size;
	void tGZXBitstreamNode(unsigned char *, unsigned long);
};

// Type: /*packed*/ class cGZXBitstream;
// VTABLE: COPTER_D 0x005923f8
class cGZXBitstream{ // packed(0x4 bytes) TI: 0x2d06
public:
	virtual unsigned long Read(unsigned char *, unsigned long); // vtable+0x0
	virtual unsigned long Write(unsigned char *, unsigned long); // vtable+0x4
	virtual void Rewind(); // vtable+0x8
	virtual void RewindToMark(); // vtable+0xc
	virtual void Mark(); // vtable+0x10
	virtual long Size(); // vtable+0x14
	virtual void FreeAll(); // vtable+0x18
};



// Contribution: 1:000ca880-000cc535 Module: 89, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x004cb880
void cLZAPFileBitStream::cLZAPFileBitStream() {

	__asm        mov    eax, this;
	__asm        mov    dword ptr [eax], 0x5923F8;
	__asm        jmp    near ptr 0x004CB89A;

	this-><cLZAPFileBitStream+0x00> = 0x592418;
// LINE 86:
	this->m_file = 0x0;
// LINE 87:
	this->m_mark = 0x0;
// LINE 88:
