// Module: Animutil.obj
// Source: C:\Copter\Source\X\Animutil.cpp
// autogenerated by simcopter_tool from PDB file

// Type: float;

// Type: /*unpacked*/ struct DXZY;
struct DXZY{ // not packed(0x10 bytes) TI: 0x3420
	/*+0x0*/   float x;
	/*+0x4*/   float z;
	/*+0x8*/   float y;
	/*+0xc*/   float info;
};

// Type: /*unpacked*/ struct DXZY (forward reference);
struct DXZY{ // not packed(0x10 bytes) TI: 0x3420
	/*+0x0*/   float x;
	/*+0x4*/   float z;
	/*+0x8*/   float y;
	/*+0xc*/   float info;
};

// Type: void;

// Type: short;

// Type: unsigned short;

// Type: /*unpacked*/ struct XZY (forward reference);
struct XZY{ // not packed(0x8 bytes) TI: 0x3508
	/*+0x0*/   short x; // 0x2 bytes
	/*+0x2*/   short z; // 0x2 bytes
	/*+0x4*/   short y; // 0x2 bytes
	/*+0x6*/   short _win8pad; // 0x2 bytes
};

// Type: float *;

// Type: short *;

// Type: /*unpacked*/ struct Polar (forward reference);
struct Polar{ // not packed(0x18 bytes) TI: 0x34dc
	/*+0x0*/   float phi;
	/*+0x4*/   float psi;
	/*+0x8*/   float tau;
	/*+0xc*/   float _win8pad;
	/*+0x10*/  short lng; // 0x2 bytes
	/*+0x12*/  short lat; // 0x2 bytes
	/*+0x14*/  short trq; // 0x2 bytes
	/*+0x16*/  short _win8pad2; // 0x2 bytes
};

// Type: /*unpacked*/ struct Polar;
struct Polar{ // not packed(0x18 bytes) TI: 0x34dc
	/*+0x0*/   float phi;
	/*+0x4*/   float psi;
	/*+0x8*/   float tau;
	/*+0xc*/   float _win8pad;
	/*+0x10*/  short lng; // 0x2 bytes
	/*+0x12*/  short lat; // 0x2 bytes
	/*+0x14*/  short trq; // 0x2 bytes
	/*+0x16*/  short _win8pad2; // 0x2 bytes
};

// Type: double;

// Type: /*unpacked*/ struct Rect (forward reference);
struct Rect{ // not packed(0x8 bytes) TI: 0x3463
	/*+0x0*/   short top; // 0x2 bytes
	/*+0x2*/   short left; // 0x2 bytes
	/*+0x4*/   short bottom; // 0x2 bytes
	/*+0x6*/   short right; // 0x2 bytes
};

// Type: /*unpacked*/ struct Point (forward reference);
struct Point{ // not packed(0x4 bytes) TI: 0x341c
	/*+0x0*/   short v; // 0x2 bytes
	/*+0x2*/   short h; // 0x2 bytes
};

// Type: /*unpacked*/ struct Point;
struct Point{ // not packed(0x4 bytes) TI: 0x341c
	/*+0x0*/   short v; // 0x2 bytes
	/*+0x2*/   short h; // 0x2 bytes
};

// Type: /*unpacked*/ struct Rect;
struct Rect{ // not packed(0x8 bytes) TI: 0x3463
	/*+0x0*/   short top; // 0x2 bytes
	/*+0x2*/   short left; // 0x2 bytes
	/*+0x4*/   short bottom; // 0x2 bytes
	/*+0x6*/   short right; // 0x2 bytes
};

// Type: unsigned long;

// Type: enum UseDrawGrid;
enum UseDrawGrid {
	kReturnPosition = 0,
	kActuallyDrawGrid = 1,
};

// Type: void * __ptr32;



// Contribution: 1:00161610-00162e95 Module: 187, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00562610
void GetAxis(float XY2Par, float XZ2Par, /*unpacked*/ struct DXZY paraxis, /*unpacked*/ struct DXZY *childaxis) {
// LINE 47:
	__asm        mov    eax, childaxis;
	__asm        push   eax;
	__asm        mov    eax, paraxis.info;
	__asm        push   eax;
	__asm        mov    eax, paraxis.y;
	__asm        push   eax;
	__asm        mov    eax, paraxis.z;
	__asm        push   eax;
	__asm        mov    eax, paraxis.x;
	__asm        push   eax;
	__asm        fld    XZ2Par;
	__asm        sub    esp, 8;
	__asm        fstp   qword ptr [esp];
	__asm        call   0x0056F32A;
	__asm        add    esp, 8;
	__asm        sub    esp, 4;
	__asm        fstp   dword ptr [esp];
