// Module: Array2d.obj
// Source: C:\Copter\Source\X\Array2d.cpp
// autogenerated by simcopter_tool from PDB file

// Type: unsigned short;

// Type: /*unpacked*/ class _cArray (forward reference);
// VTABLE: COPTER_D 0x00593738
class _cArray{ // not packed(0x50 bytes) TI: 0x3254
	using ArrayName = unsigned char[16];
	using TinyName = unsigned long;
	using FileNameStr = unsigned char[16];
	enum /* __unnamed */ {
		kHeaderSize = 8,
		kMaxArrays = 1024,
		kMaxLoadable = 64,
		kFileNameLength = 15,
		kArrayNameLength = 15,
	};
	struct _cArray::FileAndType{ // not packed(0x8 bytes) TI: 0x3256
		/*+0x0*/   /*unpacked*/ class ResFile *file;
		/*+0x4*/   unsigned long type;
	};
	struct _cArray::Header{ // not packed(0x8 bytes) TI: 0x32ad
		/*+0x0*/   short entrySize; // 0x2 bytes
		/*+0x2*/   short xSize; // 0x2 bytes
		/*+0x4*/   short ySize; // 0x2 bytes
		/*+0x6*/   short _pad; // 0x2 bytes
	};
public:
	static /*unpacked*/ class _cArray **sArrayTable;
	// calltype: NearC
	static void MakeTable();
	// calltype: NearC
	static void DeleteTable();
private:
	void CheckIntoTable();
	unsigned short SetSize(long, long);
	void SetXPointers();
	void FillHeader();
	void SetSizeAndHeaders(long, long);
	unsigned char * _GetPointer(long, long);
protected:
	/*+0x4*/   void * __ptr32 *fData;
public:
	/*+0x8*/   void * __ptr32 fDataHandle;
	/*+0xc*/   unsigned char * fDataPtr;
	/*+0x10*/  long fySize;
	/*+0x14*/  long fxSize;
	/*+0x18*/  long fEntrySize;
protected:
	/*+0x1c*/  unsigned long fDataHandleSize;
	/*+0x20*/  short fResID; // 0x2 bytes
	/*+0x22*/  short _pad; // 0x2 bytes
	/*+0x24*/  /*unpacked*/ class ResFile *fFile;
	/*+0x28*/  unsigned long fType;
	/*+0x2c*/  unsigned char fFileName[16]; // 0x10 bytes
	/*+0x3c*/  unsigned char fName[16]; // 0x10 bytes
	/*+0x4c*/  unsigned long fTinyName;
	static /*unpacked*/ struct _cArray::FileAndType fsLoaded[64];
public:
	void _cArray(long, long, long, unsigned long, /*unpacked*/ class ResFile*, unsigned long);
	void _cArray(long, long, long, unsigned char *, /*unpacked*/ class ResFile*, unsigned long);
protected:
	void _cArray(void * __ptr32, /*unpacked*/ class ResFile*, long, void (*)(void * __ptr32, long));
private:
	void BeginCreate(long, long, long, unsigned char *, /*unpacked*/ class ResFile*, unsigned long);
	void FromDiskCreate(void * __ptr32, /*unpacked*/ class ResFile*, long, void (*)(void * __ptr32, long));
public:
	unsigned long GetName();
	void GetName(unsigned char *);
	// calltype: NearC
	static /*unpacked*/ class _cArray* GetArray(unsigned long, short);
	// calltype: NearC
	static /*unpacked*/ class _cArray* GetArrayByType(unsigned long, short);
	// calltype: NearC
	static short GetArrayIndexInType(/*unpacked*/ class _cArray*);
	// calltype: NearC
	static short GetNumArraysByType(unsigned long);
	// calltype: NearC
	static short GetLoadedIndex(/*unpacked*/ class ResFile*, unsigned long);
	// calltype: NearC
	static void LoadAllArrays(/*unpacked*/ class ResFile*, unsigned long, short, void (*)(void * __ptr32, long));
	static unsigned short sAllLoaded;
	// calltype: NearC
	static void DeleteAllArrays();
	void ClearBytes(signed char);
	short InsertRow(short);
	short InsertColumn(short);
	short DeleteRow(short);
	short DeleteColumn(short);
	unsigned short Resize(long, long, signed char);
	virtual void WriteToDisk(); // vtable+0x0
	void CopyFrom(/*unpacked*/ class _cArray*);
	void CopyFrom(unsigned long);
	void CopyFrom(unsigned char *);
	void CopyToByFTN(/*unpacked*/ class ResFile*, unsigned long, unsigned char *);
	void CopyTo(/*unpacked*/ class _cArray*);
	void CopyTo(unsigned long);
	void CopyTo(unsigned char *);
	void ~_cArray();
	void DeleteResource();
	// calltype: NearC
	static unsigned short IsNameTaken(unsigned long, short);
};

// Type: /*unpacked*/ struct _cArray::FileAndType (forward reference);
struct _cArray::FileAndType{ // not packed(0x8 bytes) TI: 0x3256
	/*+0x0*/   /*unpacked*/ class ResFile *file;
	/*+0x4*/   unsigned long type;
};

// Type: /*unpacked*/ class ResFile (forward reference);
// VTABLE: COPTER_D 0x00593518
class ResFile : public FlatResFile
{ // not packed(0x11c bytes) TI: 0x3334
public:
	long OpenFromOtherFile(/*unpacked*/ class ResFile*);
};

// Type: void * __ptr32;

// Type: long;

// Type: void (void * __ptr32, long);

// Type: signed char *;

// Type: /*unpacked*/ struct _cArray::Header (forward reference);
struct _cArray::Header{ // not packed(0x8 bytes) TI: 0x32ad
	/*+0x0*/   short entrySize; // 0x2 bytes
	/*+0x2*/   short xSize; // 0x2 bytes
	/*+0x4*/   short ySize; // 0x2 bytes
	/*+0x6*/   short _pad; // 0x2 bytes
};

// Type: unsigned char;

// Type: void;

// Type: unsigned char *;

// Type: unsigned long;

// Type: signed char;

// Type: short;

// Type: /*unpacked*/ class _cArray;
// VTABLE: COPTER_D 0x00593738
class _cArray{ // not packed(0x50 bytes) TI: 0x3254
	using ArrayName = unsigned char[16];
	using TinyName = unsigned long;
	using FileNameStr = unsigned char[16];
	enum /* __unnamed */ {
		kHeaderSize = 8,
		kMaxArrays = 1024,
		kMaxLoadable = 64,
		kFileNameLength = 15,
		kArrayNameLength = 15,
	};
	struct _cArray::FileAndType{ // not packed(0x8 bytes) TI: 0x3256
		/*+0x0*/   /*unpacked*/ class ResFile *file;
		/*+0x4*/   unsigned long type;
	};
	struct _cArray::Header{ // not packed(0x8 bytes) TI: 0x32ad
		/*+0x0*/   short entrySize; // 0x2 bytes
		/*+0x2*/   short xSize; // 0x2 bytes
		/*+0x4*/   short ySize; // 0x2 bytes
		/*+0x6*/   short _pad; // 0x2 bytes
	};
public:
	static /*unpacked*/ class _cArray **sArrayTable;
	// calltype: NearC
	static void MakeTable();
	// calltype: NearC
	static void DeleteTable();
private:
	void CheckIntoTable();
	unsigned short SetSize(long, long);
	void SetXPointers();
	void FillHeader();
	void SetSizeAndHeaders(long, long);
	unsigned char * _GetPointer(long, long);
protected:
	/*+0x4*/   void * __ptr32 *fData;
public:
	/*+0x8*/   void * __ptr32 fDataHandle;
	/*+0xc*/   unsigned char * fDataPtr;
	/*+0x10*/  long fySize;
	/*+0x14*/  long fxSize;
	/*+0x18*/  long fEntrySize;
protected:
	/*+0x1c*/  unsigned long fDataHandleSize;
	/*+0x20*/  short fResID; // 0x2 bytes
	/*+0x22*/  short _pad; // 0x2 bytes
	/*+0x24*/  /*unpacked*/ class ResFile *fFile;
	/*+0x28*/  unsigned long fType;
	/*+0x2c*/  unsigned char fFileName[16]; // 0x10 bytes
	/*+0x3c*/  unsigned char fName[16]; // 0x10 bytes
	/*+0x4c*/  unsigned long fTinyName;
	static /*unpacked*/ struct _cArray::FileAndType fsLoaded[64];
public:
	void _cArray(long, long, long, unsigned long, /*unpacked*/ class ResFile*, unsigned long);
	void _cArray(long, long, long, unsigned char *, /*unpacked*/ class ResFile*, unsigned long);
protected:
	void _cArray(void * __ptr32, /*unpacked*/ class ResFile*, long, void (*)(void * __ptr32, long));
private:
	void BeginCreate(long, long, long, unsigned char *, /*unpacked*/ class ResFile*, unsigned long);
	void FromDiskCreate(void * __ptr32, /*unpacked*/ class ResFile*, long, void (*)(void * __ptr32, long));
public:
	unsigned long GetName();
	void GetName(unsigned char *);
	// calltype: NearC
	static /*unpacked*/ class _cArray* GetArray(unsigned long, short);
	// calltype: NearC
	static /*unpacked*/ class _cArray* GetArrayByType(unsigned long, short);
	// calltype: NearC
	static short GetArrayIndexInType(/*unpacked*/ class _cArray*);
	// calltype: NearC
	static short GetNumArraysByType(unsigned long);
	// calltype: NearC
	static short GetLoadedIndex(/*unpacked*/ class ResFile*, unsigned long);
	// calltype: NearC
	static void LoadAllArrays(/*unpacked*/ class ResFile*, unsigned long, short, void (*)(void * __ptr32, long));
	static unsigned short sAllLoaded;
	// calltype: NearC
	static void DeleteAllArrays();
	void ClearBytes(signed char);
	short InsertRow(short);
	short InsertColumn(short);
	short DeleteRow(short);
	short DeleteColumn(short);
	unsigned short Resize(long, long, signed char);
	virtual void WriteToDisk(); // vtable+0x0
	void CopyFrom(/*unpacked*/ class _cArray*);
	void CopyFrom(unsigned long);
	void CopyFrom(unsigned char *);
	void CopyToByFTN(/*unpacked*/ class ResFile*, unsigned long, unsigned char *);
	void CopyTo(/*unpacked*/ class _cArray*);
	void CopyTo(unsigned long);
	void CopyTo(unsigned char *);
	void ~_cArray();
	void DeleteResource();
	// calltype: NearC
	static unsigned short IsNameTaken(unsigned long, short);
};

// Type: /*unpacked*/ struct _cArray::FileAndType;
struct _cArray::FileAndType{ // not packed(0x8 bytes) TI: 0x3256
	/*+0x0*/   /*unpacked*/ class ResFile *file;
	/*+0x4*/   unsigned long type;
};

// Type: /*unpacked*/ class FlatResFile;
// VTABLE: COPTER_D 0x00593508
class FlatResFile : public FlatFile
{ // not packed(0x11c bytes) TI: 0x330e
protected:
	/*+0x110*/ /*unpacked*/ class ResMap *fMap;
	/*+0x114*/ long fError;
	/*+0x118*/ short _alignPad; // 0x2 bytes
public:
	void FlatResFile();
	virtual void ~FlatResFile() /* override */;
	void LoadResMap(void * __ptr32*, short *, long *);
	unsigned short FileEquals(/*unpacked*/ class FlatResFile*);
	virtual long Open(unsigned char *) /* override */;
	virtual long Open(char *) /* override */;
	long OpenFromName();
	virtual long Close() /* override */;
	short CountTypes();
	unsigned long GetIndType(short);
	short Count(unsigned long);
	void * __ptr32 GetByID(unsigned long, short, void (*)(void * __ptr32, long));
	void * __ptr32 GetByName(unsigned long, unsigned char *, void (*)(void * __ptr32, long));
	void * __ptr32 GetByIndex(unsigned long, short, void (*)(void * __ptr32, long));
	void GetName(void * __ptr32, unsigned char *);
	void GetID(void * __ptr32, short *);
	unsigned long GetResType(void * __ptr32);
	void Release(void * __ptr32);
	void Detach(void * __ptr32);
	void Load(void * __ptr32);
	long GetError();
	void Add(void * __ptr32, unsigned long, short, unsigned char *);
	void ExclusiveAdd(void * __ptr32, unsigned long, short, unsigned char *);
	void FindUniqueName(unsigned long, unsigned char *);
	short FindUniqueID(unsigned long);
	void Write(void * __ptr32);
	void Remove(void * __ptr32);
	void GetString(unsigned char *, short, short);
	// calltype: NearC
	static short CheckForLeaks();
};

// Type: /*unpacked*/ class FlatFile;
// VTABLE: COPTER_D 0x00593620
class FlatFile{ // not packed(0x110 bytes) TI: 0x32f4
	enum /* __unnamed */ {
		kMaxNameLen = 255,
	};
protected:
	/*+0x4*/   /*unpacked*/ class FlatFile *fNext;
	/*+0x8*/   unsigned char fName[256]; // 0x100 bytes
	/*+0x108*/ long fFileID;
	/*+0x10c*/ /*unpacked*/ struct _iobuf *fFile;
	long UniqueID();
private:
	static /*unpacked*/ class FlatFile *sList;
	static long sLastFileID;
	void Link();
	void Unlink();
	unsigned short Exclusive();
public:
	void FlatFile();
	virtual void ~FlatFile(); // vtable+0x0
	// calltype: NearC
	static /*unpacked*/ class FlatFile* FindByName(unsigned char *);
	unsigned short SameFile(/*unpacked*/ class FlatFile*);
	virtual long Open(unsigned char *); // vtable+0x4
	virtual long Open(char *); // vtable+0x8
	virtual long Close(); // vtable+0xc
	void OpenFromOtherFile(/*unpacked*/ class FlatFile*);
	long GetFileName(unsigned char *);
	unsigned short ValidFile();
	long ReadBlock(void * __ptr32, long *);
	long Read4(long *);
	long Read2(short *);
	long Read1(signed char *);
	long SetPos(long);
	long Advance(long);
	// calltype: NearC
	static short CheckForLeaks();
	long GetFileID();
	/*unpacked*/ struct _iobuf* GetFile();
};



