// Module: Utils.obj
// Source: C:\Copter\Source\X\Utils.cpp
// autogenerated by simcopter_tool from PDB file

// Type: unsigned char *;

// Type: void;

// Type: long *;

// Type: unsigned char;

// Type: unsigned short;

// Type: long;

// Type: int32_t;

// Type: unsigned long;

// Type: unsigned long *;

// Type: signed char *;

// Type: float;

// Type: double;

// Type: short;

// Type: char *;

// Type: signed char;

// Type: void * __ptr32;

// Type: /*unpacked*/ struct Rect (forward reference);
struct Rect{ // not packed(0x8 bytes) TI: 0x3463
	/*+0x0*/   short top; // 0x2 bytes
	/*+0x2*/   short left; // 0x2 bytes
	/*+0x4*/   short bottom; // 0x2 bytes
	/*+0x6*/   short right; // 0x2 bytes
};

// Type: /*unpacked*/ struct Point;
struct Point{ // not packed(0x4 bytes) TI: 0x341c
	/*+0x0*/   short v; // 0x2 bytes
	/*+0x2*/   short h; // 0x2 bytes
};

// Type: /*unpacked*/ struct Point (forward reference);
struct Point{ // not packed(0x4 bytes) TI: 0x341c
	/*+0x0*/   short v; // 0x2 bytes
	/*+0x2*/   short h; // 0x2 bytes
};



// Contribution: 1:00164ca0-00165846 Module: 184, 16 byte alignment, code, execute, read, 
// FUNCTION: COPTER_D 0x00565ca0
void EmptyPStr(unsigned char * str) {
// LINE 55:
	str[0] = 0x0;
// LINE 56:
	return;
}

// FUNCTION: COPTER_D 0x00565cb6
unsigned short Str2Num(unsigned char * str, long * num) {
	/*bp-0x4*/   unsigned short neg;
	/*bp-0x8*/   unsigned char count;
	/*bp-0xc*/   unsigned char digit;

// LINE 62:
	neg = 0x0;
// LINE 65:
	count = 0x1;
// LINE 66:
_T13:
	__asm        xor    eax, eax;
	__asm        mov    al, count;
	__asm        mov    ecx, str;
	__asm        xor    edx, edx;
	__asm        mov    dl, [eax+ecx];
	__asm        cmp    edx, 0x20;
	__asm        jne    _T45;

	__asm        mov    eax, str;
	__asm        xor    ecx, ecx;
	__asm        mov    cl, [eax];
	__asm        xor    eax, eax;
	__asm        mov    al, count;
	__asm        cmp    ecx, eax;
	__asm        jl     _T45;
// LINE 67:
	count++;
